
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>加密经济学和Token经济的起源和定义 · Cryptoeconomics</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="CH02.html" />
    
    
    <link rel="prev" href="Incentive_design.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Cryptoeconomics
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="../Chapter_7_Economics/CH00_Preface.html">
            
                <a href="../Chapter_7_Economics/CH00_Preface.html">
            
                    
                    Preface
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="../Chapter_7_Economics/CH01_Valuation.html">
            
                <a href="../Chapter_7_Economics/CH01_Valuation.html">
            
                    
                    Valuation
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="../Chapter_7_Economics/CH02_Block_Rewards.html">
            
                <a href="../Chapter_7_Economics/CH02_Block_Rewards.html">
            
                    
                    Block Rewards
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="../Chapter_7_Economics/CH03_Transaction_Fees.html">
            
                <a href="../Chapter_7_Economics/CH03_Transaction_Fees.html">
            
                    
                    Transaction Fees
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.5" data-path="../Chapter_7_Economics/CH04_Acknowledgement.html">
            
                <a href="../Chapter_7_Economics/CH04_Acknowledgement.html">
            
                    
                    Acknowledgement
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Incentive_design.html">
            
                <a href="Incentive_design.html">
            
                    
                    Incentive_design
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="CH01.html">
            
                <a href="CH01.html">
            
                    
                    加密经济学和Token经济的起源和定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="CH02.html">
            
                <a href="CH02.html">
            
                    
                    机制设计和博弈论基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="CH03.html">
            
                <a href="CH03.html">
            
                    
                    共识机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="CH04.html">
            
                <a href="CH04.html">
            
                    
                    Token分类和Token经济的设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="CH05.html">
            
                <a href="CH05.html">
            
                    
                    Token的供给和需求
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >加密经济学和Token经济的起源和定义</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;token&#x7ECF;&#x6D4E;&#x7684;&#x8D77;&#x6E90;&#x548C;&#x5B9A;&#x4E49;">&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;Token&#x7ECF;&#x6D4E;&#x7684;&#x8D77;&#x6E90;&#x548C;&#x5B9A;&#x4E49;</h2>
<h4 id="&#x4EC0;&#x4E48;&#x662F;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#xFF1F;</h4>
<p>&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x6982;&#x5FF5;&#x6700;&#x65E9;&#x662F;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x521B;&#x59CB;&#x4EBA; Vitalik &#x7684;<a href="https://vitalik.ca/files/intro_cryptoeconomics.pdf" target="_blank">ppt</a> &#x4E2D;&#x63D0;&#x51FA;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x7BC7;&#x89E3;&#x91CA;&#x5176;PPT&#x7684;<a href="https://blockgeeks.com/guides/what-is-cryptoeconomics/" target="_blank">&#x6587;&#x7AE0;</a>&#x3002;</p>
<p>Vitalik&#x8BA4;&#x4E3A;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x4E3B;&#x8981;&#x6DB5;&#x76D6;&#x4E09;&#x5757;&#xFF1A;</p>
<ol>
<li>&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x6709;&#x76EE;&#x7684;&#x6027;&#x7684;&#x7CFB;&#x7EDF;,&#x5373;&#x671F;&#x671B;&#x7279;&#x6027;&#xFF08;desired properties&#xFF09;</li>
<li>&#x7528;&#x52A0;&#x5BC6;&#x5B66;&#x8BC1;&#x660E;&#x8FC7;&#x53BB;&#x7684;&#x4E8B;&#x60C5;</li>
<li><p>&#x7528;&#x7ECF;&#x6D4E;&#x6FC0;&#x52B1;&#x6765;&#x4FDD;&#x8BC1;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x76EE;&#x6807;&#x53EF;&#x4EE5;&#x7EF4;&#x6301;&#x5230;&#x672A;&#x6765;</p>
<p>&#x4ED6;&#x8BA4;&#x4E3A;&#xFF1A;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x6765;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
</li>
</ol>
<h4 id="&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x91CD;&#x8981;&#x6027;">&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x91CD;&#x8981;&#x6027;</h4>
<ol>
<li><p>&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x53EF;&#x4EE5;&#x8BA9;&#x4E92;&#x4E0D;&#x8BA4;&#x8BC6;&#x3001;&#x4E92;&#x4E0D;&#x4FE1;&#x4EFB;&#x7684;&#x5404;&#x4E2A;&#x53C2;&#x4E0E;&#x65B9;&#x8FBE;&#x6210;&#x5171;&#x8BC6;</p>
<p> &#x5BC6;&#x7801;&#x5B66;&#x548C;&#x7ECF;&#x6D4E;&#x6FC0;&#x52B1;&#x662F;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4EE5;&#x6B64;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x5171;&#x8BC6;&#x80FD;&#x529B;&#x3001;&#x4E0D;&#x4F9D;&#x8D56;&#x53EF;&#x4FE1;&#x8D56;&#x6743;&#x5A01;&#x673A;&#x6784;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7F51;&#x7EDC;&#x3002;</p>
</li>
<li><p>&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x662F;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x548C;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x7684;&#x57FA;&#x7840;</p>
<p> &#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x5206;&#x6790;&#x7684;&#x662F;&#x7531;&#x6BD4;&#x7279;&#x5E01;&#x5F00;&#x521B;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x6570;&#x5B57;&#x7ECF;&#x6D4E;&#x4E2D;&#x7684;&#x7ECF;&#x6D4E;&#x4E92;&#x52A8;&#xFF0C;&#x662F;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x548C;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
</li>
</ol>
<h4 id="&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x662F;&#x901A;&#x8FC7;&#x5BC6;&#x7801;&#x5B66;&#x548C;&#x535A;&#x5F08;&#x8BBA;&#x6765;&#x8BBE;&#x8BA1;&#x8981;&#x7ED9;&#x533A;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x8BA1;&#x7B97;&#x7F51;&#x8DEF;">&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x662F;&#x901A;&#x8FC7;&#x5BC6;&#x7801;&#x5B66;&#x548C;&#x535A;&#x5F08;&#x8BBA;&#x6765;&#x8BBE;&#x8BA1;&#x8981;&#x7ED9;&#x533A;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x8BA1;&#x7B97;&#x7F51;&#x8DEF;</h4>
<ul>
<li><p>&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x4F5C;&#x7528;</p>
<p>&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x7528;&#x9014;&#x662F;:&#x8BC1;&#x660E;<strong>&#x8FC7;&#x53BB;</strong>&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p> &#x7B2C;&#x4E00;&#xFF0C;&#x52A0;&#x5BC6;&#x5DE5;&#x5177;&#xFF0C;&#x6BD4;&#x5982;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x6211;&#x53D1;&#x8D77;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x6216;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x6709;&#x79C1;&#x94A5;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x5C31;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x8FD9;&#x662F;&#x8FC7;&#x53BB;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p> &#x7B2C;&#x4E8C;&#xFF0C;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x5373;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF08;proof of work&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x6709;&#x4EBA;&#x505A;&#x8FC7;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x8FC7;&#x53BB;&#x7684;&#x4EA4;&#x6613;&#x6CA1;&#x6709;&#x88AB;&#x66F4;&#x6539;&#x3002;</p>
<p> &#x7B2C;&#x4E09;&#xFF0C; &#x9ED8;&#x514B;&#x5C14;&#x6811;&#xFF08;merkle tree&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x7684;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x63D0;&#x4F9B;&#x6240;&#x6709;&#x7684;&#x5B50;&#x4EA4;&#x6613;&#x7684;&#x6570;&#x636E;&#x3002;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x5C11;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x662F;&#x5426;&#x6709;&#x6548;&#x3002;&#x8FD9;&#x5C31;&#x662F; backward-facing&#xFF0C;&#x5BC6;&#x7801;&#x5B66;&#x5728;&#x8FD9;&#x4E9B;&#x65B9;&#x9762;&#x901A;&#x8FC7;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x8FC7;&#x53BB;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x3002;</p>
</li>
</ul>
<ul>
<li><p>&#x535A;&#x5F08;&#x8BBA;&#x7684;&#x4F5C;&#x7528;</p>
<p>&#x535A;&#x5F08;&#x8BBA;&#x7684;&#x7528;&#x9014;&#xFF1A;&#x9F13;&#x52B1;&#x548C;&#x9884;&#x6D4B;<strong>&#x672A;&#x6765;&#x884C;&#x4E3A;</strong></p>
<p>&#x56E0;&#x4E3A;&#x4F60;&#x7528;&#x7684;token&#x6216;&#x53EB;coins&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x4E00;&#x4E9B;&#x6FC0;&#x52B1;&#xFF0C;&#x5F71;&#x54CD;&#x6240;&#x6709;&#x8FD9;&#x4E2A;&#x5E02;&#x573A;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x52A8;&#x4F5C;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x5F71;&#x54CD;&#x672A;&#x6765;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x771F;&#x5B9E;&#x7684;&#x884C;&#x4E3A;&#x8FDB;&#x884C;&#x5956;&#x52B1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5BF9;&#x6B3A;&#x9A97;&#x505A;&#x51FA;token&#x7684;&#x60E9;&#x7F5A;&#x3002;&#x535A;&#x5F08;&#x8BBA;&#x4FBF;&#x662F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x4FDD;&#x8BC1;&#x672A;&#x6765;&#x7684;&#x4E00;&#x4E9B;&#x884C;&#x4E3A;&#x3002;</p>
</li>
</ul>
<p>&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x65E2;&#x8BC1;&#x660E;&#x8FC7;&#x53BB;&#xFF0C;&#x53C8;&#x4FDD;&#x969C;&#x672A;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4EBA;&#x79F0;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x53EB;&#x505A;&#x9006;&#x5411;&#x8BBE;&#x8BA1;&#x672A;&#x6765;&#xFF08;reverse-engineering future&#xFF09;&#x3002;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x786E;&#x5B9A;&#x6E05;&#x695A;&#x7CFB;&#x7EDF;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x5373;&#x60F3;&#x8981;&#x7CFB;&#x7EDF;&#x8FBE;&#x5230;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x72B6;&#x6001;&#x3002;&#x7136;&#x540E;&#x6839;&#x636E;&#x76EE;&#x6807;&#x53BB;&#x8BBE;&#x8BA1;&#x524D;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<h4 id="&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x7684;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x5E94;&#x7528;">&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x7684;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x5E94;&#x7528;</h4>
<ul>
<li><p>&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#xFF1A;&#x76EE;&#x6807;&#x8BBE;&#x8BA1;</p>
<p><strong>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x76EE;&#x6807;&#x8BBE;&#x8BA1;</strong>&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x7B2C;&#x4E00;&#x76EE;&#x6807;&#x662F;&#xFF1A;&#x53EA;&#x53EF;&#x8FFD;&#x52A0;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF08;append-only blockchain&#xFF09;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x53EA;&#x53EF;&#x589E;&#x52A0;&#x533A;&#x5757;&#x3001;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#x6216;&#x5220;&#x9664;&#x524D;&#x9762;&#x7684;&#x533A;&#x5757;&#xFF1B;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x662F;&#xFF1A;&#x7CFB;&#x7EDF;&#x53EA;&#x989D;&#x80FD;&#x5141;&#x8BB8;&#x4E00;&#x4E9B;&#x6709;&#x6548;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x8FD9;&#x4E2A;&#x8DDF;UTXO&#x6709;&#x5173;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF1A;&#x52A0;&#x5BC6;&#x5DE5;&#x5177;</p>
<p><strong>&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x7684;&#x52A0;&#x5BC6;&#x5DE5;&#x5177;</strong>&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x5230;&#x7684;&#x5BC6;&#x7801;&#x5B66;&#x5DE5;&#x5177;&#x5305;&#x62EC;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x548C;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7B49;&#xFF0C;&#x7528;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x6765;&#x786E;&#x4FDD;&#x82B1;&#x8D39;&#x4E86;&#x8BA1;&#x7B97;&#x5DE5;&#x4F5C;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x7528;&#x54C8;&#x5E0C;&#x8FDE;&#x63A5;&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x6765;&#x4FDD;&#x8BC1;&#x4E0D;&#x53EF;&#x7BE1;&#x6539;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#xFF1A;&#x6FC0;&#x52B1;&#x8BBE;&#x8BA1;</p>
<p><strong>&#x6BD4;&#x7279;&#x5E01;&#x91CC;&#x7684;&#x6FC0;&#x52B1;&#x8BBE;&#x8BA1;</strong>&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6FC0;&#x52B1;&#x5206;&#x4E3A;&#x5956;&#x52B1;&#x548C;&#x60E9;&#x7F5A;&#x4E24;&#x90E8;&#x5206;&#x3002;&#x5956;&#x52B1;&#x662F;&#xFF0C;&#x6316;&#x51FA;&#x533A;&#x5757;&#x5C31;&#x6709;&#x5956;&#x52B1;&#xFF0C;&#x6700;&#x65E9;&#x6316;&#x51FA;&#x4E00;&#x4E2A;&#x5757;&#x6709;50BTC&#x5956;&#x52B1;&#xFF0C;&#x5956;&#x52B1;&#x77FF;&#x5DE5;&#x505A;&#x771F;&#x5B9E;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x8FD8;&#x6709;&#x7ED9;&#x4EA4;&#x6613;&#x624B;&#x7EED;&#x8D39;&#x6765;&#x5438;&#x5F15;&#x66F4;&#x591A;&#x7684;&#x77FF;&#x5DE5;&#x53BB;&#x6316;&#x77FF;&#x3002;&#x5B83;&#x7684;&#x60E9;&#x7F5A;&#x5462;&#xFF1F;&#x5982;&#x4F55;&#x907F;&#x514D;&#x975E;&#x771F;&#x5B9E;&#x884C;&#x4E3A;&#xFF1F;&#x539F;&#x56E0;&#x662F;PoW&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x82B1;&#x8D39;cpu&#x7684;&#x7B97;&#x529B;&#x6765;&#x505A;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x4E0D;&#x88AB;&#x5141;&#x8BB8;&#x7684;&#x6216;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x4E3B;&#x94FE;&#x7684;&#x533A;&#x5757;&#x4E0A;&#x53BB;&#x6316;&#x77FF;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x6D6A;&#x8D39;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8981;&#x7ED9;&#x60E9;&#x7F5A;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x60E9;&#x7F5A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#xFF0C;&#x4E5F;&#x662F;&#x6709;&#x6210;&#x672C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FBE;&#x5230;51%&#x7684;&#x653B;&#x51FB;&#xFF0C;&#x9700;&#x8981;&#x5F88;&#x591A;&#x786C;&#x4EF6;&#xFF0C;&#x9700;&#x8981;&#x5F88;&#x5927;&#x7684;&#x6210;&#x672C;&#x3002;</p>
</li>
</ul>
<h4 id="&#x4EC0;&#x4E48;&#x662F;token&#x7ECF;&#x6D4E;">&#x4EC0;&#x4E48;&#x662F;token&#x7ECF;&#x6D4E;</h4>
<p>token&#x7ECF;&#x6D4E;&#x5C31;&#x662F;&#x4F7F;&#x7528;token&#x7684;&#x6FC0;&#x52B1;&#x6765;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x4E2A;&#x7ECF;&#x6D4E;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x4E2A;&#x5E02;&#x573A;&#xFF0C;&#x6216;&#x4E00;&#x4E2A;&#x5546;&#x4E1A;&#x7F51;&#x7EDC;&#x3002;&#x4E3B;&#x8981;&#x56F4;&#x7ED5;&#x9700;&#x6C42;&#x3001;&#x4F9B;&#x7ED9;&#x7ED9;&#x4E88;&#x6FC0;&#x52B1;&#xFF0C;&#x5177;&#x4F53;&#x5305;&#x62EC;&#xFF1A;&#x9650;&#x5236;&#x6216;&#x51CF;&#x5C11;&#x4F9B;&#x7ED9;&#x3001;&#x63D0;&#x9AD8;&#x9700;&#x6C42;&#x7B49;&#x3002;</p>
<ul>
<li>&#x6FC0;&#x52B1;&#x7684;&#x6700;&#x7EC8;&#x76EE;&#x6807;&#xFF1A;<ol>
<li>&#x786E;&#x4FDD;token&#x4EF7;&#x683C;&#x7A33;&#x5B9A;</li>
<li>&#x786E;&#x4FDD;token&#x4EF7;&#x683C;&#x6709;&#x957F;&#x671F;&#x5347;&#x503C;&#x7A7A;&#x95F4;</li>
<li>&#x786E;&#x4FDD;&#x7F51;&#x7EDC;&#x80FD;&#x5438;&#x5F15;&#x8DB3;&#x591F;&#x7684;&#x53C2;&#x4E0E;&#x8005;</li>
</ol>
</li>
</ul>
<h4 id="&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;token&#x7ECF;&#x6D4E;&#x7684;&#x533A;&#x522B;">&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;token&#x7ECF;&#x6D4E;&#x7684;&#x533A;&#x522B;</h4>
<ul>
<li><p><strong>&#x9002;&#x7528;&#x573A;&#x666F;</strong></p>
<p>&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x662F;&#x7528;&#x5728;&#x5E95;&#x5C42;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x3001;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x8BA1;&#x7B97;&#x53CA;&#x7F51;&#x7EDC;&#x8BBE;&#x8BA1;&#x3002;&#x800C;token&#x7ECF;&#x6D4E;&#x8BBE;&#x8BA1;&#x662F;&#x9488;&#x5BF9;&#x4E0A;&#x5C42;&#x7684;token&#x5316;&#x5546;&#x4E1A;&#xFF08;tokenized businesses&#xFF09;&#xFF0C;&#x6BD4;&#x5982;DAPP&#x6216;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#xFF0C;&#x5B83;&#x5E01;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x66F4;&#x504F;&#x5411;&#x5E94;&#x7528;&#x5C42;&#x9762;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x4EE5;&#x592A;&#x574A;&#x7CFB;&#x7EDF;&#x5C31;&#x662F;&#x6700;&#x65E9;&#x7684;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x8BBE;&#x8BA1;&#xFF0C;&#x5C5E;&#x4E8E;&#x5E95;&#x5C42;&#x3002;&#x8FD8;&#x6709;&#x6BD4;&#x5982;&#x4E8C;&#x5C42;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x8BA1;&#x7B97;&#x7F51;&#x7EDC;&#x3002;&#x800C;&#x50CF;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x3001;&#x793E;&#x4EA4;&#x5A92;&#x4F53;&#x6216;&#x8005;&#x5B9E;&#x4F53;&#x7ECF;&#x6D4E;&#x76F8;&#x5173;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x90FD;&#x5C5E;&#x4E8E;token&#x7ECF;&#x6D4E;&#x7814;&#x7A76;&#x7684;&#x8303;&#x7574;&#x3002;</p>
</li>
<li><p><strong>&#x5DE5;&#x5177;&#x4E0A;&#x7684;&#x533A;&#x522B;</strong></p>
<p>&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x8BA1;&#x7B97;&#x7F51;&#x7EDC;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x662F;&#x505A;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x3001;&#x6210;&#x529F;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#xFF0C;&#x56E0;&#x4E3A;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x662F;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#x7684;&#x4E2D;&#x4ECB;&#x4E0B;&#xFF0C;&#x8BA9;&#x5F88;&#x591A;&#x5355;&#x72EC;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#xFF0C;&#x5728;&#x4EC0;&#x4E48;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x4EA4;&#x6613;&#x548C;&#x4EC0;&#x4E48;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x4EA4;&#x6613;&#x4E0A;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;&#x6240;&#x4EE5;&#x8BBE;&#x8BA1;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x5DE5;&#x5177;&#x5C31;&#x5305;&#x62EC;&#x535A;&#x5F08;&#x8BBA;&#x3001;P2P&#x7F51;&#x7EDC;&#x3001;&#x5BC6;&#x7801;&#x5B66;&#x3001;&#x8D27;&#x5E01;&#x7406;&#x8BBA;&#x548C;&#x75C5;&#x6BD2;&#x5FAA;&#x73AF;&#xFF08;viralloops&#xFF09;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x90FD;&#x52A0;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x3002;&#x800C;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x8FD8;&#x6709;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x6216;&#x8005;&#x5E02;&#x573A;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x52A8;&#x529B;&#x5206;&#x6790;&#xFF0C;&#x8FD8;&#x6709;&#x6FC0;&#x52B1;&#x8BBE;&#x8BA1;&#x7684;&#x6218;&#x7565;&#xFF0C;&#x8FD8;&#x6709;&#x600E;&#x6837;&#x8BBE;&#x5B9A;&#x89C4;&#x5219;&#x6765;&#x6267;&#x884C;&#x524D;&#x9762;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x8FD9;&#x662F;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x5171;&#x8BC6;&#x673A;&#x5236;&#x505A;&#x597D;&#x4E86;&#x5C31;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x4F4E;&#x6210;&#x672C;&#x3001;&#x9AD8;&#x5B9E;&#x7528;&#x6027;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x9AD8;&#x589E;&#x957F;&#x7387;&#x3002;&#x7136;&#x540E;&#x5F62;&#x6210;&#x957F;&#x671F;&#x7A33;&#x5B9A;&#x7684;&#x8981;&#x7ED9;&#x5206;&#x5E03;&#x5F0F;&#x7F51;&#x7EDC;&#x3002;&#x5982;&#x679C;&#x505A;&#x4E0D;&#x597D;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x5931;&#x8D25;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;token&#x5546;&#x4E1A;&#x5316;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x5305;&#x62EC;&#x535A;&#x5F08;&#x8BBA;&#x3001;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x3001;&#x8D27;&#x5E01;&#x7406;&#x8BBA;&#x3001;&#x79EF;&#x5206;&#x5956;&#x52B1;&#x548C;&#x75C5;&#x6BD2;&#x5FAA;&#x73AF;&#xFF0C;&#x8FD9;&#x4E9B;&#x52A0;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;token&#x6FC0;&#x52B1;&#x6A21;&#x578B;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x8FD9;&#x91CC;&#x9762;&#x540C;&#x6837;&#x4F1A;&#x6709;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x8FD8;&#x6709;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x6216;&#x5E02;&#x573A;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x52A8;&#x529B;&#x5206;&#x6790;&#xFF0C;&#x8FD8;&#x6709;&#x6FC0;&#x52B1;&#x8BBE;&#x8BA1;&#x7684;&#x6218;&#x7565;&#xFF0C;&#x4EE5;&#x53CA;&#x600E;&#x6837;&#x8BBE;&#x5B9A;&#x89C4;&#x5219;&#x6765;&#x6267;&#x884C;&#x524D;&#x9762;&#x7684;&#x601D;&#x7EF4;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x8BA1;&#x7684;&#x597D;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x7A33;&#x5B9A;&#x7684;&#x5546;&#x4E1A;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E0D;&#x597D;&#x5C31;&#x5931;&#x8D25;&#x3002;</p>
</li>
</ul>
<p>&#x5BF9;&#x6BD4;&#x53EF;&#x77E5;&#xFF0C;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x662F;&#x8981;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x7F51;&#x7EDC;&#xFF0C;token&#x7ECF;&#x6D4E;&#x662F;&#x8981;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;token&#x5316;&#x5546;&#x4E1A;&#x3002;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x5DE5;&#x5177;&#x5305;&#x542B;&#x5BC6;&#x7801;&#x5B66;&#x3001;&#x535A;&#x5F08;&#x8BBA;&#x3001;&#x548C;P2P&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C5E;&#x4E8E;&#x66F4;&#x5E95;&#x5C42;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x662F;&#x57FA;&#x4E8E;&#x5BC6;&#x7801;&#x5B66;&#x6240;&#x4F5C;&#x7684;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#xFF0C;&#x5B83;&#x5305;&#x62EC;&#x4E86;BTC&#x8FD9;&#x4E9B;&#x5E01;&#x548C;&#x57FA;&#x4E8E;&#x516C;&#x94FE;&#x6240;&#x53D1;&#x884C;&#x7684;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#xFF1B;&#x800C;token&#x7ECF;&#x6D4E;&#x662F;&#x5305;&#x542B;token&#x5408;&#x7EA6;&#xFF0C;&#x5C31;&#x662F;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#xFF0C;&#x7136;&#x540E;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5C31;&#x662F;&#x5FE0;&#x8BDA;&#x5EA6;&#x5956;&#x52B1;&#xFF08;loyalty rewards&#xFF09;&#x7CFB;&#x7EDF;&#xFF0C;&#x6216;&#x8005;&#x53EB;&#x79EF;&#x5206;&#x7CFB;&#x7EDF;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#xFF0C;&#x600E;&#x4E48;&#x7528;&#x4E00;&#x4E9B;&#x79EF;&#x5206;&#x6765;&#x5438;&#x5F15;&#x7528;&#x6237;&#x5230;&#x4F60;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x6765;&#x5438;&#x5F15;&#x7528;&#x6237;&#x53CD;&#x590D;&#x4F7F;&#x7528;&#x4F60;&#x7684;&#x4EA7;&#x54C1;&#x6216;&#x8005;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x4F46;&#x4E8C;&#x8005;&#x6709;&#x8981;&#x7ED9;&#x5171;&#x540C;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x7406;&#x89E3;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x9700;&#x6C42;&#x548C;&#x52A8;&#x673A;&#xFF0C;&#x5E76;&#x8BBE;&#x8BA1;&#x6FC0;&#x52B1;&#x63AA;&#x65BD;&#x6765;&#x9F13;&#x52B1;&#x7CFB;&#x7EDF;&#x9884;&#x671F;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p><strong>&#x6240;&#x4EE5;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x662F;&#x5E95;&#x5C42;&#x7684;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#xFF0C;token&#x7ECF;&#x6D4E;&#x66F4;&#x591A;&#x504F;&#x5411;&#x5E94;&#x7528;&#x5C42;&#x9762;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#x4E00;&#x79CD;&#x6FC0;&#x52B1;&#x8BBE;&#x8BA1;&#x3002;</strong></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Incentive_design.html" class="navigation navigation-prev " aria-label="Previous page: Incentive_design">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="CH02.html" class="navigation navigation-next " aria-label="Next page: 机制设计和博弈论基础">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"加密经济学和Token经济的起源和定义","level":"1.2.1","depth":2,"next":{"title":"机制设计和博弈论基础","level":"1.2.2","depth":2,"path":"Incentive_design/CH02.md","ref":"./Incentive_design/CH02.md","articles":[]},"previous":{"title":"Incentive_design","level":"1.2","depth":1,"path":"Incentive_design/Incentive_design.md","ref":"./Incentive_design/Incentive_design.md","articles":[{"title":"加密经济学和Token经济的起源和定义","level":"1.2.1","depth":2,"path":"Incentive_design/CH01.md","ref":"./Incentive_design/CH01.md","articles":[]},{"title":"机制设计和博弈论基础","level":"1.2.2","depth":2,"path":"Incentive_design/CH02.md","ref":"./Incentive_design/CH02.md","articles":[]},{"title":"共识机制","level":"1.2.3","depth":2,"path":"Incentive_design/CH03.md","ref":"./Incentive_design/CH03.md","articles":[]},{"title":"Token分类和Token经济的设计","level":"1.2.4","depth":2,"path":"Incentive_design/CH04.md","ref":"./Incentive_design/CH04.md","articles":[]},{"title":"Token的供给和需求","level":"1.2.5","depth":2,"path":"Incentive_design/CH05.md","ref":"./Incentive_design/CH05.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["mathjax","sectionx","back-to-top-button"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sectionx":{},"highlight":{},"back-to-top-button":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Cryptoeconomics","gitbook":"*"},"file":{"path":"Incentive_design/CH01.md","mtime":"2019-04-20T15:59:04.354Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-04-20T18:18:08.586Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

