
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>机制设计和博弈论基础 · Cryptoeconomics</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="CH03.html" />
    
    
    <link rel="prev" href="CH01.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Cryptoeconomics
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="../Chapter_7_Economics/CH00_Preface.html">
            
                <a href="../Chapter_7_Economics/CH00_Preface.html">
            
                    
                    Preface
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="../Chapter_7_Economics/CH01_Valuation.html">
            
                <a href="../Chapter_7_Economics/CH01_Valuation.html">
            
                    
                    Valuation
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="../Chapter_7_Economics/CH02_Block_Rewards.html">
            
                <a href="../Chapter_7_Economics/CH02_Block_Rewards.html">
            
                    
                    Block Rewards
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="../Chapter_7_Economics/CH03_Transaction_Fees.html">
            
                <a href="../Chapter_7_Economics/CH03_Transaction_Fees.html">
            
                    
                    Transaction Fees
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.5" data-path="../Chapter_7_Economics/CH04_Acknowledgement.html">
            
                <a href="../Chapter_7_Economics/CH04_Acknowledgement.html">
            
                    
                    Acknowledgement
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Incentive_design.html">
            
                <a href="Incentive_design.html">
            
                    
                    Incentive_design
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="CH01.html">
            
                <a href="CH01.html">
            
                    
                    加密经济学和Token经济的起源和定义
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="CH02.html">
            
                <a href="CH02.html">
            
                    
                    机制设计和博弈论基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="CH03.html">
            
                <a href="CH03.html">
            
                    
                    共识机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="CH04.html">
            
                <a href="CH04.html">
            
                    
                    Token分类和Token经济的设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="CH05.html">
            
                <a href="CH05.html">
            
                    
                    Token的供给和需求
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >机制设计和博弈论基础</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x548C;&#x535A;&#x5F08;&#x8BBA;&#x57FA;&#x7840;">&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x548C;&#x535A;&#x5F08;&#x8BBA;&#x57FA;&#x7840;</h2>
<h3 id="&#x673A;&#x5236;&#x8BBE;&#x8BA1;">&#x673A;&#x5236;&#x8BBE;&#x8BA1;</h3>
<h4 id="&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x673A;&#x5236;&#x8BBE;&#x8BA1;">&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x673A;&#x5236;&#x8BBE;&#x8BA1;</h4>
<p>&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#xFF0C;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x5C31;&#x662F;&#x4E00;&#x95E8;&#x8BBE;&#x5B9A;&#x89C4;&#x5219;&#x7684;&#x79D1;&#x5B66;&#x3002;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x662F;&#x901A;&#x8FC7;&#x8BBE;&#x5B9A;&#x89C4;&#x5219;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x4E0D;&#x540C;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x6218;&#x7565;&#x884C;&#x4E3A;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<h4 id="&#x4E8C;&#x3001;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x8DDF;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x5173;&#x7CFB;">&#x4E8C;&#x3001;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x8DDF;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x5173;&#x7CFB;</h4>
<p>&#x4E24;&#x8005;&#x7684;&#x6DB5;&#x76D6;&#x8303;&#x56F4;&#x4E0D;&#x540C;&#xFF0C;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x8BBE;&#x8BA1;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x5728;&#x52A0;&#x5BC6;&#x9886;&#x57DF;&#xFF0C;&#x800C;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x5219;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x8303;&#x56F4;&#x3002;</p>
<h4 id="&#x4E09;&#x3001;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x53D1;&#x5C55;&#x53F2;">&#x4E09;&#x3001;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x53D1;&#x5C55;&#x53F2;</h4>
<ol>
<li><p>&#x4E9A;&#x5F53;.&#x65AF;&#x5BC6;&#x2014;&#x2014;&#x201C;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x624B;&#x201D;&#x3001;&#x201C;&#x4EBA;&#x4F1A;&#x4E3A;&#x4E86;&#x81EA;&#x8EAB;&#x5229;&#x76CA;&#x6700;&#x5927;&#x5316;&#x201D;</p>
<p>&#x4E9A;&#x5F53;.&#x65AF;&#x5BC6;&#x4F5C;&#x4E3A;&#x56FD;&#x5BCC;&#x8BBA;&#x7684;&#x521B;&#x59CB;&#x4EBA;&#x5728;&#x7ECF;&#x6D4E;&#x5B66;&#x53F2;&#x4E0A;&#x62E5;&#x6709;&#x91CD;&#x8981;&#x7684;&#x5730;&#x4F4D;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x7684;&#x601D;&#x60F3;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x524D;&#x63D0;&#xFF1A;&#x4E2A;&#x4EBA;&#x7684;&#x52A8;&#x673A;&#x4E3B;&#x8981;&#x8981;&#x51FA;&#x4E8E;&#x81EA;&#x8EAB;&#x7684;&#x5229;&#x76CA;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x96C6;&#x4F53;&#x7684;&#x81EA;&#x8EAB;&#x5229;&#x76CA;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x201C;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x624B;&#x201D;&#xFF0C;&#x5B83;&#x662F;&#x63A8;&#x52A8;&#x6574;&#x4E2A;&#x793E;&#x4F1A;&#x8FDB;&#x6B65;&#x5230;&#x6700;&#x4F73;&#x72B6;&#x6001;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5E76;&#x4E0D;&#x5B8C;&#x7F8E;&#xFF0C;&#x4F46;&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x7684;&#x7406;&#x89E3;&#x81EA;&#x8EAB;&#x5229;&#x76CA;&#x7684;&#x529B;&#x91CF;&#x3002;</p>
</li>
<li><p>&#x5B89;&#x4E1C;&#x5C3C;.&#x5965;&#x53E4;&#x65AF;&#x4E01;.&#x5E93;&#x5C14;&#x8BFA;&#x2014;&#x2014;&#x7ADE;&#x4E89;&#x4F01;&#x4E1A;&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x751F;&#x4EA7;</p>
<p>&#x5E93;&#x5C14;&#x8BFA;&#x7684;&#x4E3B;&#x8981;&#x7814;&#x7A76;&#x5728;&#x4E86;&#x89E3;&#x5DE5;&#x5382;&#x662F;&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x4ED6;&#x4EEC;&#x7684;&#x751F;&#x4EA7;&#x6C34;&#x5E73;&#x7684;&#x3002;&#x5E93;&#x5C14;&#x8BFA;&#x7684;&#x8D21;&#x732E;&#x662F;&#x4ED6;&#x5C06;&#x516C;&#x53F8;&#x5B9A;&#x4E49;&#x4E3A;&#x4E00;&#x79CD;&#x201C;&#x6218;&#x7565;&#x6027;&#x7684;&#x884C;&#x52A8;&#x201D;&#xFF0C;&#x201C;&#x6218;&#x7565;&#x6027;&#x7684;&#x884C;&#x52A8;&#x201D;&#x610F;&#x5473;&#x7740;&#x516C;&#x53F8;&#x6839;&#x636E;&#x516C;&#x53F8;&#x5BF9;&#x624B;&#x7684;&#x751F;&#x4EA7;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x6218;&#x7565;&#x6027;&#x7684;&#x56DE;&#x5E94;&#x3002;&#x7406;&#x8BBA;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x4ECE;&#x4E0D;&#x540C;&#x51B3;&#x7B56;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x4EF7;&#x503C;&#x6765;&#x8861;&#x91CF;&#x5E76;&#x5224;&#x65AD;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x5C06;&#x91C7;&#x53D6;&#x4EC0;&#x4E48;&#x884C;&#x52A8;&#xFF0C;&#x8FD9;&#x4E2A;&#x7406;&#x5FF5;&#x5F62;&#x6210;&#x4E86;&#x535A;&#x5F08;&#x8BBA;&#x51B3;&#x7B56;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
</li>
<li><p>&#x7EA6;&#x7FF0;.&#x51AF;.&#x8BFA;&#x4F0A;&#x66FC;&#x2014;&#x2014;&#x300A;&#x535A;&#x5F08;&#x8BBA;&#x4E0E;&#x7ECF;&#x6D4E;&#x884C;&#x4E3A;&#x300B;</p>
</li>
<li><p>&#x7EA6;&#x7FF0;.&#x7EB3;&#x4EC0;&#x2014;&#x2014;&#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x3001;&#x83B1;&#x6602;&#x5C3C;&#x5FB7;.&#x8D6B;&#x7EF4;&#x5947;&#x2014;&#x2014;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x7406;&#x8BBA;</p>
</li>
<li><p>&#x57C3;&#x91CC;&#x514B;.&#x9A6C;&#x65AF;&#x91D1;&#x3001;&#x7F57;&#x6770;.&#x8FC8;&#x5C14;&#x68EE;&#x3001;&#x5A01;&#x5EC9;.&#x7EF4;&#x514B;&#x745E;&#x2014;&#x2014;&#x62CD;&#x5356;&#x7406;&#x8BBA;</p>
</li>
</ol>
<h4 id="&#x56DB;&#x3001;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x6700;&#x597D;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;">&#x56DB;&#x3001;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x6700;&#x597D;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;</h4>
<p>&#x6700;&#x597D;&#x7684;&#x5E94;&#x8BE5;&#x5C31;&#x662F;&#x62CD;&#x5356;&#x8BBE;&#x8BA1;&#xFF0C;&#x62CD;&#x5356;&#x8BBE;&#x8BA1;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x5982;&#x4F55;&#x8BA9;&#x6240;&#x6709;&#x7684;&#x7ADE;&#x4EF7;&#x8005;&#x62A5;&#x51FA;&#x4ED6;&#x4EEC;&#x7684;&#x771F;&#x5B9E;&#x4EF7;&#x683C;&#x3002;</p>
<ol>
<li><p>&#x6700;&#x9AD8;&#x4EF7;&#x62CD;&#x5356;</p>
<p>&#x6700;&#x9AD8;&#x4EF7;&#x62CD;&#x5356;&#x5C31;&#x662F;&#x51FA;&#x4EF7;&#x6700;&#x9AD8;&#x7684;&#x7ADE;&#x4EF7;&#x8005;&#x4F1A;&#x83B7;&#x5F97;&#x62CD;&#x5356;&#x54C1;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x5728;&#x7ADE;&#x62CD;&#x4E00;&#x4EF6;&#x827A;&#x672F;&#x54C1;&#x3002;&#x6211;&#x5BF9;&#x8FD9;&#x4EF6;&#x827A;&#x672F;&#x54C1;&#x7684;&#x4F30;&#x503C;&#x4E3A;10&#x5143;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x6700;&#x9AD8;&#x613F;&#x610F;&#x51FA;10&#x5143;&#x4E70;&#x5230;&#x8FD9;&#x4EF6;&#x827A;&#x672F;&#x54C1;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x4F1A;&#x6709;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x6309;&#x6211;&#x7684;&#x76F4;&#x5B9E;&#x5FC3;&#x7406;&#x4EF7;&#x683C;10&#x5143;&#x51FA;&#x4EF7;&#xFF0C;&#x8FD9;&#x65F6;&#x5982;&#x679C;&#x7ADE;&#x62CD;&#x6210;&#x529F;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x6536;&#x76CA;&#x4E3A;10&#x5143;&#x4F30;&#x4EF7;&#x51CF;10&#x5143;&#x51FA;&#x4EF7;&#xFF0C;&#x7B49;&#x4E8E;0&#x5143;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x51FA;&#x4EF7;&#x4E00;&#x4E2A;&#x6BD4;&#x6211;&#x771F;&#x5B9E;&#x4F30;&#x4EF7;&#x66F4;&#x4F4E;&#x7684;&#x4EF7;&#x683C;&#xFF0C;&#x6BD4;&#x5982;9&#x5143;&#xFF0C;&#x8FD9;&#x65F6;&#x5982;&#x679C;&#x6211;&#x7ADE;&#x62CD;&#x6210;&#x529F;&#xFF0C;&#x6211;&#x7684;&#x989D;&#x5916;&#x6536;&#x76CA;&#x5C31;&#x662F;10&#x5143;&#x51CF;&#x53BB;9&#x5143;&#x51FA;&#x4EF7;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6536;&#x76CA;1&#x5143;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x80FD;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x79CD;&#x6700;&#x9AD8;&#x4EF7;&#x7684;&#x62CD;&#x5356;&#x673A;&#x5236;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x6FC0;&#x52B1;&#x7ADE;&#x4EF7;&#x8005;&#x9690;&#x85CF;&#x81EA;&#x5DF1;&#x7684;&#x771F;&#x5B9E;&#x4F30;&#x4EF7;&#xFF0C;&#x800C;&#x4EE5;&#x4F4E;&#x4E8E;&#x81EA;&#x5DF1;&#x4F30;&#x4EF7;&#x7684;&#x91D1;&#x989D;&#x6765;&#x51FA;&#x4EF7;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x66F4;&#x53EF;&#x80FD;&#x8D5A;&#x5230;&#x8D85;&#x989D;&#x7684;&#x6536;&#x76CA;&#x3002;&#x8FD9;&#x5BF9;&#x62CD;&#x5356;&#x65B9;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x597D;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5B83;&#x65E0;&#x6CD5;&#x8BA9;&#x6240;&#x6709;&#x7ADE;&#x4EF7;&#x8005;&#x62A5;&#x51FA;&#x4ED6;&#x4EEC;&#x7684;&#x771F;&#x5B9E;&#x4EF7;&#x683C;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x6240;&#x6709;&#x7ADE;&#x4EF7;&#x8005;&#x90FD;&#x4E0D;&#x8BF4;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x771F;&#x5B9E;&#x4F30;&#x4EF7;&#xFF0C;&#x90A3;&#x4E48;&#x62CD;&#x5356;&#x54C1;&#x6700;&#x7EC8;&#x6210;&#x4EA4;&#x7684;&#x4EF7;&#x683C;&#x5C31;&#x4F1A;&#x6BD4;&#x8F83;&#x4F4E;&#x3002;</p>
</li>
<li><p>&#x6B21;&#x9AD8;&#x4EF7;&#x62CD;&#x5356;</p>
<p>&#x5728;&#x6B21;&#x9AD8;&#x4EF7;&#x62CD;&#x5356;&#x4E2D;&#xFF0C;&#x62CD;&#x5356;&#x54C1;&#x4E5F;&#x5356;&#x7ED9;&#x51FA;&#x4EF7;&#x6700;&#x9AD8;&#x7684;&#x7ADE;&#x4EF7;&#x8005;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6700;&#x9AD8;&#x51FA;&#x4EF7;&#x8005;&#x652F;&#x4ED8;&#x7684;&#x4EF7;&#x683C;&#x5374;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x51FA;&#x7684;&#x4EF7;&#x683C;&#xFF0C;&#x800C;&#x662F;&#x6240;&#x6709;&#x51FA;&#x4EF7;&#x8005;&#x4E2D;&#x6392;&#x7B2C;&#x4E8C;&#x9AD8;&#x7684;&#x4EF7;&#x683C;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x548C;&#x4F60;&#x90FD;&#x5728;&#x7ADE;&#x62CD;&#x4E00;&#x4EF6;&#x827A;&#x672F;&#x54C1;&#x3002;&#x5982;&#x679C;&#x6211;&#x662F;&#x6700;&#x9AD8;&#x7684;&#x7ADE;&#x4EF7;&#x8005;&#xFF0C;&#x6211;&#x51FA;&#x4EF7;10&#x5143;&#xFF0C;&#x800C;&#x4F60;&#x662F;&#x51FA;&#x4EF7;&#x7B2C;&#x4E8C;&#x9AD8;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x51FA;&#x4EF7;9&#x5143;&#xFF0C;&#x90A3;&#x6700;&#x540E;&#x7684;&#x62CD;&#x5356;&#x7ED3;&#x679C;&#x662F;&#x6211;&#x62CD;&#x5356;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x53EA;&#x9700;&#x652F;&#x4ED8;9&#x5143;&#x3002;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x4E00;&#x4E0B;&#x8FD9;&#x65F6;&#x6211;&#x7684;&#x6536;&#x76CA;&#xFF1A;&#x6211;&#x4F30;&#x4EF7;10&#x5143;&#xFF0C;&#x6211;&#x51FA;&#x4EF7;&#x4E5F;&#x662F;10&#x5143;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x652F;&#x4ED8;9&#x5143;&#xFF0C;&#x6536;&#x76CA;1&#x5143;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x5C31;&#x4E0D;&#x4F1A;&#x6FC0;&#x52B1;&#x51FA;&#x4EF7;&#x8005;&#x9690;&#x85CF;&#x81EA;&#x5DF1;&#x5BF9;&#x62CD;&#x5356;&#x54C1;&#x7684;&#x4F30;&#x4EF7;&#x3002;&#x7CFB;&#x7EDF;&#x53CD;&#x8FC7;&#x6765;&#x4F1A;&#x8BA9;&#x53C2;&#x4E0E;&#x8005;&#x7ED9;&#x51FA;&#x4ED6;&#x4EEC;&#x5BF9;&#x62CD;&#x5356;&#x54C1;&#x7684;&#x771F;&#x5B9E;&#x4F30;&#x4EF7;&#xFF0C;&#x6240;&#x4EE5;&#x6B21;&#x9AD8;&#x4EF7;&#x62CD;&#x5356;&#x7684;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#xFF0C;&#x6BD4;&#x6700;&#x9AD8;&#x4EF7;&#x62CD;&#x5356;&#x5408;&#x7406;&#x3002;</p>
</li>
</ol>
<h3 id="&#x535A;&#x5F08;&#x8BBA;">&#x535A;&#x5F08;&#x8BBA;</h3>
<h4 id="&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x535A;&#x5F08;&#x8BBA;">&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x535A;&#x5F08;&#x8BBA;</h4>
<p>&#x535A;&#x5F08;&#x8BBA;&#xFF0C;&#x82F1;&#x6587;&#x53EB;Game Theory&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x505A;&#x51B3;&#x7B56;&#x7684;&#x5B66;&#x79D1;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x535A;&#x5F08;&#x8BBA;&#x7814;&#x7A76;&#x7684;&#x662F;&#x201C;&#x51B3;&#x7B56;&#x4E3B;&#x4F53;&#x7684;&#x884C;&#x4E3A;&#x5728;&#x76F4;&#x63A5;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x65F6;&#xFF0C;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x51B3;&#x7B56;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x79CD;&#x51B3;&#x7B56;&#x5982;&#x4F55;&#x8FBE;&#x5230;&#x5747;&#x8861;&#x201D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4EBA;&#x5728;&#x91C7;&#x53D6;&#x54EA;&#x79CD;&#x884C;&#x52A8;&#x65F6;&#xFF0C;&#x4E0D;&#x4F46;&#x8981;&#x8003;&#x8651;&#x5230;&#x81EA;&#x8EAB;&#x7684;&#x51B3;&#x7B56;&#x884C;&#x4E3A;&#x5BF9;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x884C;&#x4E3A;&#x5BF9;&#x81EA;&#x8EAB;&#x7684;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#xFF0C;&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x6700;&#x4F73;&#x884C;&#x52A8;&#x8BA1;&#x5212;&#xFF0C;&#x6765;&#x5BFB;&#x6C42;&#x6536;&#x76CA;&#x6216;&#x6548;&#x7528;&#x7684;&#x6700;&#x5927;&#x5316;&#x3002;</p>
<h4 id="&#x4E8C;&#x3001;&#x535A;&#x5F08;&#x8BBA;&#x4E3A;&#x4EC0;&#x4E48;&#x91CD;&#x8981;">&#x4E8C;&#x3001;&#x535A;&#x5F08;&#x8BBA;&#x4E3A;&#x4EC0;&#x4E48;&#x91CD;&#x8981;</h4>
<p>&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x4E00;&#x4E9B;&#x9884;&#x6D4B;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x4E0D;&#x540C;&#x4EBA;&#x7684;&#x81EA;&#x8EAB;&#x5229;&#x76CA;&#x548C;&#x5E02;&#x573A;&#x6FC0;&#x52B1;&#xFF0C;&#x535A;&#x5F08;&#x8BBA;&#x53EF;&#x4EE5;&#x8D77;&#x5230;&#x4E00;&#x4E9B;&#x5E02;&#x573A;&#x9884;&#x6D4B;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#x51FA;&#x8BBE;&#x8BA1;&#x7684;&#x4E0D;&#x597D;&#x7684;&#x5E02;&#x573A;&#x6FC0;&#x52B1;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x9884;&#x6D4B;&#x8868;&#x73B0;&#x4E0D;&#x4F73;&#x7684;&#x5E02;&#x573A;&#x3002;</p>
<h4 id="&#x4E09;&#x3001;&#x51E0;&#x4E2A;&#x535A;&#x5F08;&#x8BBA;&#x4E2D;&#x7684;&#x7ECF;&#x5178;&#x95EE;&#x9898;">&#x4E09;&#x3001;&#x51E0;&#x4E2A;&#x535A;&#x5F08;&#x8BBA;&#x4E2D;&#x7684;&#x7ECF;&#x5178;&#x95EE;&#x9898;</h4>
<p>&#x76EE;&#x524D;&#x5728;&#x751F;&#x7269;&#x5B66;&#x3001;&#x7ECF;&#x6D4E;&#x5B66;&#x3001;&#x56FD;&#x9645;&#x5173;&#x7CFB;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x3001;&#x653F;&#x6CBB;&#x5B66;&#x3001;&#x519B;&#x4E8B;&#x6218;&#x7565;&#x548C;&#x5176;&#x4ED6;&#x5F88;&#x591A;&#x5B66;&#x79D1;&#x90FD;&#x6709;&#x5E7F;&#x6CDB;&#x7684;&#x5E94;&#x7528;&#x3002;&#x535A;&#x5F08;&#x8BBA;&#x4E3B;&#x8981;&#x7814;&#x7A76;&#x516C;&#x5F0F;&#x5316;&#x4E86;&#x7684;&#x6FC0;&#x52B1;&#x7ED3;&#x6784;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x662F;&#x7814;&#x7A76;&#x5177;&#x6709;&#x6597;&#x4E89;&#x6216;&#x7ADE;&#x4E89;&#x6027;&#x8D28;&#x73B0;&#x8C61;&#x7684;&#x6570;&#x5B66;&#x7406;&#x8BBA;&#x548C;&#x65B9;&#x6CD5;&#x3002;&#x4E5F;&#x662F;&#x8FD0;&#x7B79;&#x5B66;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x5B66;&#x79D1;&#x3002;&#x535A;&#x5F08;&#x8BBA;&#x8003;&#x8651;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x4E2A;&#x4F53;&#x7684;&#x9884;&#x6D4B;&#x884C;&#x4E3A;&#x548C;&#x5B9E;&#x9645;&#x884C;&#x4E3A;&#xFF0C;&#x5E76;&#x7814;&#x7A76;&#x5B83;&#x4EEC;&#x7684;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x3002;</p>
<ol>
<li><p>&#x7B56;&#x7565;(strategies)&#xFF1A;&#x4E00;&#x5C40;&#x535A;&#x5F08;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C40;&#x4E2D;&#x4EBA;&#x90FD;&#x6709;&#x9009;&#x62E9;&#x5B9E;&#x9645;&#x53EF;&#x884C;&#x7684;&#x5B8C;&#x6574;&#x7684;&#x884C;&#x52A8;&#x65B9;&#x6848;&#xFF0C;&#x5373;&#x65B9;&#x6848;&#x4E0D;&#x662F;&#x67D0;&#x9636;&#x6BB5;&#x7684;&#x884C;&#x52A8;&#x65B9;&#x6848;&#xFF0C;&#x800C;&#x662F;&#x6307;&#x5BFC;&#x6574;&#x4E2A;&#x884C;&#x52A8;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x6848;&#xFF0C;&#x4E00;&#x4E2A;&#x5C40;&#x4E2D;&#x4EBA;&#x7684;&#x4E00;&#x4E2A;&#x53EF;&#x884C;&#x7684;&#x81EA;&#x59CB;&#x81F3;&#x7EC8;&#x5168;&#x5C40;&#x7B79;&#x5212;&#x7684;&#x4E00;&#x4E2A;&#x884C;&#x52A8;&#x65B9;&#x6848;&#xFF0C;&#x79F0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5C40;&#x4E2D;&#x4EBA;&#x7684;&#x4E00;&#x4E2A;&#x7B56;&#x7565;&#x3002;&#x5982;&#x679C;&#x5728;&#x4E00;&#x4E2A;&#x535A;&#x5F08;&#x4E2D;&#x5C40;&#x4E2D;&#x4EBA;&#x90FD;&#x603B;&#x5171;&#x6709;&#x6709;&#x9650;&#x4E2A;&#x7B56;&#x7565;&#xFF0C;&#x5219;&#x79F0;&#x4E3A;&#x201C;&#x6709;&#x9650;&#x535A;&#x5F08;&#x201D;&#xFF0C;&#x5426;&#x5219;&#x79F0;&#x4E3A;&#x201C;&#x65E0;&#x9650;&#x535A;&#x5F08;&#x201D;&#x3002;</p>
</li>
<li><p>&#x5F97;&#x5931;(payoffs)&#xFF1A;&#x4E00;&#x5C40;&#x535A;&#x5F08;&#x7ED3;&#x5C40;&#x65F6;&#x7684;&#x7ED3;&#x679C;&#x79F0;&#x4E3A;&#x5F97;&#x5931;&#x3002;&#x6BCF;&#x4E2A;&#x5C40;&#x4E2D;&#x4EBA;&#x5728;&#x4E00;&#x5C40;&#x535A;&#x5F08;&#x7ED3;&#x675F;&#x65F6;&#x7684;&#x5F97;&#x5931;&#xFF0C;&#x4E0D;&#x4EC5;&#x4E0E;&#x8BE5;&#x5C40;&#x4E2D;&#x4EBA;&#x81EA;&#x8EAB;&#x6240;&#x9009;&#x62E9;&#x7684;&#x7B56;&#x7565;&#x6709;&#x5173;&#xFF0C;&#x800C;&#x4E14;&#x4E0E;&#x5168;&#x5C40;&#x4E2D;&#x4EBA;&#x6240;&#x53D6;&#x5B9A;&#x7684;&#x4E00;&#x7EC4;&#x7B56;&#x7565;&#x6709;&#x5173;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x5C40;&#x535A;&#x5F08;&#x7ED3;&#x675F;&#x65F6;&#x6BCF;&#x4E2A;&#x5C40;&#x4E2D;&#x4EBA;&#x7684;&#x201C;&#x5F97;&#x5931;&#x201D;&#x662F;&#x5168;&#x4F53;&#x5C40;&#x4E2D;&#x4EBA;&#x6240;&#x53D6;&#x5B9A;&#x7684;&#x4E00;&#x7EC4;&#x7B56;&#x7565;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x652F;&#x4ED8;&#xFF08;payoff&#xFF09;&#x51FD;&#x6570;&#x3002;</p>
</li>
<li><p>&#x6B21;&#x5E8F;&#xFF08;orders&#xFF09;&#xFF1A;&#x5404;&#x535A;&#x5F08;&#x65B9;&#x7684;&#x51B3;&#x7B56;&#x6709;&#x5148;&#x540E;&#x4E4B;&#x5206;&#xFF0C;&#x4E14;&#x4E00;&#x4E2A;&#x535A;&#x5F08;&#x65B9;&#x8981;&#x4F5C;&#x4E0D;&#x6B62;&#x4E00;&#x6B21;&#x7684;&#x51B3;&#x7B56;&#x9009;&#x62E9;&#xFF0C;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x6B21;&#x5E8F;&#x95EE;&#x9898;&#xFF1B;&#x5176;&#x4ED6;&#x8981;&#x7D20;&#x76F8;&#x540C;&#x6B21;&#x5E8F;&#x4E0D;&#x540C;&#xFF0C;&#x535A;&#x5F08;&#x5C31;&#x4E0D;&#x540C;&#x3002;</p>
</li>
<li><p>&#x535A;&#x5F08;&#x6D89;&#x53CA;&#x5230;&#x5747;&#x8861;&#xFF1A;&#x5747;&#x8861;&#x662F;&#x5E73;&#x8861;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x5728;&#x7ECF;&#x6D4E;&#x5B66;&#x4E2D;&#xFF0C;&#x5747;&#x8861;&#x610F;&#x5373;&#x76F8;&#x5173;&#x91CF;&#x5904;&#x4E8E;&#x7A33;&#x5B9A;&#x503C;&#x3002;&#x5728;&#x4F9B;&#x6C42;&#x5173;&#x7CFB;&#x4E2D;&#xFF0C;&#x67D0;&#x4E00;&#x5546;&#x54C1;&#x5E02;&#x573A;&#x5982;&#x679C;&#x5728;&#x67D0;&#x4E00;&#x4EF7;&#x683C;&#x4E0B;&#xFF0C;&#x60F3;&#x4EE5;&#x6B64;&#x4EF7;&#x683C;&#x4E70;&#x6B64;&#x5546;&#x54C1;&#x7684;&#x4EBA;&#x5747;&#x80FD;&#x4E70;&#x5230;&#xFF0C;&#x800C;&#x60F3;&#x5356;&#x7684;&#x4EBA;&#x5747;&#x80FD;&#x5356;&#x51FA;&#xFF0C;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x5C31;&#x8BF4;&#xFF0C;&#x8BE5;&#x5546;&#x54C1;&#x7684;&#x4F9B;&#x6C42;&#x8FBE;&#x5230;&#x4E86;&#x5747;&#x8861;&#x3002;</p>
</li>
<li><p>&#x7EB3;&#x4EC0;&#x5747;&#x8861;(Nash Equilibrium)</p>
<p>&#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x662F;&#x4E00;&#x79CD;&#x7B56;&#x7565;&#x7EC4;&#x5408;&#xFF0C;&#x4F7F;&#x5F97;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x5185;&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x4EBA;&#x7684;&#x7B56;&#x7565;&#x662F;&#x5BF9;&#x5176;&#x4ED6;&#x53C2;&#x4E0E;&#x4EBA;&#x7B56;&#x7565;&#x7684;&#x6700;&#x4F18;&#x53CD;&#x5E94;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x6709;n&#x4E2A;&#x5C40;&#x4E2D;&#x4EBA;&#x53C2;&#x4E0E;&#x535A;&#x5F08;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x60C5;&#x51B5;&#x4E0B;&#x65E0;&#x4E00;&#x53C2;&#x4E0E;&#x8005;&#x53EF;&#x4EE5;&#x72EC;&#x81EA;&#x884C;&#x52A8;&#x800C;&#x589E;&#x52A0;&#x6536;&#x76CA;&#xFF08;&#x5373;&#x4E3A;&#x4E86;&#x81EA;&#x8EAB;&#x5229;&#x76CA;&#x7684;&#x6700;&#x5927;&#x5316;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5355;&#x72EC;&#x7684;&#x4E00;&#x65B9;&#x613F;&#x610F;&#x6539;&#x53D8;&#x5176;&#x7B56;&#x7565;&#x7684;&#xFF09;&#xFF0C;&#x5219;&#x6B64;&#x7B56;&#x7565;&#x7EC4;&#x5408;&#x88AB;&#x79F0;&#x4E3A;&#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x3002;</p>
<p>&#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x7684;&#x6570;&#x5B66;&#x5B9A;&#x4E49;&#xFF1A;&#x5728;&#x535A;&#x5F08; G = {S<sub>1</sub>,&#x2026;,S<sub>n</sub>&#xFF1A;u<sub>1</sub>,&#x2026;,u<sub>n</sub>}&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x7531;&#x5404;&#x4E2A;&#x535A;&#x5F08;&#x65B9;&#x7684;&#x5404;&#x4E00;&#x4E2A;&#x7B56;&#x7565;&#x7EC4;&#x6210;&#x7684;&#x67D0;&#x4E2A;&#x7B56;&#x7565;&#x7EC4;&#x5408;(s<sub>1</sub>*,&#x2026;,s<sub>n</sub>*)&#x4E2D;&#xFF0C;&#x4EFB;&#x4E00;&#x535A;&#x5F08;&#x65B9; i &#x7684;&#x7B56;&#x7565;s<sub>i</sub>*&#xFF0C;&#x90FD;&#x662F;&#x5BF9;&#x5176;&#x4F59;&#x535A;&#x5F08;&#x65B9;&#x7B56;&#x7565;&#x7684;&#x7EC4;&#x5408;(s<sub>1</sub>*,&#x2026;s<em>i-1,s</em>i+1,&#x2026;,sn<em>)&#x7684;&#x6700;&#x4F73;&#x5BF9;&#x7B56;&#xFF0C;&#x4E5F;&#x5373; u<sub>i</sub>&#xFF08;s1</em>,&#x2026;s*<sub>i-1</sub>,s<sub>i</sub>*,s*<sub>i+1</sub>,&#x2026;&#xFF0C;s<sub>n</sub>*&#xFF09; &#x2265; u<sub>i</sub>&#xFF08;s<sub>1</sub>*,&#x2026;s*<sub>i-1</sub>,s<sub>ij</sub>*,s*<sub>i+1</sub>,&#x2026;&#xFF0C;s<sub>n</sub>*&#xFF09;&#x5BF9;&#x4EFB;&#x610F;s<sub>ij</sub> &#x2208; S<sub>i</sub>&#x90FD;&#x6210;&#x7ACB;&#xFF0C;&#x5219;&#x79F0;&#xFF08;s<sub>1</sub>*,&#x2026;&#xFF0C;s<sub>n</sub>*&#xFF09;&#x4E3A;G&#x7684;&#x4E00;&#x4E2A;&#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x3002;</p>
<p>&#x5728;&#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x70B9;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x7406;&#x6027;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x90FD;&#x4E0D;&#x4F1A;&#x6709;&#x5355;&#x72EC;&#x6539;&#x53D8;&#x7B56;&#x7565;&#x7684;&#x51B2;&#x52A8;&#x3002;&#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x70B9;&#x5B58;&#x5728;&#x6027;&#x8BC1;&#x660E;&#x7684;&#x524D;&#x63D0;&#x662F;&#x201C;&#x535A;&#x5F08;&#x5747;&#x8861;&#x5076;&#x201D;&#x6982;&#x5FF5;&#x7684;&#x63D0;&#x51FA;&#x3002;&#x6240;&#x8C13;&#x201C;&#x5747;&#x8861;&#x5076;&#x201D;&#x662F;&#x5728;&#x4E8C;&#x4EBA;&#x96F6;&#x548C;&#x535A;&#x5F08;&#x4E2D;&#xFF0C;&#x5F53;&#x5C40;&#x4E2D;&#x4EBA;A&#x91C7;&#x53D6;&#x5176;&#x6700;&#x4F18;&#x7B56;&#x7565;a<em>,&#x5C40;&#x4E2D;&#x4EBA;B&#x4E5F;&#x91C7;&#x53D6;&#x5176;&#x6700;&#x4F18;&#x7B56;&#x7565;b</em>,&#x5982;&#x679C;&#x5C40;&#x4E2D;&#x4EBA;B&#x4ECD;&#x91C7;&#x53D6;b<em>,&#x800C;&#x5C40;&#x4E2D;&#x4EBA;A&#x5374;&#x91C7;&#x53D6;&#x53E6;&#x4E00;&#x79CD;&#x7B56;&#x7565;a&#xFF0C;&#x90A3;&#x4E48;&#x5C40;&#x4E2D;&#x4EBA;A&#x7684;&#x652F;&#x4ED8;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x4ED6;&#x91C7;&#x53D6;&#x539F;&#x6765;&#x7684;&#x7B56;&#x7565;a</em>&#x7684;&#x652F;&#x4ED8;&#x3002;&#x8FD9;&#x4E00;&#x7ED3;&#x679C;&#x5BF9;&#x5C40;&#x4E2D;&#x4EBA;B&#x4EA6;&#x662F;&#x5982;&#x6B64;&#x3002;</p>
</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="CH01.html" class="navigation navigation-prev " aria-label="Previous page: 加密经济学和Token经济的起源和定义">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="CH03.html" class="navigation navigation-next " aria-label="Next page: 共识机制">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"机制设计和博弈论基础","level":"1.2.2","depth":2,"next":{"title":"共识机制","level":"1.2.3","depth":2,"path":"Incentive_design/CH03.md","ref":"./Incentive_design/CH03.md","articles":[]},"previous":{"title":"加密经济学和Token经济的起源和定义","level":"1.2.1","depth":2,"path":"Incentive_design/CH01.md","ref":"./Incentive_design/CH01.md","articles":[]},"dir":"ltr"},"config":{"plugins":["mathjax","sectionx","back-to-top-button"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sectionx":{},"highlight":{},"back-to-top-button":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Cryptoeconomics","gitbook":"*"},"file":{"path":"Incentive_design/CH02.md","mtime":"2019-04-20T15:59:04.354Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-04-20T18:18:08.586Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

