
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>共识机制 · Cryptoeconomics</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="CH04.html" />
    
    
    <link rel="prev" href="CH02.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Cryptoeconomics
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="../Chapter_7_Economics/CH00_Preface.html">
            
                <a href="../Chapter_7_Economics/CH00_Preface.html">
            
                    
                    Preface
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="../Chapter_7_Economics/CH01_Valuation.html">
            
                <a href="../Chapter_7_Economics/CH01_Valuation.html">
            
                    
                    Valuation
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="../Chapter_7_Economics/CH02_Block_Rewards.html">
            
                <a href="../Chapter_7_Economics/CH02_Block_Rewards.html">
            
                    
                    Block Rewards
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="../Chapter_7_Economics/CH03_Transaction_Fees.html">
            
                <a href="../Chapter_7_Economics/CH03_Transaction_Fees.html">
            
                    
                    Transaction Fees
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.5" data-path="../Chapter_7_Economics/CH04_Acknowledgement.html">
            
                <a href="../Chapter_7_Economics/CH04_Acknowledgement.html">
            
                    
                    Acknowledgement
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Incentive_design.html">
            
                <a href="Incentive_design.html">
            
                    
                    Incentive_design
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="CH01.html">
            
                <a href="CH01.html">
            
                    
                    加密经济学和Token经济的起源和定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="CH02.html">
            
                <a href="CH02.html">
            
                    
                    机制设计和博弈论基础
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.3" data-path="CH03.html">
            
                <a href="CH03.html">
            
                    
                    共识机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="CH04.html">
            
                <a href="CH04.html">
            
                    
                    Token分类和Token经济的设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="CH05.html">
            
                <a href="CH05.html">
            
                    
                    Token的供给和需求
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >共识机制</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x5171;&#x8BC6;&#x673A;&#x5236;">&#x5171;&#x8BC6;&#x673A;&#x5236;</h2>
<p>&#x533A;&#x5757;&#x94FE;&#x80FD;&#x591F;&#x4E0D;&#x4F9D;&#x8D56;&#x4E2D;&#x95F4;&#x53EF;&#x4FE1;&#x65B9;&#x8FBE;&#x6210;&#x53EF;&#x4FE1;&#x5171;&#x8BC6;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x5728;&#x4E0D;&#x53EF;&#x4FE1;&#x4FE1;&#x9053;&#x4E0A;&#x4F20;&#x8F93;&#x53EF;&#x4FE1;&#x4FE1;&#x606F;&#x3001;&#x4EF7;&#x503C;&#x8F6C;&#x79FB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x5219;&#x89E3;&#x51B3;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x5982;&#x4F55;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x573A;&#x666F;&#x4E0B;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4F1F;&#x5927;&#x4E4B;&#x5904;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x5728;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x601D;&#x60F3;&#x4E0A;&#x89E3;&#x51B3;&#x4E86;&#x8282;&#x70B9;&#x95F4;&#x4E92;&#x76F8;&#x4FE1;&#x4EFB;&#x7684;&#x95EE;&#x9898;&#x3002;&#x533A;&#x5757;&#x94FE;&#x80FD;&#x5728;&#x4F17;&#x591A;&#x8282;&#x70B9;&#x8FBE;&#x5230;&#x4E00;&#x79CD;&#x8F83;&#x4E3A;&#x5E73;&#x8861;&#x7684;&#x72B6;&#x6001;&#x4E5F;&#x662F;&#x56E0;&#x4E3A;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x3002;&#x5C3D;&#x7BA1;&#x5BC6;&#x7801;&#x5B66;&#x5360;&#x636E;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x7684;&#x534A;&#x58C1;&#x6C5F;&#x5C71;&#xFF0C;&#x4F46;&#x662F;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x662F;&#x4FDD;&#x969C;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x4E0D;&#x65AD;&#x8FD0;&#x884C;&#x4E0B;&#x53BB;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<p>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x601D;&#x60F3;&#x521A;&#x88AB;&#x63D0;&#x51FA;&#x6765;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x5C31;&#x5F00;&#x59CB;&#x6839;&#x636E;<a href="https://www.jianshu.com/p/6169ba76429e" target="_blank">FLP&#x5B9A;&#x7406;</a>&#x548C;<a href="https://www.jianshu.com/p/6169ba76429e" target="_blank">CAP&#x5B9A;&#x7406;</a>&#x8BBE;&#x8BA1;&#x5171;&#x8BC6;&#x7B97;&#x6CD5;&#x3002;</p>
<ul>
<li><p>&#x89C4;&#x8303;&#x7684;&#x8BF4;&#xFF0C;&#x7406;&#x60F3;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x5E94;&#x8BE5;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x4E09;&#x70B9;&#xFF1A;</p>
</li>
<li><p>&#x53EF;&#x7EC8;&#x6B62;&#x6027;&#xFF08;Termination&#xFF09;&#xFF1A;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x5728;&#x6709;&#x9650;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x3002;</p>
</li>
<li>&#x5171;&#x8BC6;&#x6027;(Consensus)&#xFF1A;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x6700;&#x7EC8;&#x5B8C;&#x6210;&#x51B3;&#x7B56;&#x7684;&#x7ED3;&#x679C;&#x5E94;&#x8BE5;&#x76F8;&#x540C;&#x3002;</li>
<li><p>&#x5408;&#x6CD5;&#x6027;(Validity)&#xFF1A;&#x51B3;&#x7B56;&#x7684;&#x7ED3;&#x679C;&#x5FC5;&#x987B;&#x662F;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x63D0;&#x51FA;&#x7684;&#x63D0;&#x6848;&#x3002;</p>
</li>
<li><p>&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5B58;&#x5728;&#x4EE5;&#x4E0B;&#x95EE;&#x9898;&#xFF1A;</p>
</li>
<li><p>&#x8282;&#x70B9;&#x5904;&#x7406;&#x4E8B;&#x52A1;&#x7684;&#x80FD;&#x529B;&#x4E0D;&#x540C;&#xFF0C;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x6570;&#x636E;&#x7684;&#x541E;&#x5410;&#x91CF;&#x6709;&#x5DEE;&#x5F02;</p>
</li>
<li>&#x8282;&#x70B9;&#x95F4;&#x901A;&#x8BAF;&#x7684;&#x4FE1;&#x9053;&#x53EF;&#x80FD;&#x4E0D;&#x5B89;&#x5168;</li>
<li>&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4F5C;&#x6076;&#x8282;&#x70B9;&#x51FA;&#x73B0;</li>
<li>&#x5F53;&#x5F02;&#x6B65;&#x5904;&#x7406;&#x80FD;&#x529B;&#x8FBE;&#x5230;&#x9AD8;&#x5EA6;&#x4E00;&#x81F4;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x5C31;&#x4F1A;&#x53D8;&#x5DEE;&#xFF08;&#x5BB9;&#x4E0D;&#x4E0B;&#x65B0;&#x8282;&#x70B9;&#x7684;&#x52A0;&#x5165;&#xFF09;&#x3002;</li>
</ul>
<p>&#x79D1;&#x5B66;&#x5BB6;&#x8BA4;&#x4E3A;&#xFF0C;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x573A;&#x666F;&#x4E0B;&#x8FBE;&#x6210;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x6027;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5DE5;&#x7A0B;&#x5B66;&#x5BB6;&#x53EF;&#x4EE5;&#x727A;&#x7272;&#x4E00;&#x90E8;&#x5206;&#x4EE3;&#x4EF7;&#x6765;&#x6362;&#x53D6;&#x5206;&#x5E03;&#x5F0F;&#x573A;&#x666F;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4E0A;&#x8FF0;&#x7684;&#x4E24;&#x5927;&#x5B9A;&#x7406;&#x4E5F;&#x662F;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#xFF0C;&#x6240;&#x4EE5;&#x57FA;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x8BBE;&#x8BA1;&#x7684;&#x5404;&#x79CD;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x727A;&#x7272;&#x90A3;&#x4E00;&#x90E8;&#x5206;&#x4EE3;&#x4EF7;&#x6765;&#x6362;&#x53D6;&#x591A;&#x9002;&#x5408;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x4E0A;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x7075;&#x6D3B;&#x7684;&#x53D8;&#x6362;&#xFF0C;&#x5373;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x95F4;&#x7A7A;&#x95F4;&#x727A;&#x7272;&#x4E00;&#x90E8;&#x5206;&#x4EE3;&#x4EF7;&#x6362;&#x53D6;&#x9002;&#x5E94;&#x4E8E;&#x5F53;&#x65F6;&#x573A;&#x666F;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7075;&#x6D3B;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#xFF0C;&#x5373;&#x53EF;&#x63D2;&#x62D4;&#x5F0F;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x3002;</p>
<p><strong>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x65E0;&#x4F5C;&#x6076;&#x8282;&#x70B9;&#x5206;&#x4E3A;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x548C;&#x975E;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x673A;&#x5236;</strong>&#x3002;</p>
<h4 id="&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x7684;&#x5171;&#x8BC6;&#x7B97;&#x6CD5;">&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x7684;&#x5171;&#x8BC6;&#x7B97;&#x6CD5;</h4>
<ul>
<li><p><strong>PoW&#xFF1A;proof of work&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x83B1;&#x7279;&#x5E01;&#x7B49;&#x8D27;&#x5E01;&#x578B;&#x533A;&#x5757;&#x94FE;&#xFF08;&#x516C;&#x6709;&#x94FE;&#xFF09;</strong></p>
<p>&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x662F;&#x77FF;&#x5DE5;&#x5728;&#x5904;&#x7406;&#x4EA4;&#x6613;&#x6570;&#x636E;&#xFF08;&#x5BF9;&#x6570;&#x636E;&#x4E5F;&#x662F;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#xFF09;&#x7684;&#x540C;&#x65F6;&#x4E0D;&#x65AD;&#x7684;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#xFF0C;&#x6C42;&#x5F97;&#x4E00;&#x4F4D;&#x524D;23&#x4F4D;&#x4E3A;0&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x6210;&#x4E3A;nonce&#x9EC4;&#x91D1;&#x6570;&#x3002;&#x5F53;&#x5168;&#x7F51;&#x6709;&#x4E00;&#x4F4D;&#x77FF;&#x5DE5;&#x54C8;&#x5E0C;&#x51FA;nonce&#x65F6;&#xFF0C;&#x4ED6;&#x5C31;&#x4F1A;&#x628A;&#x81EA;&#x5DF1;&#x6253;&#x5305;&#x7684;&#x533A;&#x5757;&#x516C;&#x5E03;&#x51FA;&#x53BB;&#xFF0C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x6536;&#x5230;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x533A;&#x5757;&#x540E;&#x5C31;&#x4F1A;&#x4E00;&#x81F4;&#x6027;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x63A5;&#x5230;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#xFF0C;&#x5C31;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x6253;&#x5305;&#x548C;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E2D;&#x672C;&#x806A;&#x5927;&#x795E;&#x662F;&#x901A;&#x8FC7;&#x7B97;&#x529B;&#x7684;&#x6BD4;&#x62FC;&#x727A;&#x7272;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#xFF08;&#x56E0;&#x4E3A;&#x4F1A;&#x6709;&#x5206;&#x53C9;&#x7684;&#x4EA7;&#x751F;&#xFF09;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x591A;&#x4E2A;&#x786E;&#x8BA4;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x7B80;&#x5355;&#x66B4;&#x529B;&#x7684;&#x65B9;&#x6CD5;&#x5374;&#x4FDD;&#x8BC1;&#x4E86;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x7684;&#x5408;&#x6CD5;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#x628A;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x7684;&#x5065;&#x58EE;&#x6027;&#x63D0;&#x5347;&#x5230;&#x6781;&#x81F4;&#xFF0C;&#x5C31;&#x7B97;&#x5168;&#x7F51;&#x53EA;&#x5269;&#x4E0B;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x8FD8;&#x662F;&#x4F1A;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x4E0B;&#x53BB;&#x3002;&#x540C;&#x65F6; PoW &#x4E5F;&#x5145;&#x5206;&#x63D0;&#x9AD8;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4F9D;&#x9760; 51% &#x653B;&#x51FB;&#x7406;&#x8BBA;&#x53BB;&#x7834;&#x574F;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x662F;&#x53EA;&#x6709;&#x75AF;&#x5B50;&#x624D;&#x4F1A;&#x91C7;&#x53D6;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684; PoW &#x673A;&#x5236;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x5E94;&#x7528;&#x3002;&#x5B83;&#x5F88;&#x597D;&#x7684;&#x7ED3;&#x5408;&#x4E86;&#x52A0;&#x5BC6;&#x5B66;&#x548C;&#x535A;&#x5F08;&#x8BBA;&#xFF0C;&#x505A;&#x5230;&#x4E86;&#x7ECF;&#x6D4E;&#x5B66;&#x4E2D;&#x7684;&#x201C;&#x6FC0;&#x52B1;&#x76F8;&#x5BB9;&#x7684;&#x7EB3;&#x4EC0;&#x5747;&#x8861;&#xFF08;Incentive compatible Nash equilibtium&#xFF09;&#x201D;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x77FF;&#x5DE5;&#x7684;&#x6700;&#x4F18;&#x9009;&#x62E9;&#x662F;&#x786E;&#x8BA4;&#x771F;&#x5B9E;&#x4EA4;&#x6613;&#x3002;PoW &#x8FD0;&#x7528;&#x4E86;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3001;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7B49;&#x52A0;&#x5BC6;&#x5B66;&#x624B;&#x6BB5;&#x6765;&#x9A8C;&#x8BC1;&#x6570;&#x636E;&#xFF0C;&#x4F7F;&#x5F97;&#x8FC7;&#x53BB;&#x7684;&#x6570;&#x636E;&#x80FD;&#x88AB;&#x51C6;&#x786E;&#x5730;&#x8BB0;&#x5F55;&#x3002;&#x540C;&#x65F6;&#x5B83;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x4F5C;&#x4E3A;&#x6316;&#x77FF;&#x4EBA;&#x7684;&#x5956;&#x52B1;&#xFF0C;&#x7528;&#x7B97;&#x529B;&#x6D88;&#x8017;&#x53CA;&#x7535;&#x8D39;&#x4F5C;&#x4E3A;&#x60E9;&#x7F5A;&#x3002;</p>
<p>PoW &#x673A;&#x5236;&#x4F5C;&#x4E3A;&#x5F00;&#x521B;&#x6027;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x6781;&#x5177;&#x610F;&#x4E49;&#xFF0C;&#x4F46;&#x5B83;&#x5E76;&#x4E0D;&#x5B8C;&#x7F8E;&#x3002;</p>
<p><strong>PoW &#x7684;&#x4F18;&#x70B9;</strong>&#xFF1A;</p>
<ul>
<li>&#x5B8C;&#x5168;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x3002;</li>
<li>&#x8282;&#x70B9;&#x81EA;&#x7531;&#x8FDB;&#x51FA;&#xFF0C;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x3002;</li>
<li>&#x7834;&#x574F;&#x7CFB;&#x7EDF;&#x82B1;&#x8D39;&#x7684;&#x6210;&#x672C;&#x5DE8;&#x5927;&#x3002;</li>
</ul>
<p><strong>PoW &#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;</strong>&#xFF1A;</p>
<ul>
<li>&#x6D6A;&#x8D39;&#x7B97;&#x529B;&#x548C;&#x7535;&#x529B;&#x6765;&#x6316;&#x77FF;&#x3002;</li>
<li>&#x65E9;&#x671F;&#x7684; PoW &#x673A;&#x5236;&#x4E0B;&#x4EA4;&#x6613;&#x6700;&#x7EC8;&#x786E;&#x8BA4;&#x6BD4;&#x8F83;&#x6162;&#x3002;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x516D;&#x4E2A;&#x786E;&#x8BA4;&#xFF0C;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x8981;&#x7B49;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x3002;</li>
<li>PoW &#x53EF;&#x80FD;&#x9762;&#x4E34;&#x81EA;&#x79C1;&#x6316;&#x77FF;&#xFF08;selfish-mining&#xFF09;&#x7684;&#x98CE;&#x9669;&#x3002;&#x81EA;&#x79C1;&#x6316;&#x77FF;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x53EF;&#x80FD;&#x4F1A;&#x4E0D;&#x8BA9;&#x522B;&#x4EBA;&#x77E5;&#x9053;&#x4ED6;&#x53D1;&#x73B0;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x4EE5;&#x4FBF;&#x7ED9;&#x81EA;&#x5DF1;&#x5BFB;&#x627E;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x589E;&#x52A0;&#x4F18;&#x52BF;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x201C;&#x5728;&#x9519;&#x8BEF;&#x7684;&#x94FE;&#x4E0A;&#x7684;&#x6316;&#x77FF;&#x201D;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;PoW &#x673A;&#x5236;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x53BB;&#x60E9;&#x7F5A;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x5B64;&#x5757;&#x4E0A;&#x6316;&#x77FF;&#x7684;&#x6536;&#x76CA;&#x4E3A;&#x8D1F;&#xFF0C;&#x4F1A;&#x6D6A;&#x8D39;&#x7535;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x95F4;&#x63A5;&#x7684;&#x60E9;&#x7F5A;&#x3002;</li>
</ul>
<p>&#x540E;&#x6765;&#xFF0C;&#x7531;&#x4E8E;ASIC&#x6316;&#x77FF;&#x8BBE;&#x5907;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x5176;&#x66F4;&#x5F3A;&#x52B2;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#xFF0C;&#x4F7F;&#x5F97;&#x62E5;&#x6709;ASIC&#x8BBE;&#x5907;&#x7684;&#x4EBA;&#x4EEC;&#x548C;&#x673A;&#x6784;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x6BD4;&#x5176;&#x4ED6;&#x4EBA;&#x62E5;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x6982;&#x7387;&#x6316;&#x5230;&#x533A;&#x5757;&#xFF0C;&#x56E0;&#x6B64;&#x4EA7;&#x751F;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x62C5;&#x5FE7;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x770B;&#x4E00;&#x5F20;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#x5206;&#x5E03;&#x8868;&#xFF1A;</p>
<p><img src="image/Hash_Power.png" alt="Hash_Power"></p>
<p><em>&#x56FE;&#x7247;&#x6765;&#x6E90;&#xFF1A;Blockchain.info</em></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x7EA6;&#x6709;65%&#x7684;&#x7B97;&#x529B;&#x662F;&#x88AB;5&#x5BB6;&#x77FF;&#x6C60;&#x74DC;&#x5206;&#x7684;&#xFF01;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;5&#x4E2A;&#x5927;&#x77FF;&#x6C60;&#x53EF;&#x4EE5;&#x8054;&#x5408;&#x8D77;&#x6765;&#x5E76;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E0A;&#x53D1;&#x52A8;51%&#x653B;&#x51FB;&#x3002;</p>
<p>&#x800C;&#x5728;&#x4E4B;&#x540E;&#x51FA;&#x73B0;&#x7684;&#x4E00;&#x4E9B;&#x5171;&#x8BC6;&#x673A;&#x5236;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x8BD5;&#x56FE;&#x89E3;&#x51B3; PoW &#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4ECE;&#x6FC0;&#x52B1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5728;PoW&#x673A;&#x5236;&#x91CC;&#xFF0C;&#x77FF;&#x5DE5;&#x4F1A;&#x9762;&#x4E34;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#xFF1A;&#x73B0;&#x5728;&#x6211;&#x9762;&#x524D;&#x6709;A&#x548C;B&#x4E24;&#x6761;&#x94FE;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x5728;&#x54EA;&#x6761;&#x94FE;&#x4E0A;&#x6316;&#x77FF;&#x7684;&#x6536;&#x76CA;&#x6700;&#x5927;&#x5462;&#xFF1F;</p>
<p>&#x5728;POW&#x673A;&#x5236;&#x91CC;&#xFF0C;&#x6709;&#x56DB;&#x79CD;&#x9009;&#x62E9;&#xFF1A;</p>
<ul>
<li><p>&#x9009;&#x62E9;&#x4E00;&#x3001;&#x662F;&#x6211;&#x4E0D;&#x6316;&#x77FF;&#x3002;&#x8FD9;&#x65F6;&#x9884;&#x8BA1;&#x6536;&#x5165;&#x662F;&#x96F6;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x6295;&#x5165;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x65E0;&#x4EA7;&#x51FA;&#x3002;</p>
</li>
<li><p>&#x9009;&#x62E9;&#x4E8C;&#xFF0C;A&#x94FE;&#x6316;&#x77FF;&#x6210;&#x529F;&#x7387;&#x662F;90%&#xFF0C;&#x6211;&#x5728;A&#x94FE;&#x6316;&#x77FF;&#xFF0C;&#x9884;&#x8BA1;&#x6536;&#x5165;&#x662F;0.9&#x3002;</p>
</li>
<li><p>&#x9009;&#x62E9;&#x4E09;&#xFF0C;B&#x94FE;&#x6316;&#x77FF;&#x6210;&#x529F;&#x7387;&#x662F;10%&#xFF0C;&#x6211;&#x5728;B&#x94FE;&#x6316;&#x77FF;&#xFF0C;&#x9884;&#x8BA1;&#x6536;&#x5165;0.1&#x3002;</p>
</li>
<li><p>&#x9009;&#x62E9;&#x56DB;&#xFF0C;&#x662F;&#x6211;&#x5728;A&#x548C;B&#x94FE;&#x4E0A;&#x540C;&#x65F6;&#x6316;&#x77FF;&#x3002;&#x56E0;&#x4E3A;&#x7B97;&#x529B;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5728;A&#x94FE;&#x5206;&#x914D;50%&#x7684;&#x7B97;&#x529B;&#xFF0C;B&#x94FE;&#x4E0A;&#x5206;&#x914D;50%&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x7684;&#x9884;&#x8BA1;&#x6536;&#x5165;&#x662F; 0.9*50% + 0.1*50% =0.50&#x3002;</p>
</li>
</ul>
<p>&#x90A3;&#x4E48;&#x5982;&#x679C;&#x4F60;&#x662F;&#x77FF;&#x5DE5;&#xFF0C;&#x4F60;&#x4F1A;&#x600E;&#x4E48;&#x9009;&#x62E9;&#x5462;&#xFF1F;&#x5BF9;&#x6BD4;&#x4E00;&#x4E0B;&#x6536;&#x5165;&#xFF0C;&#x5C31;&#x80FD;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x7406;&#x6027;&#x7684;&#x4EBA;&#x4E00;&#x5B9A;&#x4F1A;&#x9009;&#x62E9;&#x4E8C;&#xFF0C;&#x53EA;&#x5728;A&#x94FE;&#x4E0A;&#x6316;&#x77FF;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x9884;&#x8BA1;&#x6536;&#x5165;&#x6700;&#x9AD8;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x770B;&#x6765;&#xFF0C;PoW&#x673A;&#x5236;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6FC0;&#x52B1;&#x8BBE;&#x8BA1;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x901A;&#x8FC7;&#x6FC0;&#x52B1;&#x5B9E;&#x73B0;&#x4E86;&#x8BA9;&#x77FF;&#x5DE5;&#x5728;&#x6B63;&#x786E;&#x7684;&#x94FE;&#x4E0A;&#x6316;&#x77FF;&#x3002;</p>
<p>&#x4F46;&#x662F;PoW&#x7684;&#x8017;&#x7535;&#x3001;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x6162;&#x7B49;&#x95EE;&#x9898;&#x5E76;&#x6CA1;&#x6709;&#x89E3;&#x51B3;&#xFF0C;&#x6240;&#x4EE5;&#x51FA;&#x73B0;&#x4E86;&#x540E;&#x9762;&#x7684;&#x6743;&#x76CA;&#x8BC1;&#x660E;&#x673A;&#x5236;&#xFF0C;&#x7B80;&#x79F0; PoS&#x3002;</p>
</li>
</ul>
<ul>
<li><p><strong>PoS&#xFF1A;proof of stake&#xFF0C;&#x70B9;&#x70B9;&#x5E01;&#x3001;&#x91CF;&#x5B50;&#x94FE;&#x3001;&#x5347;&#x7EA7;&#x540E;&#x7684;ETH&#x7B49;</strong></p>
<p>&#x4ECE;&#x6BD4;&#x7279;&#x5E01;&#x8BDE;&#x751F;&#x4EE5;&#x6765;&#xFF0C;PoW &#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x6210;&#x4E3A;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x548C;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4E3B;&#x6D41;&#x5171;&#x8BC6;&#x673A;&#x5236;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5176;&#x5BF9;&#x80FD;&#x6E90;&#x7684;&#x6D88;&#x8017;&#x5DE8;&#x5927;&#xFF0C;2013&#x5E74;&#x70B9;&#x70B9;&#x5E01;&#xFF08;Peercoin&#xFF09;&#x7CFB;&#x7EDF;&#x4E2D;&#x63D0;&#x51FA;&#x5E76;&#x5B9E;&#x73B0;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x2014;&#x2014;&#x6743;&#x76CA;&#x8BC1;&#x660E;&#x3002;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;PoS &#x5C31;&#x662F;&#x5F53;&#x77FF;&#x5DE5;&#x9700;&#x8981;&#x786E;&#x8BA4;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x548C;&#x51C6;&#x786E;&#x6027;&#x65F6;&#xFF0C;&#x4E0D;&#x662F;&#x53D1;&#x9001;&#x4EA4;&#x6613;&#x54C8;&#x5E0C;&#x503C;&#x6765;&#x8BC1;&#x660E;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x6295;&#x7968;&#x6765;&#x786E;&#x8BA4;&#x3002;</p>
<ul>
<li><p>PoS&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x53CA;&#x516C;&#x5F0F; </p>
<p>&#x6CA1;&#x6709;&#x6316;&#x77FF;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x521B;&#x4E16;&#x533A;&#x5757;&#x5185;&#x5199;&#x660E;&#x4E86;&#x6743;&#x76CA;&#x5206;&#x914D;&#x6BD4;&#x4F8B;&#xFF0C;&#x4E4B;&#x540E;&#x901A;&#x8FC7;&#x8F6C;&#x8BA9;&#x3001;&#x4EA4;&#x6613;&#x7684;&#x65B9;&#x5F0F;&#xFF08;&#x901A;&#x5E38;&#x5C31;&#x662F;ICO&#xFF09;&#xFF0C;&#x9010;&#x6E10;&#x5206;&#x6563;&#x5230;&#x7528;&#x6237;&#x624B;&#x91CC;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x201C;&#x5229;&#x606F;&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x65B0;&#x589E;&#x8D27;&#x5E01;&#xFF0C;&#x5B9E;&#x73B0;&#x5BF9;&#x8282;&#x70B9;&#x7684;&#x5956;&#x52B1;&#x3002;</p>
<p> <strong>PoS&#x7684;&#x516C;&#x5F0F;&#x4E3A;&#xFF1A;</strong></p>
<p>  <strong>hash(block_header) =&lt; target * coinage</strong></p>
<p>  <strong>&#x5E01;&#x9F84;&#x7684;&#x8BA1;&#x7B97;&#xFF1A;coinage = &#x5E01;&#x7684;&#x4E2A;&#x6570;*&#x5E01;&#x7684;&#x5269;&#x4F59;&#x4F7F;&#x7528;&#x65F6;&#x95F4;</strong></p>
<p>&#x5176;&#x4E2D;&#xFF0C;coinage&#x8868;&#x793A;&#x5E01;&#x9F84;&#xFF0C;&#x8FD9;&#x5C06;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5E01;&#x9F84;&#x8D8A;&#x5927;&#xFF0C;&#x8D8A;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x7B54;&#x6848;&#x3002;&#x800C;&#x5176;&#x4E2D;&#x5E01;&#x9F84;&#x7684;&#x8BA1;&#x7B97;&#x662F;&#x901A;&#x8FC7;&#x6316;&#x77FF;&#x8005;&#x62E5;&#x6709;&#x7684;&#x5E01;&#x4E58;&#x4EE5;&#x6BCF;&#x4E2A;&#x5E01;&#x7684;&#x5269;&#x4E0B;&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x5F97;&#x5230;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C06;&#x610F;&#x5473;&#x7740;&#x62E5;&#x6709;&#x7684;&#x5E01;&#x8D8A;&#x591A;&#xFF0C;&#x4E5F;&#x8D8A;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x7B54;&#x6848;&#x3002;&#x8FD9;&#x6837;&#xFF0C;PoS &#x89E3;&#x51B3;&#x4E86; PoW &#x4E2D;&#x6D6A;&#x8D39;&#x8D44;&#x6E90;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x540C;&#x65F6;&#x786E;&#x8BA4;&#x901F;&#x5EA6;&#x4E5F;&#x5F97;&#x5230;&#x4E86;&#x5F88;&#x5927;&#x63D0;&#x5347;&#x3002;&#x53E6;&#x6709;&#x89C2;&#x70B9;&#x8BA4;&#x4E3A;&#x5728; PoS &#x4E2D;&#x6316;&#x77FF;&#x8005;&#x4E0D;&#x53EF;&#x80FD;&#x62E5;&#x6709;&#x5168;&#x7F51;51%&#x7684;&#x5E01;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x89E3;&#x51B3;&#x4E86;51%&#x653B;&#x51FB;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4F46;&#x662F;PoS&#x5171;&#x8BC6;&#x673A;&#x5236;&#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x4E0B;&#xFF0C;&#x51FA;&#x73B0;&#x4E86; &#x201C;<strong>&#x65E0;&#x5389;&#x5BB3;&#x5173;&#x7CFB;</strong>&#x201D;&#xFF08;Nothing at Stake&#xFF09;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x56DE;&#x5230;&#x4E4B;&#x524D; PoW &#x7684;&#x56DB;&#x79CD;&#x6295;&#x7968;&#x9009;&#x62E9;&#x3002;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;POS&#x7684;&#x533A;&#x5757;&#x94FE;&#x6765;&#x8BF4;&#xFF0C;&#x56DB;&#x79CD;&#x9009;&#x62E9;&#x7684;&#x524D;&#x4E09;&#x79CD;&#x548C; PoW &#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A; PoS &#x673A;&#x5236;&#x4E0B;&#xFF0C;&#x6316;&#x77FF;&#x4E0D;&#x9700;&#x8981;&#x7B97;&#x529B;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x6295;&#x7968;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x7B2C;&#x56DB;&#x4E2A;&#x9009;&#x62E9;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x540C;&#x65F6;&#x5728;A&#x94FE;&#xFF08;&#x6B63;&#x786E;&#x7684;&#x94FE;&#xFF09;&#x548C;B&#x94FE;&#x8FDB;&#x884C;&#x6295;&#x7968;&#xFF0C;&#x9884;&#x8BA1;&#x6536;&#x5165;&#x5C31;&#x662F; (0.1 + 0.9) &#x7B49;&#x4E8E;1&#xFF0C;&#x6BD4;&#x9009;&#x62E9;&#x4E8C;&#x7684;0.9&#x66F4;&#x9AD8;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;<strong>&#x5728;PoS&#x673A;&#x5236;&#x4E0B;&#xFF0C;&#x540C;&#x65F6;&#x5728;A&#x3001;B&#x4E24;&#x6761;&#x94FE;&#x6316;&#x77FF;&#x662F;&#x6BD4;&#x53EA;&#x5728;A&#x94FE;&#x6B63;&#x786E;&#x7684;&#x94FE;&#x4E0A;&#x6316;&#x77FF;&#x66F4;&#x4F18;&#x7684;&#x9009;&#x62E9;</strong>&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x8005;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x628A;&#x94B1;&#x6295;&#x5230;A&#x3001;B&#x4E24;&#x6761;&#x94FE;&#x4E0A;&#xFF0C;&#x5B8C;&#x5168;&#x65E0;&#x9700;&#x62C5;&#x5FC3;&#x95F4;&#x63A5;&#x7684;&#x4E0D;&#x826F;&#x540E;&#x679C;&#x3002;&#x4E0D;&#x7BA1;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x4E8B;&#xFF0C;&#x4F60;&#x90FD;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x8D62;&#xFF0C;&#x4E0D;&#x4F1A;&#x5931;&#x53BB;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x7684;&#x884C;&#x4E3A;&#x6709;&#x591A;&#x6076;&#x610F;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;PoS&#x4E2D;&#x7684;&#x201C;<strong>&#x65E0;&#x5389;&#x5BB3;&#x5173;&#x7CFB;</strong>&#x201D;&#x95EE;&#x9898;&#xFF0C;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x76EE;&#x524D;&#x5728;&#x5F00;&#x53D1;&#x53E6;&#x4E00;&#x79CD;&#x5171;&#x8BC6;&#x673A;&#x5236;Casper PoS&#xFF0C;&#x5B83;&#x662F;&#x4F20;&#x7EDF; PoS &#x7684;&#x6539;&#x8FDB;&#x7248;&#x3002;Casper POS&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7B80;&#x5355;&#x8BF4;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;<strong>&#x7CFB;&#x7EDF;&#x4F1A;&#x660E;&#x786E;&#x60E9;&#x7F5A;&#x77FF;&#x5DE5;&#x5728;&#x9519;&#x8BEF;&#x7684;&#x533A;&#x5757;&#x4E0A;&#x5F00;&#x91C7;</strong>&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x8981;&#x53C2;&#x4E0E;&#x6316;&#x77FF;&#xFF0C;&#x5FC5;&#x987B;&#x5148;&#x62B5;&#x62BC;&#x4E00;&#x4E9B; ETH &#x5728;&#x4E00;&#x4E2A;&#x8D44;&#x91D1;&#x6C60;&#x91CC;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x91C7;&#x7528;&#x4E00;&#x79CD;&#x6076;&#x610F;&#x7684;&#x65B9;&#x5F0F;&#x884C;&#x52A8;&#x3001;&#x8BD5;&#x56FE;&#x505A;&#x201C;&#x65E0;&#x5229;&#x5BB3;&#x5173;&#x7CFB;&#x201D;&#x7684;&#x4E8B;&#xFF0C;&#x6BD4;&#x5982;&#x4E0D;&#x5728;&#x8BE5;&#x533A;&#x5757;&#x4E0A;&#x9762;&#x53BB;&#x6316;&#x77FF;&#xFF0C;&#x6216;&#x8005;&#x81EA;&#x79C1;&#x6316;&#x77FF;&#x65F6;&#xFF0C;&#x6211;&#x5C06;&#x7ACB;&#x5373;&#x906D;&#x5230;&#x60E9;&#x7F5A;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x6263;&#x6389;&#xFF08;deposit slashing&#xFF09;&#x4E00;&#x4E9B;&#x6211;&#x62B5;&#x62BC;&#x7684;ETH&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x5728;2014&#x5E74;&#x7684;Tendermint BFT&#x5171;&#x8BC6;&#x673A;&#x5236;&#x7684;&#x767D;&#x76AE;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x4E86;&#x4F7F;&#x7528;&#x201C;&#x6D88;&#x51CF;&#x5B58;&#x6B3E;&#x201D;&#x6765;&#x89E3;&#x51B3;&#x201C;&#x65E0;&#x5229;&#x5BB3;&#x5173;&#x7CFB;&#x201D;&#x95EE;&#x9898;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x662F;Tendermint&#x7684;&#x5173;&#x952E;&#x521B;&#x65B0;&#x4E4B;&#x4E00;&#x3002;Tendermint &#x4E5F;&#x662F; Cosmos &#x4F7F;&#x7528;&#x7684; BFT &#x5171;&#x8BC6;&#x534F;&#x8BAE;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5728; Casper PoS &#x673A;&#x5236;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x9009;&#x62E9;&#x540C;&#x65F6;&#x5728;A&#x94FE;&#xFF08;&#x6B63;&#x786E;&#x7684;&#x94FE;&#xFF09;&#x548C;B&#x94FE;&#x4E0A;&#x6316;&#x77FF;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4F1A;&#x88AB;&#x6263;&#x94B1;&#xFF0C;&#x5BFC;&#x81F4;&#x6536;&#x76CA;&#x51CF;&#x5C11;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x9075;&#x5B88;&#x89C4;&#x5219;&#x5728;A&#x94FE;&#x4E0A;&#x6316;&#x77FF;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x54C8;&#x5E0C;&#x6765;&#x9A8C;&#x8BC1;&#x7B97;&#x529B;&#x7684; PoW&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E3A;&#x52A0;&#x5BC6;&#x5B66;&#x9A8C;&#x8BC1;&#xFF08;Cryptographic Proof&#xFF09;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48; Casper PoS &#x5C31;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E3A;&#x52A0;&#x5BC6;&#x7ECF;&#x6D4E;&#x5B66;&#x9A8C;&#x8BC1;&#xFF08;Cryptoeconomic Proof&#xFF09;&#xFF0C; Casper PoS &#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x521B;&#x65B0;&#x3002;</p>
<p><strong>PoS&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x53D8;&#x4F53;&#xFF0C;&#x5C31;&#x662F;&#x59D4;&#x6258;&#x6743;&#x76CA;&#x8BC1;&#x660E;&#x673A;&#x5236;&#xFF08;Delegated Proof of Stake&#xFF09;&#xFF0C;&#x7B80;&#x79F0; DPoS&#x3002;</strong>&#x3002;</p>
</li>
<li><p><strong>DPoS&#xFF1A;Delegated Proof of Stake&#xFF0C;&#x59D4;&#x6258;&#x6743;&#x76CA;&#x8BC1;&#x660E;</strong></p>
<p>DPoS&#x662F;&#x6307;&#xFF0C;&#x6240;&#x6709;&#x6301;&#x6709;token&#x7684;&#x4EBA;&#x901A;&#x8FC7;token&#x6295;&#x7968;&#x9009;&#x51FA;&#x90E8;&#x5206;&#x8282;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x59D4;&#x6258;&#x8FD9;&#x4E9B;&#x9009;&#x51FA;&#x6765;&#x7684;&#x8282;&#x70B9;&#x6765;&#x9A8C;&#x8BC1;&#x533A;&#x5757;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x8463;&#x4E8B;&#x4F1A;&#x6295;&#x7968;&#x673A;&#x5236;&#x3002;DPoS &#x673A;&#x5236;&#x4E5F;&#x662F;&#x4E3A;&#x4E86; PoS &#x89E3;&#x51B3;&#x201C;&#x65E0;&#x5229;&#x5BB3;&#x5173;&#x7CFB;&#x201D;&#x95EE;&#x9898;&#x3002;EOS &#x548C; Cosmos &#x91C7;&#x7528;&#x7684;&#x5C31;&#x662F; DPoS &#x673A;&#x5236;&#x3002;</p>
<p>&#x5728; EOS &#x91CC;&#xFF0C;&#x6240;&#x6709;&#x6301;&#x6709; token &#x7684;&#x4EBA;&#x6295;&#x7968;&#x9009;&#x4E3E;&#x8D85;&#x7EA7;&#x8282;&#x70B9;&#xFF0C;&#x6301;&#x6709; EOS &#x76F8;&#x5BF9;&#x4E8E;&#x62E5;&#x6709;&#x6295;&#x7968;&#x6743;&#xFF0C;&#x7136;&#x540E;&#x7531;&#x8D85;&#x7EA7;&#x8282;&#x70B9;&#x6765;&#x9A8C;&#x8BC1;&#x533A;&#x5757;&#x3002;</p>
<p>Cosmos &#x7684;&#x673A;&#x5236;&#x4E5F;&#x548C;EOS&#x7C7B;&#x4F3C;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x6295;&#x7968;&#x9009;&#x51FA;&#x7684;&#x8282;&#x70B9;&#x5982;&#x679C;&#x6316;&#x5230;&#x77FF;&#xFF0C;&#x4F1A;&#x5C06;&#x533A;&#x5757;&#x5956;&#x52B1;&#x6309;&#x6BD4;&#x4F8B;&#x5206;&#x4EAB;&#x5165;&#x80A1;&#x8BE5;&#x8282;&#x70B9;&#x7684;&#x7528;&#x6237;&#x3002;</p>
<ul>
<li><p><strong>&#x90A3; DPoS &#x673A;&#x5236;&#x4E3A;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x89E3;&#x51B3; Nothing at stake &#x7684;&#x95EE;&#x9898;&#x5462;</strong>&#xFF1F;</p>
<p>DPoS &#x548C; Casper PoS &#x4E3A;&#x89E3;&#x51B3; <strong>Nothing at stake &#x7684;&#x95EE;&#x9898;</strong>&#x63D0;&#x4F9B;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002; EOS &#x4E2D;&#x7684; DPoS &#xFF0C;&#x56E0;&#x4E3A;&#x8D85;&#x7EA7;&#x8282;&#x70B9;&#x4E00;&#x76F4;&#x5728;&#x88AB;&#x6295;&#x7968;&#xFF0C;&#x6240;&#x6709;&#x5982;&#x679C;&#x8D85;&#x7EA7;&#x8282;&#x70B9;&#x786E;&#x5B9E;&#x505A;&#x4E86;&#x6076;&#x610F;&#x884C;&#x4E3A;&#xFF0C;&#x5BF9;&#x591A;&#x4E2A;&#x94FE;&#x6295;&#x7968;&#xFF0C;&#x90A3;&#x4E48;&#x793E;&#x533A;&#x53EF;&#x4EE5;&#x6295;&#x7968;&#x7ED9;&#x5176;&#x4ED6;&#x7684;&#x8D85;&#x7EA7;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4ECE;&#x8D85;&#x7EA7;&#x8282;&#x70B9;&#x7684;&#x5019;&#x9009;&#x6C60;&#x4E2D;&#x5220;&#x9664;&#x3002;&#x90A3;&#x4E48; Cosmos &#x4E2D;&#x7684; DPoS&#xFF0C;&#x5982;&#x679C;&#x9A8C;&#x8BC1;&#x8282;&#x70B9;&#x8FDD;&#x6CD5;&#x534F;&#x8BAE;&#xFF0C;&#x4F1A;&#x88AB;&#x6263;&#x6389;&#x62BC;&#x91D1;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5F3A;&#x5927;&#x7684;&#x6FC0;&#x52B1;&#x548C;&#x60E9;&#x7F5A;&#x63AA;&#x65BD;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x201C;&#x65E0;&#x5229;&#x5BB3;&#x5173;&#x7CFB;&#x201D;&#x95EE;&#x9898;&#x3002;</p>
</li>
</ul>
<p>EOS&#x7684;&#x8D85;&#x7EA7;&#x8282;&#x70B9;&#x6295;&#x7968;&#x673A;&#x5236;&#x4E5F;&#x6709;&#x7F3A;&#x70B9;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF1A;<strong>&#x5728;EOS&#x91CC;&#x8282;&#x70B9;&#x6709;&#x66F4;&#x5F3A;&#x70C8;&#x3001;&#x8D3F;&#x8D42;&#x9009;&#x6C11;&#x7684;&#x52A8;&#x673A;</strong>&#x3002;</p>
<p>&#x6BD4;&#x5982; P+Epsilon &#x653B;&#x51FB;&#xFF0C;&#x5B83;&#x7684;&#x610F;&#x601D;&#x662F;&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x5F71;&#x54CD;&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x6295;&#x7968;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x96F6;&#x6210;&#x672C;&#x5730;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x653B;&#x51FB;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;&#x96F6;&#x6210;&#x672C;&#x5462;&#xFF1F;&#x60F3;&#x8C61;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5F53;&#x6295;&#x7968;&#x8005;A&#x4E0E;&#x591A;&#x6570;&#x4EBA;&#x6295;&#x7968;&#x76F8;&#x540C;&#x65F6;&#xFF0C;&#x5C31;&#x80FD;&#x83B7;&#x5F97;&#x5956;&#x8D4F;&#x3002;&#x5982;&#x679C;&#x591A;&#x6570;&#x4EBA;&#x6295;1&#xFF0C;&#x4ED6;&#x6295;1&#xFF0C;&#x5956;&#x52B1;&#x662F;P&#xFF1B;&#x5982;&#x679C;&#x591A;&#x6570;&#x4EBA;&#x6295;0&#xFF0C;&#x4ED6;&#x6295;0&#xFF0C;&#x5956;&#x52B1;&#x4E5F;&#x662F;P&#x3002;&#x5426;&#x5219;&#x5956;&#x52B1;&#x662F;0.&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x5929;&#x5927;&#x5BB6;&#x8981;&#x53BB;&#x6295;&#x7968;&#xFF0C;&#x771F;&#x6B63;&#x5E94;&#x8BE5;&#x8981;&#x6295;&#x201C;0&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x653B;&#x51FB;&#x8005;&#x627F;&#x8BFA;&#x5982;&#x679C;&#x6295;&#x7968;&#x8005;A&#x6295;1&#xFF0C;&#x5E76;&#x4E14;&#x5E76;&#x4E14;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x6295;0&#xFF0C;&#x5C06;&#x652F;&#x4ED8;&#x201C;P+E&#x201D;&#x7684;&#x5956;&#x52B1;&#xFF0C;&#x8FD9;&#x5F3A;&#x70C8;&#x5730;&#x6FC0;&#x52B1;&#x4ED6;&#x6295;1.&#x6240;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x6295;&#x7968;&#x8005;&#x5F97;&#x5230;&#x76F8;&#x540C;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x6295;&#x7968;1&#xFF0C;&#x56E0;&#x6B64;&#x653B;&#x51FB;&#x8005;&#x4E0D;&#x82B1;&#x94B1;&#x5C31;&#x80FD;&#x5F71;&#x54CD;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x6295;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x7684;&#x503C;&#x3002;DPoS &#x7684;&#x7CFB;&#x7EDF;&#x4E3A;&#x4EC0;&#x4E48;&#x53D7;&#x8FD9;&#x4E2A;&#x653B;&#x51FB;&#x7684;&#x5F71;&#x54CD;&#x6BD4;&#x8F83;&#x5927;&#x5462;&#xFF1F;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x534F;&#x8BAE;&#x76EE;&#x524D;&#x65E0;&#x6CD5;&#x60E9;&#x7F5A;&#x6295;&#x7968;&#x8005;&#xFF08;token voters&#xFF09;&#xFF0C;&#x867D;&#x7136;&#x5728;EOS&#x91CC;&#x4F60;&#x8981;&#x62B5;&#x62BC;token&#x624D;&#x80FD;&#x6295;&#x7968;&#xFF0C;&#x4F46;EOS&#x534F;&#x8BAE;&#x76EE;&#x524D;&#x6CA1;&#x6709;&#x89C4;&#x5219;&#x8BF4;&#x5982;&#x679C;&#x4F60;&#x7684;&#x6295;&#x7968;&#x88AB;&#x8D3F;&#x8D42;&#xFF0C;&#x4F60;&#x7684; token stake &#x5C31;&#x4F1A;&#x88AB;&#x6263;&#x6389;&#x3002;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x7684; DPoS &#x7CFB;&#x7EDF;&#x5728;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x5728; Cosmos &#x4E2D;&#xFF0C;&#x6295;&#x7968;&#x7684;token&#x6301;&#x6709;&#x4EBA;&#x5FC5;&#x987B;&#x5C06;&#x5176;token&#x62BC;&#x5728;&#x62BC;&#x91D1;&#x6C60;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x6216;&#x4ED6;&#x4EEC;&#x6295;&#x51FA;&#x7684;&#x8282;&#x70B9;&#x505A;&#x4E86;&#x6076;&#x610F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6BD4;&#x5982;&#x6295;&#x7968;&#x7ED9;&#x865A;&#x5047;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x8D3F;&#x8D42;&#x5176;&#x4ED6;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x4F1A;&#x88AB;&#x6263;&#x62BC;&#x91D1;&#x4F5C;&#x4E3A;&#x60E9;&#x7F5A;&#x3002;&#x76F8;&#x6BD4;EOS&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x63D0;&#x9AD8;&#x4E86;&#x4F5C;&#x6076;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x4ECE;&#x800C;&#x66F4;&#x80FD;&#x9632;&#x6B62;&#x6076;&#x610F;&#x884C;&#x4E3A;&#x3002;</p>
<p>DPoS &#x548C; Casper PoS &#x7684;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x662F;&#xFF0C;&#x5728; DPoS &#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6709;&#x8BA4;&#x8BC1;&#x6743;&#x7684;&#x8282;&#x70B9;&#x662F;&#x88AB;token&#x6301;&#x6709;&#x8005;&#x9009;&#x4E3E;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x7136;&#x800C;&#x5728; Casper PoS &#x4E2D;&#xFF0C;&#x4EFB;&#x4F55;token&#x6301;&#x6709;&#x8005;&#x90FD;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684; ETH &#x53D1;&#x9001;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x3002;Casper PoS &#x8FD8;&#x5728;&#x53D1;&#x5C55;&#x4E2D;&#xFF0C;&#x5177;&#x4F53;&#x673A;&#x5236;&#x53EF;&#x80FD;&#x4E5F;&#x4F1A;&#x5728;&#x4E3A;&#x4E86;&#x968F;&#x65F6;&#x95F4;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;DPoS &#x51CF;&#x5C11;&#x4E86;&#x8BB0;&#x8D26;&#x8282;&#x70B9;&#x89C4;&#x6A21;&#xFF0C;&#x5C5E;&#x4E8E;&#x5F31;&#x4E2D;&#x5FC3;&#x5316;&#xFF0C;&#x6548;&#x7387;&#x6709;&#x6240;&#x63D0;&#x9AD8;&#x3002;&#x4F46;&#x7531;&#x4E8E;&#x727A;&#x7272;&#x4E86;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x516C;&#x6709;&#x94FE;&#x3002;</p>
</li>
<li><p><strong>PBFT&#xFF1A;Practical Byzantine Fault Tolerance&#xFF0C;&#x5B9E;&#x7528;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x7B97;&#x6CD5;</strong></p>
<p>&#x62DC;&#x5360;&#x5EAD;&#x5171;&#x8BC6;&#x7B97;&#x6CD5;&#xFF08;<a href="http://pmg.csail.mit.edu/papers/osdi99.pdf" target="_blank">PBFT</a>&#xFF09;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x5171;&#x8BC6;&#x8BC1;&#x660E;&#x3002;<strong>&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5728;&#x4FDD;&#x8BC1;&#x6D3B;&#x6027;&#x548C;&#x5B89;&#x5168;&#x6027;&#xFF08;liveness &amp; safety&#xFF09;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x63D0;&#x4F9B;&#x4E86;(N-1)/3&#x7684;&#x5BB9;&#x9519;&#x6027;</strong>&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x7B97;&#x6CD5;&#xFF0C;&#x57FA;&#x4E8E;&#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x95EE;&#x9898;&#xFF0C;&#x7B97;&#x6CD5;&#x7ECF;&#x8FC7;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x6027;&#xFF1A;&#x9884;&#x51C6;&#x5907;&#xFF08;pre-prepare&#xFF09;&#x3001;&#x51C6;&#x5907;(prepare)&#x548C;&#x786E;&#x8BA4;(commit)&#xFF0C;&#x8FD9;&#x4E9B;&#x9636;&#x6BB5;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x5931;&#x8D25;&#x800C;&#x91CD;&#x590D;&#x8FDB;&#x884C;&#x3002;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="image/PBFT.png" alt="PBFT"></p>
<p>&#x5176;&#x4E2D;C&#x4E3A;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x7AEF;&#xFF0C;0123&#x4E3A;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;3&#x4E3A;&#x5B95;&#x673A;&#x7684;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x5177;&#x4F53;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li><strong>Request</strong>&#xFF1A;&#x8BF7;&#x6C42;&#x7AEF;C&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x5230;&#x4EFB;&#x610F;&#x4E00;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x91CC;&#x662F;0</li>
<li><strong>Pre-Prepare</strong>&#xFF1A;&#x670D;&#x52A1;&#x7AEF;0&#x6536;&#x5230;C&#x7684;&#x8BF7;&#x6C42;&#x540E;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#xFF0C;&#x6269;&#x6563;&#x81F3;123</li>
<li><strong>Prepare</strong>&#xFF1A;123&#xFF0C;&#x6536;&#x5230;&#x540E;&#x8BB0;&#x5F55;&#x5E76;&#x518D;&#x6B21;&#x5E7F;&#x64AD;&#xFF0C;1 &#x2014;&gt; 023&#xFF0C;2 &#x2014;&gt; 013&#xFF0C;3&#x56E0;&#x4E3A;&#x5B95;&#x673A;&#x65E0;&#x6CD5;&#x5E7F;&#x64AD;</li>
<li><strong>Commit</strong>&#xFF1A;0123&#x8282;&#x70B9;&#x5728; Prepare &#x9636;&#x6BB5;&#xFF0C;&#x82E5;&#x6536;&#x5230;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x76F8;&#x540C;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x8FDB;&#x5165; Commit &#x9636;&#x6BB5;&#xFF0C;&#x5E7F;&#x64AD; Commit &#x8BF7;&#x6C42;</li>
<li><strong>Reply</strong>&#xFF1A;0123&#x8282;&#x70B9;&#x5728; Commit &#x9636;&#x6BB5;&#xFF0C;&#x82E5;&#x6536;&#x5230;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x76F8;&#x540C;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x5BF9;C&#x8FDB;&#x884C;&#x53CD;&#x9988;</li>
</ol>
<p>&#x6839;&#x636E;&#x4E0A;&#x8FF0;&#x6D41;&#x7A0B;&#xFF0C;&#x5728; N &#x2265; 3F + 1 &#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#x4E00;&#x81F4;&#x6027;&#x662F;&#x53EF;&#x80FD;&#x89E3;&#x6C7A;&#x7684;&#xFF0C;N&#x4E3A;&#x603B;&#x8282;&#x70B9;&#x6570;&#xFF0C;F&#x4E3A;&#x6709;&#x95EE;&#x9898;&#x7684;&#x8282;&#x70B9;&#x6570;&#x3002;</p>
<p>N=4 F=0 &#x65F6;&#xFF1A;</p>
<p>|        |  &#x5F97;&#x5230;&#x6570;&#x636E;  |   &#x6700;&#x7EC8;&#x6570;&#x636E;  |
| :----: | :--------: | :--------: |
|   A    |   1 1 1 1  |      1     |
|   B    |   1 1 1 1  |      1     |
|   C    |   1 1 1 1  |      1     |
|   D    |   1 1 1 1  |      1     |</p>
<p>N=4 F=1 &#x65F6;&#xFF1A;</p>
<p>|        |  &#x5F97;&#x5230;&#x6570;&#x636E;  |   &#x6700;&#x7EC8;&#x6570;&#x636E;  |
| :----: | :--------: | :--------: |
|   A    |   1 1 1 0  |      1     |
|   B    |   1 1 0 1  |      1     |
|   C    |   1 0 1 1  |      1     |
|   D    |   0 1 1 1  |      1     |</p>
<p>N=4 F=2 &#x65F6;&#xFF1A;</p>
<p>|        |  &#x5F97;&#x5230;&#x6570;&#x636E;  |   &#x6700;&#x7EC8;&#x6570;&#x636E;  |
| :----: | :--------: | :--------: |
|   A    |   1 1 0 0  |     NA     |
|   B    |   1 0 0 1  |     NA     |
|   C    |   0 0 1 1  |     NA    |
|   D    |   0 1 1 0  |     NA     |</p>
<p>&#x7531;&#x6B64;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x80FD;&#x591F;&#x5BB9;&#x7EB3;&#x5C06;&#x8FD1;1/3&#x7684;&#x9519;&#x8BEF;&#x8282;&#x70B9;&#x8BEF;&#x5DEE;&#xFF0C;IBM&#x521B;&#x5EFA;&#x7684;Hyperledger&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E86;&#x8BE5;&#x7B97;&#x6CD5;&#x4F5C;&#x4E3A;&#x5171;&#x8BC6;&#x7B97;&#x6CD5;&#x3002;</p>
</li>
</ul>
</li>
</ul>
<h3 id="&#x975E;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;">&#x975E;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;</h3>
<p>&#x975E;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x5373;&#x4E0D;&#x8003;&#x8651;&#x6709;&#x6076;&#x610F;&#x8282;&#x70B9;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4EBA;&#x4EEC;&#x8003;&#x8651;&#x5230;1990 &#x5E74;&#x7531; Leslie Lamport &#x63D0;&#x51FA;&#x7684; Paxos &#x5171;&#x8BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x5DE5;&#x7A0B;&#x89D2;&#x5EA6;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x79CD;&#x6700;&#x5927;&#x5316;&#x4FDD;&#x969C;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E00;&#x81F4;&#x6027;&#xFF08;&#x5B58;&#x5728;&#x6781;&#x5C0F;&#x7684;&#x6982;&#x7387;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x4E00;&#x81F4;&#xFF09;&#x7684;&#x673A;&#x5236;&#x3002;</p>
<ul>
<li><p><strong>Paxos</strong></p>
<p>Paxos&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x4E14;&#x5177;&#x6709;&#x9AD8;&#x5EA6;&#x5BB9;&#x9519;&#x7279;&#x6027;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x7B97;&#x6CD5;&#x3002;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x662F;Zookeeper&#x3002;</p>
<p><strong>Paxos&#x4E2D;&#x6709;&#x4E09;&#x7C7B;&#x89D2;&#x8272;Proposer&#x3001;Acceptor&#x53CA;Learner</strong>&#x3002;&#x5728;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x5145;&#x5F53;&#x591A;&#x79CD;&#x89D2;&#x8272;&#x3002;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x65E2;&#x662F;Proposer&#x53C8;&#x662F;Acceptor&#x53C8;&#x662F;Learner&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;&#x53EB;&#x63D0;&#x6848;&#xFF08;Proposal&#xFF09;&#x3002;&#x6700;&#x7EC8;&#x8981;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x7684;value&#x5C31;&#x5728;&#x63D0;&#x6848;&#x91CC;&#x3002;</p>
<p>1). proposer &#x63D0;&#x51FA;&#x63D0;&#x6848;&#xFF0C;&#x63D0;&#x6848;&#x4FE1;&#x606F;&#x5305;&#x62EC;&#x63D0;&#x6848;&#x7F16;&#x53F7;&#x548C;&#x63D0;&#x8BAE;&#x7684;value;</p>
<p>2). acceptor &#x6536;&#x5230;&#x63D0;&#x6848;&#x540E;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;(accept)&#x63D0;&#x6848;;</p>
<p>3). learner &#x53EA;&#x80FD;&quot;&#x5B66;&#x4E60;&quot;&#x88AB;&#x6279;&#x51C6;&#x7684;&#x63D0;&#x6848;;</p>
<p><strong>&#x7B97;&#x6CD5;&#x4FDD;&#x91CD;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x57FA;&#x672C;&#x8BED;&#x4E49;:</strong></p>
<p>1). &#x51B3;&#x8BAE;(value)&#x53EA;&#x6709;&#x5728;&#x88AB;proposers&#x63D0;&#x51FA;&#x540E;&#x624D;&#x80FD;&#x88AB;&#x6279;&#x51C6;(&#x672A;&#x7ECF;&#x6279;&#x51C6;&#x7684;&#x51B3;&#x8BAE;&#x79F0;&#x4E3A;&quot;&#x63D0;&#x6848;(proposal)&quot;);</p>
<p>2). &#x5728;&#x4E00;&#x6B21;Paxos&#x7B97;&#x6CD5;&#x7684;&#x6267;&#x884C;&#x5B9E;&#x4F8B;&#x4E2D;&#xFF0C;&#x53EA;&#x6279;&#x51C6;(chosen)&#x4E00;&#x4E2A;value;</p>
<p>3). learners&#x53EA;&#x80FD;&#x83B7;&#x5F97;&#x88AB;&#x6279;&#x51C6;(chosen)&#x7684;value;</p>
<p><strong>&#x7531;&#x4E0A;&#x9762;&#x7684;&#x4E09;&#x4E2A;&#x8BED;&#x4E49;&#x53EF;&#x6F14;&#x5316;&#x4E3A;&#x56DB;&#x4E2A;&#x7EA6;&#x675F;:</strong></p>
<p>1). P<sub>1</sub>:&#x4E00;&#x4E2A;acceptor&#x5FC5;&#x987B;&#x63A5;&#x53D7;(accept)&#x7B2C;&#x4E00;&#x6B21;&#x6536;&#x5230;&#x7684;&#x63D0;&#x6848;;</p>
<p>2). P<sub>2a</sub>:&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x5177;&#x6709;value v&#x7684;&#x63D0;&#x6848;&#x88AB;&#x6279;&#x51C6;(chosen)&#xFF0C;&#x90A3;&#x4E48;&#x4E4B;&#x540E;&#x4EFB;&#x4F55;acceptor &#x518D;&#x6B21;&#x63A5;&#x53D7;(accept)&#x7684;&#x63D0;&#x6848;&#x5FC5;&#x987B;&#x5177;&#x6709;value v;</p>
<p>3). P<sub>2b</sub>:&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x5177;&#x6709;value v&#x7684;&#x63D0;&#x6848;&#x88AB;&#x6279;&#x51C6;(chosen)&#xFF0C;&#x90A3;&#x4E48;&#x4EE5;&#x540E;&#x4EFB;&#x4F55; proposer &#x63D0;&#x51FA;&#x7684;&#x63D0;&#x6848;&#x5FC5;&#x987B;&#x5177;&#x6709;value v;</p>
<p>4). P<sub>2c</sub>:&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7F16;&#x53F7;&#x4E3A; N &#x7684;&#x63D0;&#x6848;&#x5177;&#x6709;value v&#xFF0C;&#x90A3;&#x4E48;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x591A;&#x6570;&#x6D3E;&#xFF0C;&#x8981;&#x4E48;&#x4ED6;&#x4EEC;&#x4E2D;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6CA1;&#x6709;&#x63A5;&#x53D7;(accept)&#x7F16;&#x53F7;&#x5C0F;&#x4E8E; N &#x7684;&#x4EFB;&#x4F55;&#x63D0;&#x6848;&#xFF0C;&#x8981;&#x4E48;&#x4ED6;&#x4EEC;&#x5DF2;&#x7ECF;&#x63A5;&#x53D7;(accpet)&#x7684;&#x6240;&#x6709;&#x7F16;&#x53F7;&#x5C0F;&#x4E8E; N &#x7684;&#x63D0;&#x6848;&#x4E2D;&#x7F16;&#x53F7;&#x6700;&#x5927;&#x7684;&#x90A3;&#x4E2A;&#x63D0;&#x6848;&#x5177;&#x6709;value v;</p>
<p><strong>Paxos&#x7B97;&#x6CD5;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;</strong>&#x3002;&#x5177;&#x4F53;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x9636;&#x6BB5;&#x4E00;&#xFF1A;</p>
<p>(a) Proposer&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x63D0;&#x6848;&#x7F16;&#x53F7;K&#xFF0C;&#x7136;&#x540E;&#x5411;&#x534A;&#x6570;&#x4EE5;&#x4E0A;&#x7684;Acceptor&#x53D1;&#x9001;&#x7F16;&#x53F7;&#x4E3A; K &#x7684;Prepare&#x8BF7;&#x6C42;&#x3002;</p>
<p>(b) &#x5982;&#x679C;&#x4E00;&#x4E2A;Acceptor&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x7F16;&#x53F7;&#x4E3A; K &#x7684;Prepare&#x8BF7;&#x6C42;&#xFF0C;&#x4E14; K &#x5927;&#x4E8E;&#x8BE5;Acceptor&#x5DF2;&#x7ECF;&#x54CD;&#x5E94;&#x8FC7;&#x7684;&#x6240;&#x6709;Prepare&#x8BF7;&#x6C42;&#x7684;&#x7F16;&#x53F7;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4F1A;&#x5C06;&#x5B83;&#x5DF2;&#x7ECF;&#x63A5;&#x53D7;&#x8FC7;&#x7684;&#x7F16;&#x53F7;&#x6700;&#x5927;&#x7684;&#x63D0;&#x6848;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x4F5C;&#x4E3A;&#x54CD;&#x5E94;&#x53CD;&#x9988;&#x7ED9;Proposer&#xFF0C;&#x540C;&#x65F6;&#x8BE5;Acceptor&#x627F;&#x8BFA;&#x4E0D;&#x518D;&#x63A5;&#x53D7;&#x4EFB;&#x4F55;&#x7F16;&#x53F7;&#x5C0F;&#x4E8E; K &#x7684;&#x63D0;&#x6848;&#x3002;</p>
<p>&#x9636;&#x6BB5;&#x4E8C;&#xFF1A;</p>
<p>(a) &#x5982;&#x679C;Proposer&#x6536;&#x5230;&#x534A;&#x6570;&#x4EE5;&#x4E0A;Acceptor&#x5BF9;&#x5176;&#x53D1;&#x51FA;&#x7684;&#x7F16;&#x53F7;&#x4E3A;N&#x7684;Prepare&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4F1A;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x9488;&#x5BF9; [K,V] &#x63D0;&#x6848;&#x7684;Accept&#x8BF7;&#x6C42;&#x7ED9;&#x534A;&#x6570;&#x4EE5;&#x4E0A;&#x7684;Acceptor&#x3002;&#x6CE8;&#x610F;&#xFF1A;V &#x5C31;&#x662F;&#x6536;&#x5230;&#x7684;&#x54CD;&#x5E94;&#x4E2D;&#x7F16;&#x53F7;&#x6700;&#x5927;&#x7684;&#x63D0;&#x6848;&#x7684;value&#xFF0C;&#x5982;&#x679C;&#x54CD;&#x5E94;&#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x63D0;&#x6848;&#xFF0C;&#x90A3;&#x4E48;V &#x5C31;&#x7531;Proposer&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#x3002;</p>
<p>(b) &#x5982;&#x679C;Acceptor&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x9488;&#x5BF9;&#x7F16;&#x53F7;&#x4E3A; K &#x7684;&#x63D0;&#x6848;&#x7684;Accept&#x8BF7;&#x6C42;&#xFF0C;&#x53EA;&#x8981;&#x8BE5;Acceptor&#x6CA1;&#x6709;&#x5BF9;&#x7F16;&#x53F7;&#x5927;&#x4E8E; K &#x7684;Prepare&#x8BF7;&#x6C42;&#x505A;&#x51FA;&#x8FC7;&#x54CD;&#x5E94;&#xFF0C;&#x5B83;&#x5C31;&#x63A5;&#x53D7;&#x8BE5;&#x63D0;&#x6848;&#x3002;</p>
<p>&#x7B97;&#x6CD5;&#x6F14;&#x793A;&#xFF1A;
<img src="image/Paoxs.png" alt="Paxos"></p>
</li>
</ul>
<ul>
<li>&#xFF08;<em>PBFT &#x548C; Paxos &#x53C2;&#x8003;&#x9605;&#x8BFB;&#x6587;&#x732E;<a href="https://blog.csdn.net/jerry81333/article/details/74303194" target="_blank">1</a>, <a href="http://www.cnblogs.com/linbingdong/p/6253479.html" target="_blank">2</a>,<a href="https://blog.csdn.net/xhh198781/article/details/10949697" target="_blank">3</a></em>&#xFF09;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="CH02.html" class="navigation navigation-prev " aria-label="Previous page: 机制设计和博弈论基础">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="CH04.html" class="navigation navigation-next " aria-label="Next page: Token分类和Token经济的设计">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"共识机制","level":"1.2.3","depth":2,"next":{"title":"Token分类和Token经济的设计","level":"1.2.4","depth":2,"path":"Incentive_design/CH04.md","ref":"./Incentive_design/CH04.md","articles":[]},"previous":{"title":"机制设计和博弈论基础","level":"1.2.2","depth":2,"path":"Incentive_design/CH02.md","ref":"./Incentive_design/CH02.md","articles":[]},"dir":"ltr"},"config":{"plugins":["mathjax","sectionx","back-to-top-button"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sectionx":{},"highlight":{},"back-to-top-button":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Cryptoeconomics","gitbook":"*"},"file":{"path":"Incentive_design/CH03.md","mtime":"2019-04-20T15:59:04.354Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-04-20T18:18:08.586Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

