
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Preface · Cryptoeconomics</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="CH01_Valuation.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Cryptoeconomics
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.1.1" data-path="CH00_Preface.html">
            
                <a href="CH00_Preface.html">
            
                    
                    Preface
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="CH01_Valuation.html">
            
                <a href="CH01_Valuation.html">
            
                    
                    Valuation
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="CH02_Block_Rewards.html">
            
                <a href="CH02_Block_Rewards.html">
            
                    
                    Block Rewards
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="CH03_Transaction_Fees.html">
            
                <a href="CH03_Transaction_Fees.html">
            
                    
                    Transaction Fees
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.5" data-path="CH04_Acknowledgement.html">
            
                <a href="CH04_Acknowledgement.html">
            
                    
                    Acknowledgement
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../Incentive_design/Incentive_design.html">
            
                <a href="../Incentive_design/Incentive_design.html">
            
                    
                    Incentive_design
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../Incentive_design/CH01.html">
            
                <a href="../Incentive_design/CH01.html">
            
                    
                    加密经济学和Token经济的起源和定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../Incentive_design/CH02.html">
            
                <a href="../Incentive_design/CH02.html">
            
                    
                    机制设计和博弈论基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../Incentive_design/CH03.html">
            
                <a href="../Incentive_design/CH03.html">
            
                    
                    共识机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../Incentive_design/CH04.html">
            
                <a href="../Incentive_design/CH04.html">
            
                    
                    Token分类和Token经济的设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../Incentive_design/CH05.html">
            
                <a href="../Incentive_design/CH05.html">
            
                    
                    Token的供给和需求
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Preface</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="chapter-7-economics">Chapter 7 Economics</h1>
<div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>
<ul class="sectlevel1">
<li><a href="#_beginning">Beginning</a></li>
</ul>
</div>
<div class="sect1">
<h2 id="_beginning">Beginning</h2>
<div class="sectionbody">
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The economic properties of cryptocurrencies are of central interest to a payment system and the focus of this chapter. Economic properties are closely intertwined with the specifics of the system design; this is particularly true for proof-of-stake (PoS) cryptocurrencies. In this chapter, we focus on three broad and connected issues related to the design of Unit-e: (i) valuation of cryptocurrencies in the proof-of-stake setting, (ii) the selection of block rewards, and (iii) the selection and disbursal of transaction fees. In particular, we highlight the delicate connection between these issues and our overall design of Unit-e as a proof-of-stake (PoS) payment system. <br></p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x7ECF;&#x6D4E;&#x5C5E;&#x6027;&#x662F;&#x4E00;&#x4E2A;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;&#x5229;&#x76CA;&#xFF0C;&#x4E5F;&#x662F;&#x672C;&#x7AE0;&#x7684;&#x91CD;&#x70B9;&#x3002; &#x7ECF;&#x6D4E;&#x5C5E;&#x6027;&#x4E0E;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x7684;&#x7EC6;&#x8282;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#xFF0C;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x6743;&#x76CA;&#x8BC1;&#x660E;&#xFF08;PoS&#xFF09;&#x673A;&#x5236;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x5C24;&#x5176;&#x5982;&#x6B64;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7740;&#x91CD;&#x8BA8;&#x8BBA;&#x4E0E; Unit-e &#x8BBE;&#x8BA1;&#x76F8;&#x5173;&#x7684;&#x4E09;&#x4E2A;&#x666E;&#x904D;&#x800C;&#x7D27;&#x5BC6;&#x76F8;&#x8FDE;&#x7684;&#x95EE;&#x9898;&#xFF1A;<strong>&#xFF08;i&#xFF09;&#x4F7F;&#x7528;&#x6743;&#x76CA;&#x8BC1;&#x660E;&#xFF08;PoS&#xFF09;&#x673A;&#x5236;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x4F30;&#x503C;&#x95EE;&#x9898;</strong>&#xFF0C;<strong>&#xFF08;ii&#xFF09;&#x533A;&#x5757;&#x5956;&#x52B1;&#x9009;&#x62E9;&#x95EE;&#x9898;</strong>&#xFF0C;&#x4EE5;&#x53CA;<strong>&#xFF08;iii&#xFF09;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x9009;&#x62E9;&#x548C;&#x652F;&#x4ED8;&#x95EE;&#x9898;</strong>&#x3002; &#x5C24;&#x5176;&#x662F;&#xFF0C;Unit-e &#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6743;&#x76CA;&#x8BC1;&#x660E;&#xFF08;PoS&#xFF09;&#x673A;&#x5236;&#x4E0B;&#x7684;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x7279;&#x522B;&#x5F3A;&#x8C03;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E0E; Unit-e &#x6574;&#x4F53;&#x8BBE;&#x8BA1;&#x4E4B;&#x95F4;&#x7684;&#x7EC6;&#x5FAE;&#x8054;&#x7CFB;&#x3002;<br>
<em>&#x6CE8;&#xFF1A;Unit-e&#xFF0C;&#x662F;&#x8981;&#x7ED9;&#x4E13;&#x6CE8;&#x4E8E;&#x652F;&#x4ED8;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#xFF0C;&#x662F;&#x7531;&#x5206;&#x5E03;&#x5F0F;&#x6280;&#x672F;&#x7814;&#x7A76;&#x57FA;&#x91D1;&#x4F1A;&#x652F;&#x6301;&#x7684;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x3001;&#x5B8C;&#x5168;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x3002;</em></p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This chapter has three contributions: <br></p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6709;&#x4E09;&#x4E2A;&#x8D21;&#x732E;&#xFF1A;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="olist arabic">
<ol class="arabic">
<li>
<p>We present a theoretical valuation framework for PoS payment systems. Although cryptocurrencies can have applications beyond just payment processing, this framework gives us a concrete lower bound for reasoning about the fiat valuation of Unit-e. Unlike PoW cryptocurrencies, the first-order e&#xFB00;ect is no longer the cost of keeping the network running (i.e., mining). Instead, token valuation stems from a combination of two factors: consumer demand for holding tokens, and validator demand for holding tokens. The first term is inversely proportional to token velocity, whereas the second term is proportional to the economic value of the aggregate transaction fee flow. Our analysis provides an important input into various design decisions in PoS systems, including monetary policy, rewards, transaction fees, and network security mechanisms. <br></p>
</li>
<li>
<p>We study the effects of block rewards on user adoption and equity of rewards among block proposers and validators. One key insight is that in PoS systems, severe stake imbalance can arise from compounding in users&#x2019; stake pools, even if nodes are following protocol. That is, a node that starts with a small fraction of stake can end up with an arbitrarily high fraction of stake, simply due to randomness in the PoS proposal stage. We show theoretically that this e&#xFB00;ect can be mitigated through two factors: choice of block reward function and size of the initial stake pool. We prove the optimality (in terms of maximizing equitability) of a novel <strong>geometric block reward function</strong> and advocate for starting with a large initial stake pool to mitigate the e&#xFB00;ects of stake compounding. <br></p>
</li>
<li>
<p>We discuss various transaction fee mechanisms, highlighting key tradeo&#xFB00;s of various design choices in terms of supporting low congestion and stable valuations according to the models in part (1).  <br></p>
</li>
</ol>
</div>
</blockquote>
</div>
<div class="olist arabic">
<ol class="arabic">
<li>
<p>&#x6211;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;PoS&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x7684;&#x4F30;&#x503C;&#x67B6;&#x6784;&#x3002;&#x867D;&#x7136;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x5E94;&#x7528;&#x4E0D;&#x4EC5;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;&#x652F;&#x4ED8;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4E0B;&#x9650;&#xFF0C;&#x7528;&#x4E8E;&#x5BF9;e&#x5355;&#x5143;&#xFF08;Unit-e&#xFF09;&#x8FDB;&#x884C;&#x6CD5;&#x5B9A;&#x4F30;&#x503C;&#x63A8;&#x7406;&#x3002;&#x4E0E;PoW&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x9636;&#x6548;&#x5E94;&#x4E0D;&#x518D;&#x662F;&#x7EF4;&#x6301;&#x7F51;&#x7EDC;&#x8FD0;&#x8F6C;&#xFF08;&#x5373;&#x6316;&#x77FF;&#xFF09;&#x7684;&#x6210;&#x672C;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x4EE3;&#x5E01;&#x4F30;&#x503C;&#x6E90;&#x4E8E;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#x7684;&#x7EC4;&#x5408;&#xFF1A;&#x6D88;&#x8D39;&#x8005;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x7684;&#x9700;&#x6C42;&#x548C;&#x9A8C;&#x8BC1;&#x8005;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x7684;&#x9700;&#x6C42;&#x3002;&#x7B2C;&#x4E00;&#x9879;&#x4E0E;&#x4EE3;&#x5E01;&#x7684;&#x5468;&#x8F6C;&#x7387;&#x6210;&#x53CD;&#x6BD4;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x9879;&#x4E0E;&#x603B;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x6D41;&#x7684;&#x7ECF;&#x6D4E;&#x4EF7;&#x503C;&#x6210;&#x6B63;&#x6BD4;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x5206;&#x6790;&#x4E3A;POS&#x7CFB;&#x7EDF;&#x7684;&#x5404;&#x79CD;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x63D0;&#x4F9B;&#x4E86;&#x91CD;&#x8981;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5305;&#x62EC;&#x8D27;&#x5E01;&#x653F;&#x7B56;&#x3001;&#x5956;&#x52B1;&#x3001;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x673A;&#x5236;&#x3002; <br></p>
</li>
<li>
<p>&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E86;&#x533A;&#x5757;&#x5956;&#x52B1;&#x5BF9;&#x7528;&#x6237;&#x91C7;&#x7528;&#x60C5;&#x51B5;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4EE5;&#x53CA;&#x5956;&#x52B1;&#x7684;&#x516C;&#x5E73;&#x6027;&#x5728;&#x51FA;&#x5757;&#x4EBA;&#x548C;&#x9A8C;&#x8BC1;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x9886;&#x609F;&#x662F;&#xFF0C;&#x5728; PoS &#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x8282;&#x70B9;&#x9075;&#x5B88;&#x534F;&#x8BAE;&#xFF0C;&#x7528;&#x6237;&#x6743;&#x76CA;&#x6C60;&#x4E2D;&#x7684;&#x590D;&#x5229;&#x4E5F;&#x53EF;&#x80FD;&#x5F15;&#x8D77;&#x4E25;&#x91CD;&#x7684;&#x6743;&#x76CA;&#x5931;&#x8861;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x53EA;&#x662F;&#x4EE5;&#x5F88;&#x5C0F;&#x7684;&#x6743;&#x76CA;&#x5F00;&#x59CB;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x6700;&#x7EC8;&#x53EF;&#x80FD;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x9AD8;&#x6BD4;&#x4F8B;&#x7684;&#x6743;&#x76CA;&#xFF0C;&#x800C;&#x8FD9;&#x4EC5;&#x4EC5;&#x662F;&#x7531;&#x4E8E; PoS &#x63D0;&#x6848;&#x9636;&#x6BB5;&#x7684;&#x968F;&#x673A;&#x6027;&#x6240;&#x81F4;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x79CD;&#x5F71;&#x54CD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#x6765;&#x51CF;&#x8F7B;&#xFF1A;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x7684;&#x9009;&#x62E9;&#x3001;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6C60;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x6211;&#x4EEC;&#x8BC1;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x5947;&#x7684;<strong>&#x51E0;&#x4F55;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;</strong>&#x5728;&#x516C;&#x5E73;&#x6027;&#x6700;&#x5927;&#x5316;&#x65B9;&#x9762;&#x7684;&#x6700;&#x4F18;&#x6027;&#xFF0C;&#x5E76;&#x63D0;&#x5021;&#x4ECE;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6C60;&#x5F00;&#x59CB;&#xFF0C;&#x4EE5;&#x51CF;&#x8F7B;&#x6743;&#x76CA;&#x590D;&#x5229;&#x7684;&#x5F71;&#x54CD;&#x3002;  <br></p>
</li>
<li>
<p>&#x6839;&#x636E;&#x8BBA;&#x6587;&#x7B2C;&#xFF08;1&#xFF09;&#x90E8;&#x5206;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x8BBA;&#x8FF0;&#x4E86;&#x5404;&#x79CD;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x673A;&#x5236;&#xFF0C;&#x7740;&#x91CD;&#x5F3A;&#x8C03;&#x4E86;&#x5404;&#x79CD;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;&#x5728;&#x652F;&#x6301;&#x4F4E;&#x62E5;&#x5835;&#x548C;&#x7A33;&#x5B9A;&#x4F30;&#x503C;&#x65B9;&#x9762;&#x7684;&#x5173;&#x952E;&#x6743;&#x8861;&#x3002; <br></p>
</li>
</ol>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>We want to emphasize that valuation and incentive mechanisms are closely intertwined. Incentive mechanisms play a dual role in the payment network: they elicit &#x201C;good&#x201D; behavior from network participants, such as block validators; they also distribute rewards, thereby a&#xFB00;ecting the allocation of tokens and the overall valuation. Our focus here is on the second aspect. Because tokens can be easily re-allocated across the network, they must earn the same rate of return regardless of how they are used. This implies that a system&#x2019;s choice of incentive mechanisms in relation to any particular activity (e.g., block validation, or o&#xFB00;-chain transaction routing) potentially a&#xFB00;ects the entire system through its e&#xFB00;ect on token valuation. For example, suppose one were to increase rewards for block validation: each token staked would now earn a higher expected number of tokens per unit of time as a reward. This would attract tokens towards validation and away from other activities, e.g., from o&#xFB00;-chain transaction routing. The result would be increased congestion for on-chain transactions, and lower transaction volume of o&#xFB00;-chain transactions. Another implication could be a reduction in the rate of growth of the token price, which would act to o&#xFB00;set the increased level of rewards for validation in terms of tokens. This, in turn, would make it more costly to hold tokens for transaction purposes. As this informal argument highlights, it is critical to analyze incentive designs in equilibrium, internalizing the e&#xFB00;ect of each incentive scheme on the entire network. <br></p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x8981;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#xFF0C;<strong>&#x4F30;&#x503C;&#x548C;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x662F;&#x7D27;&#x5BC6;&#x76F8;&#x8FDE;&#x7684;</strong>&#x3002;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x5728;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#x4E2D;&#x626E;&#x6F14;&#x7740;&#x53CC;&#x91CD;&#x89D2;&#x8272;&#xFF1A;&#x4ED6;&#x4EEC;&#x4F1A;&#x5F15;&#x5BFC;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x5411;&#x201C;&#x5584;&#x201D;&#xFF0C;&#x6BD4;&#x5982;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x8005;&#xFF1B;&#x5B83;&#x4EEC;&#x8FD8;&#x626E;&#x6F14;&#x7740;&#x5206;&#x53D1;&#x5956;&#x52B1;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x4ECE;&#x800C;&#x5F71;&#x54CD;&#x4EE3;&#x5E01;&#x7684;&#x5206;&#x914D;&#x548C;&#x6574;&#x4F53;&#x4F30;&#x503C;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x7740;&#x91CD;&#x5173;&#x6CE8;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x3002;&#x56E0;&#x4E3A;&#x4EE3;&#x5E01;&#x5F88;&#x5BB9;&#x6613;&#x5728;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x4E2D;&#x88AB;&#x91CD;&#x65B0;&#x5206;&#x914D;&#xFF0C;&#x6240;&#x4EE5;&#x65E0;&#x8BBA;&#x4ED6;&#x4EEC;&#x88AB;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x83B7;&#x5F97;&#x76F8;&#x540C;&#x7684;&#x56DE;&#x62A5;&#x7387;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x5BF9;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x6D3B;&#x52A8;&#x7684;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x7684;&#x9009;&#x62E9;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x3001;&#x94FE;&#x4E0B;&#x4EA4;&#x6613;&#x901A;&#x9053;&#xFF09;&#xFF0C;&#x90FD;&#x4F1A;&#x901A;&#x8FC7;&#x5BF9;&#x4EE3;&#x5E01;&#x4F30;&#x503C;&#x7684;&#x5F71;&#x54CD;&#x4ECE;&#x800C;&#x5BF9;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4EA7;&#x751F;&#x6F5C;&#x5728;&#x5F71;&#x54CD;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x4EBA;&#x4E3A;&#x4E86;&#x589E;&#x52A0;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x7684;&#x5956;&#x52B1;&#xFF1A;&#x73B0;&#x5728;&#xFF0C;&#x4ED6;&#x62BC;&#x5165;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x4EE3;&#x5E01;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x5355;&#x5143;&#x5C06;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x671F;&#x671B;&#x503C;&#x7684;&#x4EE3;&#x5E01;&#x6570;&#x91CF;&#x4F5C;&#x4E3A;&#x5956;&#x52B1;&#x3002;&#x8FD9;&#x5C06;&#x5438;&#x5F15;&#x4EE3;&#x5E01;&#x671D;&#x7740;&#x9A8C;&#x8BC1;&#x805A;&#x96C6;&#xFF0C;&#x5E76;&#x8FDC;&#x79BB;&#x5176;&#x4ED6;&#x6D3B;&#x52A8;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4ECE;&#x94FE;&#x4E0B;&#x4EA4;&#x6613;&#x901A;&#x9053;&#x8F6C;&#x5411;&#x53BB;&#x505A;&#x9A8C;&#x8BC1;&#x3002;&#x5176;&#x7ED3;&#x679C;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x94FE;&#x4E0A;&#x4EA4;&#x6613;&#x7684;&#x62E5;&#x5835;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x94FE;&#x4E0B;&#x4EA4;&#x6613;&#x7684;&#x4EA4;&#x6613;&#x989D;&#x3002;&#x53E6;&#x4E00;&#x5C42;&#x542B;&#x4E49;&#x53EF;&#x80FD;&#x662F;&#x964D;&#x4F4E;&#x4EE3;&#x5E01;&#x4EF7;&#x683C;&#x7684;&#x589E;&#x957F;&#x7387;&#xFF0C;&#x8FD9;&#x8868;&#x73B0;&#x4E3A;&#x62B5;&#x6D88;&#x4E86;&#x9A8C;&#x8BC1;&#x5956;&#x52B1;&#x7684;&#x4EE3;&#x5E01;&#x6240;&#x5E26;&#x6765;&#x7684;&#x6536;&#x76CA;&#x589E;&#x957F;&#x6C34;&#x5E73;&#x3002;&#x76F8;&#x5E94;&#x5730;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x7684;&#x6210;&#x672C;&#x66F4;&#x9AD8;&#x3002;&#x6B63;&#x5982;&#x8FD9;&#x4E00;&#x975E;&#x6B63;&#x5F0F;&#x7684;&#x8BBA;&#x70B9;&#x6240;&#x5F3A;&#x8C03;&#x7684;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x5206;&#x6790;&#x6FC0;&#x52B1;&#x8BBE;&#x8BA1;&#x7684;&#x5747;&#x8861;&#x6027;&#x3001;&#x5C06;&#x6BCF;&#x4E2A;&#x6FC0;&#x52B1;&#x65B9;&#x6848;&#x5728;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6548;&#x679C;&#x8FDB;&#x884C;&#x5185;&#x5316;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002; <br></p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>More concretely, our primary focus in this chapter will be on incentive mechanisms that encourage participation in block proposal and validation. Participation incentives in cryptocurrencies generally take one of two forms: <strong>(1) transaction fees</strong>, and <strong>(2) validation/block rewards</strong>. Transaction fees are a small fee paid to validators and/or block proposers as a reward for processing a given transaction. In Bitcoin, transaction fees are given to the miner whose block contains the transaction, and are paid by the user who generates the payment. Block rewards, on the other hand, are freshly-minted tokens that are awarded to the node(s) that validate and/or propose a particular block. In some blockchain systems, the roles of block proposers and validators can be separate; for instance, Ethereum proposes such a structure in its future roadmap [183], and Prism naturally separates the functionalities (Chapter 3). In aggregate, transaction fees and block rewards must be valuable enough to incentivize validators to participate in the network. At the same time, transaction fees must be low enough to incentivize participation from transactors. The idea of cryptocurrencies as payment systems has garnered mainstream support based on the premise that transaction fees can be lower relative to traditional services (e.g., credit cards). Thus, at the outset, there exists potential surplus that consumers and network participants aim to realize by reducing transaction frictions. Network participants, like validators, o&#xFB00;er services that consume resources and need to be compensated: these services are ultimately compensated with fees paid by consumers. A network design (like Bitcoin) that relies on congestion to induce consumers to o&#xFB00;er su&#xFB03;ciently high fees to support network activities is ine&#xFB03;cient: while congestion serves as a part of the revelation mechanism, it imposes dead-weight losses on the entire economic system. From this perspective, a design like the POS system, which instead relies on financial incentives (which are transfers between various actors) is appealing due to its e&#xFB03;ciency: it better preserves the total consumer surplus. <br></p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x66F4;&#x5177;&#x4F53;&#x5730;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x70B9;&#x662F;&#x9F13;&#x52B1;&#x53C2;&#x4E0E;&#x51FA;&#x5757;&#x548C;&#x9A8C;&#x8BC1;&#x7684;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x3002;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x53C2;&#x4E0E;&#x6FC0;&#x52B1;&#x624B;&#x6BB5;&#x901A;&#x5E38;&#x91C7;&#x7528;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x4E4B;&#x4E00;&#xFF1A;<strong>&#xFF08;1&#xFF09;&#x4EA4;&#x6613;&#x8D39;&#x7528;</strong>&#xFF1B;<strong>&#xFF08;2&#xFF09;&#x9A8C;&#x8BC1;/&#x51FA;&#x5757;&#x5956;&#x52B1;</strong>&#x3002;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x662F;&#x652F;&#x4ED8;&#x7ED9;&#x9A8C;&#x8BC1;&#x8005;&#x548C;/&#x6216;&#x533A;&#x5757;&#x63D0;&#x6848;&#x4EBA;&#x7684;&#x5C0F;&#x989D;&#x8D39;&#x7528;&#xFF0C;&#x4F5C;&#x4E3A;&#x5904;&#x7406;&#x7ED9;&#x5B9A;&#x4EA4;&#x6613;&#x7684;&#x5956;&#x52B1;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x88AB;&#x652F;&#x4ED8;&#x7ED9;&#x4E86;&#x6240;&#x6253;&#x5305;&#x533A;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x8BE5;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x7531;&#x4EA7;&#x751F;&#x8BE5;&#x7B14;&#x4ED8;&#x6B3E;&#x7684;&#x7528;&#x6237;&#x652F;&#x4ED8;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x662F;&#x65B0;&#x201C;&#x94F8;&#x9020;&#x201D;&#x51FA;&#x6765;&#x7684;&#x4EE3;&#x5E01;&#xFF0C;&#x5956;&#x52B1;&#x7ED9;&#x9A8C;&#x8BC1;&#x548C;/&#x6216;&#x63D0;&#x6848;&#x7279;&#x5B9A;&#x533A;&#x5757;&#x7684;&#x8282;&#x70B9;&#xFF08;&#x5355;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#xFF09;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x533A;&#x5757;&#x7684;&#x51FA;&#x5757;&#x8005;&#x548C;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x89D2;&#x8272;&#x53EF;&#x80FD;&#x662F;&#x5206;&#x5F00;&#x7684;&#xFF1B;&#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x5728;&#x5176;&#x672A;&#x6765;&#x7684;&#x8DEF;&#x7EBF;&#x56FE;[183]&#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x8FD8;&#x6709;&#xFF0C;Prism&#x534F;&#x8BAE;&#x4E5F;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5730;&#x5206;&#x5F00;&#x4E86;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;<sub>&#xFF08;Prism&#x534F;&#x8BAE;&#xFF0C;&#x4E00;&#x4E2A;&#x63A5;&#x8FD1;&#x7269;&#x7406;&#x6781;&#x9650;&#x7684;&#x5171;&#x8BC6;&#x534F;&#x8BAE;&#xFF0C;&#x5728;&#x672C;&#x8BBA;&#x6587;&#x7B2C;3&#x7AE0;&#x7ED9;&#x51FA;&#x4E86;&#x8BE6;&#x7EC6;&#x89E3;&#x8BF4;&#xFF09;</sub>&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x4EE5;&#x6FC0;&#x52B1;&#x9A8C;&#x8BC1;&#x8005;&#x53C2;&#x4E0E;&#x7F51;&#x7EDC;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x5FC5;&#x987B;&#x8DB3;&#x591F;&#x4F4E;&#xFF0C;&#x4EE5;&#x6FC0;&#x52B1;&#x4EA4;&#x6613;&#x4EBA;&#x58EB;&#x7684;&#x53C2;&#x4E0E;&#x3002;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4F5C;&#x4E3A;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x7684;&#x7406;&#x5FF5;&#x83B7;&#x5F97;&#x4E3B;&#x6D41;&#x652F;&#x6301;&#x7684;&#x524D;&#x63D0;&#x662F;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x76F8;&#x5BF9;&#x4E8E;&#x4F20;&#x7EDF;&#x670D;&#x52A1;&#xFF08;&#x5982;&#x4FE1;&#x7528;&#x5361;&#xFF09;&#x53EF;&#x4EE5;&#x66F4;&#x4F4E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x548C;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x90FD;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x51CF;&#x5C11;&#x4EA4;&#x6613;&#x6469;&#x64E6;&#x6765;&#x8D5A;&#x53D6;&#x6F5C;&#x5728;&#x7684;&#x76C8;&#x4F59;&#x3002;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;&#x5982;&#x9A8C;&#x8BC1;&#x8005;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x6D88;&#x8017;&#x8D44;&#x6E90;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x5F97;&#x5230;&#x8865;&#x507F;&#xFF1A;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x6700;&#x7EC8;&#x7531;&#x6D88;&#x8D39;&#x8005;&#x652F;&#x4ED8;&#x7684;&#x8D39;&#x7528;&#x6765;&#x8865;&#x507F;&#x3002;&#x4E00;&#x4E2A;&#x4F9D;&#x9760;&#x7F51;&#x7EDC;&#x62E5;&#x5835;&#x6765;&#x8BF1;&#x5BFC;&#x6D88;&#x8D39;&#x8005;&#x63D0;&#x4F9B;&#x8DB3;&#x591F;&#x9AD8;&#x7684;&#x8D39;&#x7528;&#x6765;&#x652F;&#x6301;&#x7F51;&#x7EDC;&#x6D3B;&#x52A8;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7F51;&#x7EDC;&#x8BBE;&#x8BA1;&#xFF08;&#x5982;&#x6BD4;&#x7279;&#x5E01;&#xFF09;&#x662F;&#x6CA1;&#x6709;&#x6548;&#x7387;&#x7684;&#xFF1A;&#x5F53;&#x62E5;&#x5835;&#x6210;&#x4E3A;&#x542F;&#x793A;&#x673A;&#x5236;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4F1A;&#x5F3A;&#x52A0;&#x7ED9;&#x6574;&#x4E2A;&#x7ECF;&#x6D4E;&#x7CFB;&#x7EDF;&#x4EE5;&#x6C89;&#x91CD;&#x7684;&#x635F;&#x5931;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x50CF;POS&#x7CFB;&#x7EDF;&#x8FD9;&#x6837;&#x4F9D;&#x9760;&#x91D1;&#x878D;&#x6FC0;&#x52B1;&#xFF08;&#x5728;&#x4E0D;&#x540C;&#x53C2;&#x4E0E;&#x8005;&#x4E4B;&#x95F4;&#x4F20;&#x8F93;&#xFF09;&#x7684;&#x8BBE;&#x8BA1;&#x4E4B;&#x6240;&#x4EE5;&#x5438;&#x5F15;&#x4EBA;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x6548;&#x7387;&#xFF1A;&#x5B83;&#x66F4;&#x597D;&#x5730;&#x4FDD;&#x7559;&#x4E86;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x5168;&#x90E8;&#x76C8;&#x4F59;&#x3002; <br></p>
</div>
</div>
</div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Cryptoeconomics">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="CH01_Valuation.html" class="navigation navigation-next " aria-label="Next page: Valuation">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Preface","level":"1.1.1","depth":2,"next":{"title":"Valuation","level":"1.1.2","depth":2,"path":"Chapter_7_Economics/CH01_Valuation.asciidoc","ref":"./Chapter_7_Economics/CH01_Valuation.asciidoc","articles":[]},"previous":{"title":"Cryptoeconomics","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[{"title":"Preface","level":"1.1.1","depth":2,"path":"Chapter_7_Economics/CH00_Preface.asciidoc","ref":"./Chapter_7_Economics/CH00_Preface.asciidoc","articles":[]},{"title":"Valuation","level":"1.1.2","depth":2,"path":"Chapter_7_Economics/CH01_Valuation.asciidoc","ref":"./Chapter_7_Economics/CH01_Valuation.asciidoc","articles":[]},{"title":"Block Rewards","level":"1.1.3","depth":2,"path":"Chapter_7_Economics/CH02_Block_Rewards.asciidoc","ref":"./Chapter_7_Economics/CH02_Block_Rewards.asciidoc","articles":[]},{"title":"Transaction Fees","level":"1.1.4","depth":2,"path":"Chapter_7_Economics/CH03_Transaction_Fees.asciidoc","ref":"./Chapter_7_Economics/CH03_Transaction_Fees.asciidoc","articles":[]},{"title":"Acknowledgement","level":"1.1.5","depth":2,"path":"Chapter_7_Economics/CH04_Acknowledgement.asciidoc","ref":"./Chapter_7_Economics/CH04_Acknowledgement.asciidoc","articles":[]}]},"dir":"ltr"},"config":{"plugins":["mathjax","sectionx","back-to-top-button"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sectionx":{},"highlight":{},"back-to-top-button":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Cryptoeconomics","gitbook":"*"},"file":{"path":"Chapter_7_Economics/CH00_Preface.asciidoc","mtime":"2019-04-20T18:17:37.242Z","type":"asciidoc"},"gitbook":{"version":"3.2.3","time":"2019-04-20T18:18:08.586Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

