
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Valuation · Cryptoeconomics</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="CH02_Block_Rewards.html" />
    
    
    <link rel="prev" href="CH00_Preface.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Cryptoeconomics
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="CH00_Preface.html">
            
                <a href="CH00_Preface.html">
            
                    
                    Preface
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.1.2" data-path="CH01_Valuation.html">
            
                <a href="CH01_Valuation.html">
            
                    
                    Valuation
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="CH02_Block_Rewards.html">
            
                <a href="CH02_Block_Rewards.html">
            
                    
                    Block Rewards
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="CH03_Transaction_Fees.html">
            
                <a href="CH03_Transaction_Fees.html">
            
                    
                    Transaction Fees
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.5" data-path="CH04_Acknowledgement.html">
            
                <a href="CH04_Acknowledgement.html">
            
                    
                    Acknowledgement
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../Incentive_design/Incentive_design.html">
            
                <a href="../Incentive_design/Incentive_design.html">
            
                    
                    Incentive_design
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../Incentive_design/CH01.html">
            
                <a href="../Incentive_design/CH01.html">
            
                    
                    加密经济学和Token经济的起源和定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../Incentive_design/CH02.html">
            
                <a href="../Incentive_design/CH02.html">
            
                    
                    机制设计和博弈论基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../Incentive_design/CH03.html">
            
                <a href="../Incentive_design/CH03.html">
            
                    
                    共识机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../Incentive_design/CH04.html">
            
                <a href="../Incentive_design/CH04.html">
            
                    
                    Token分类和Token经济的设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../Incentive_design/CH05.html">
            
                <a href="../Incentive_design/CH05.html">
            
                    
                    Token的供给和需求
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Valuation</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>
<ul class="sectlevel1">
<li><a href="#_7_1_valuation">7.1  Valuation(&#x4F30;&#x503C;)</a>
<ul class="sectlevel2">
<li><a href="#_7_1_1_a_simple_model_with_fee_based_rewards">7.1.1   A Simple Model with Fee-Based Rewards&#xFF08;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x8D39;&#x7528;&#x5956;&#x52B1;&#x7684;&#x7B80;&#x5355;&#x6A21;&#x578B;&#xFF09;</a></li>
<li><a href="#_7_1_2_an_extended_model_with_increasing_token_supply">7.1.2 An Extended Model with Increasing Token Supply&#xFF08;&#x589E;&#x52A0;&#x4EE3;&#x5E01;&#x4F9B;&#x5E94;&#x7684;&#x6269;&#x5C55;&#x6A21;&#x578B;&#xFF09;</a></li>
</ul>
</li>
</ul>
</div>
<div class="sect1">
<h2 id="_7_1_valuation">7.1  Valuation(&#x4F30;&#x503C;)</h2>
<div class="sectionbody">
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Quantifying the valuation of a PoS cryptocurrency is critical, since the security of PoS systems depends primarily on the value of the underlying tokens. Valuation hinges on two key properties of this system. The first property has to do with the blockchain formation mechanism in a PoS network. Abstracting from the precise details of block validation and block proposal mechanisms, a key property of PoS networks is that the validation protocol requires participating nodes to commit (stake) a certain amount of tokens as collateral. In practice, PoS blockchain protocols typically ask nodes to commit stake for two main purposes: block proposal and block validation. Validation can be thought of either as a periodic finalization process (e.g., the Casper protocol from Ethereum [37]), or more generally, the process of nodes checking the validity of blocks and certifying their correctness in the blockchain. Rewards that accrue to the nodes participating in block proposal and validation are distributed in relation to the size of their committed stake. This protocol, in combination with additional measures (such as penalties for non-participation) is designed to induce proper participation in the validation process.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5BF9;&#x4E00;&#x4E2A;PoS&#x673A;&#x5236;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x8FDB;&#x884C;&#x4F30;&#x503C;&#x91CF;&#x5316;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;PoS&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x6027;&#x4E3B;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x6F5C;&#x5728;&#x4EE3;&#x5E01;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x4F30;&#x503C;&#x53D6;&#x51B3;&#x4E8E;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x5C5E;&#x6027;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x4E0E;POS&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5F62;&#x6210;&#x673A;&#x5236;&#x6709;&#x5173;&#x3002;&#x4ECE;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x548C;&#x51FA;&#x5757;&#x673A;&#x5236;&#x7684;&#x7CBE;&#x786E;&#x7EC6;&#x8282;&#x51FA;&#x53D1;&#xFF0C;POS&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7279;&#x6027;&#x662F;&#xFF0C;&#x9A8C;&#x8BC1;&#x534F;&#x8BAE;&#x8981;&#x6C42;&#x53C2;&#x4E0E;&#x8FDB;&#x6765;&#x7684;&#x8282;&#x70B9;&#x4FDD;&#x8BC1;&#xFF08;&#x8D28;&#x62BC;&#xFF09;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x4EE3;&#x5E01;&#x4F5C;&#x4E3A;&#x62C5;&#x4FDD;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;POS&#x533A;&#x5757;&#x94FE;&#x534F;&#x8BAE;&#x901A;&#x5E38;&#x8981;&#x6C42;&#x8282;&#x70B9;&#x4FDD;&#x8BC1;&#x5176;&#x6743;&#x76CA;&#x51FA;&#x4E8E;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#xFF1A;&#x533A;&#x5757;&#x51FA;&#x5757;&#x548C;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x3002;&#x9A8C;&#x8BC1;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x8981;&#x4E48;&#x662F;&#x4E00;&#x4E2A;&#x5468;&#x671F;&#x6027;&#x7684;&#x7EC8;&#x7ED3;&#x8FC7;&#x7A0B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x7684;Casper&#x534F;&#x8BAE;[37]&#xFF09;&#xFF0C;&#x8981;&#x4E48;&#x66F4;&#x901A;&#x4FD7;&#x5730;&#x8BF4;&#xFF0C;&#x662F;&#x8282;&#x70B9;&#x68C0;&#x67E5;&#x533A;&#x5757;&#x7684;&#x6709;&#x6548;&#x6027;&#x5E76;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x8BC1;&#x660E;&#x5176;&#x6B63;&#x786E;&#x6027;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x53C2;&#x4E0E;&#x533A;&#x5757;&#x51FA;&#x5757;&#x548C;&#x9A8C;&#x8BC1;&#x7684;&#x8282;&#x70B9;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x5956;&#x52B1;&#x5C06;&#x6839;&#x636E;&#x5176;&#x627F;&#x8BFA;&#x7684;&#x6743;&#x76CA;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8D28;&#x62BC;&#x7684;&#x4EE3;&#x5E01;&#x91CF;&#xFF09;&#x5927;&#x5C0F;&#x8FDB;&#x884C;&#x5206;&#x914D;&#x3002;&#x672C;&#x534F;&#x8BAE;&#x4E0E;&#x5176;&#x4ED6;&#x9644;&#x52A0;&#x63AA;&#x65BD;&#xFF08;&#x5982;&#x5BF9;&#x4E0D;&#x53C2;&#x4E0E;&#x7684;&#x5904;&#x7F5A;&#xFF09;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x65E8;&#x5728;&#x4FC3;&#x4F7F;&#x9A8C;&#x8BC1;&#x8FC7;&#x7A0B;&#x6709;&#x9002;&#x5F53;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>For our purposes, the main economic implication of this mechanism is that network participants who serve as block proposers or validators can earn rewards by committing their tokens to such activities. In our model, we do not distinguish between the two functionalities; we refer to both simply as &#x2018;validation&#x2019;. Thus, as long as tokens are used for validation, each token generates a stream of cash flows for its holder in the form of additional tokens. This simplified model does not necessarily represent more complex consensus structures (e.g., Prism); however, we use it as a starting point for more nuanced models of PoS consensus.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x51FA;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x8BE5;&#x673A;&#x5236;&#x7684;&#x4E3B;&#x8981;&#x7ECF;&#x6D4E;&#x542B;&#x4E49;&#x662F;&#xFF0C;&#x8BA9;&#x4F5C;&#x4E3A;&#x533A;&#x5757;&#x51FA;&#x5757;&#x8005;&#x6216;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x8D28;&#x62BC;&#x4ED6;&#x4EEC;&#x7684;&#x4EE3;&#x5E01;&#x5230;&#x6B64;&#x7C7B;&#x6D3B;&#x52A8;&#x4E2D;&#x6765;&#x83B7;&#x5F97;&#x5956;&#x52B1;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x5BF9;&#x8FD9;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#x505A;&#x533A;&#x5206;&#xFF1A;&#x6211;&#x4EEC;&#x628A;&#x4E24;&#x8005;&#x90FD;&#x7B80;&#x5355;&#x7684;&#x79F0;&#x4E3A;&#x201C;&#x9A8C;&#x8BC1;&#x201D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EA;&#x8981;&#x4EE3;&#x5E01;&#x88AB;&#x7528;&#x4E8E;&#x9A8C;&#x8BC1;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EE3;&#x5E01;&#x90FD;&#x4F1A;&#x4EE5;&#x989D;&#x5916;&#x4EE3;&#x5E01;&#x7684;&#x5F62;&#x5F0F;&#x4E3A;&#x5176;&#x6301;&#x6709;&#x8005;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x73B0;&#x91D1;&#x6D41;&#x3002;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x578B;&#x4E0D;&#x4E00;&#x5B9A;&#x4EE3;&#x8868;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5171;&#x8BC6;&#x7ED3;&#x6784;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;Prism&#x534F;&#x8BAE;&#xFF09;&#xFF1B;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x66F4;&#x7EC6;&#x5FAE;&#x7684;PoS&#x5171;&#x8BC6;&#x6A21;&#x578B;&#x7684;&#x8D77;&#x70B9;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The second property of the PoS network is that tokens can be re-allocated across various uses: the same token can be used for validation, for consumer and merchant transactions, for o&#xFB00;-chain routing of payments, etc. Our analysis assumes, as an approximation, that tokens can be re-allocated in a frictionless manner. If a specific design deviates from this idealized frictionless model, e.g., due to constraints imposed on movements of tokens within the system, one would need to enrich the model with an explicit description of such frictions.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>PoS&#x7F51;&#x7EDC;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x7279;&#x6027;&#x662F;&#xFF0C;&#x4EE3;&#x5E01;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x9014;&#x88AB;&#x518D;&#x5206;&#x914D;&#xFF1A;&#x540C;&#x4E00;&#x4E2A;&#x4EE3;&#x5E01;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x9A8C;&#x8BC1;&#x3001;&#x6D88;&#x8D39;&#x8005;&#x548C;&#x5546;&#x5BB6;&#x7684;&#x4EA4;&#x6613;&#x3001;&#x94FE;&#x4E0B;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7B49;&#x3002;&#x505A;&#x4E00;&#x4E2A;&#x8FD1;&#x4F3C;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4EE3;&#x5E01;&#x53EF;&#x4EE5;&#x5F88;&#x987A;&#x7545;&#x5730;&#x88AB;&#x518D;&#x5206;&#x914D;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8BBE;&#x8BA1;&#x504F;&#x79BB;&#x4E86;&#x8FD9;&#x4E2A;&#x7406;&#x60F3;&#x5316;&#x7684;&#x65E0;&#x6469;&#x64E6;&#x6A21;&#x578B;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x4E8E;&#x5F3A;&#x52A0;&#x4E8E;&#x7CFB;&#x7EDF;&#x5185;&#x4EE3;&#x5E01;&#x8C03;&#x52A8;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x79CD;&#x6469;&#x64E6;&#x6709;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x63CF;&#x8FF0;&#x6765;&#x4E30;&#x5BCC;&#x6A21;&#x578B;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>In a frictionless system, individual optimization by the network participants implies that expected rates of return on alternative feasible uses of the tokens must be equalized. In particular, any holder of a token may exchange it for &#xFB01;at currency and invest the proceeds in a portfolio of financial assets with a return risk pro&#xFB01;le similar to that of the tokens. Thus, in a system where tokens can be easily exchanged without frictions for &#xFB01;at currency, the rate of return on holding tokens must equal the opportunity cost: the expected rate of return on the risk-matched investment strategy in financial markets.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x4E00;&#x4E2A;&#x65E0;&#x6469;&#x64E6;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x4E2A;&#x4F53;&#x4F18;&#x5316;&#x610F;&#x5473;&#x7740;&#x5BF9;&#x4EE3;&#x5E01;&#x7684;&#x66FF;&#x4EE3;&#x53EF;&#x884C;&#x7528;&#x9014;&#x7684;&#x9884;&#x671F;&#x56DE;&#x62A5;&#x7387;&#x5FC5;&#x987B;&#x662F;&#x5747;&#x8861;&#x7684;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EE3;&#x5E01;&#x6301;&#x6709;&#x4EBA;&#x90FD;&#x53EF;&#x80FD;&#x5C06;&#x5176;&#x5151;&#x6362;&#x6210;&#x6CD5;&#x5E01;&#xFF0C;&#x5E76;&#x5C06;&#x6536;&#x76CA;&#x6295;&#x8D44;&#x4E8E;&#x548C;&#x4EE3;&#x5E01;&#x7684;&#x6536;&#x76CA;&#x98CE;&#x9669;&#x76F8;&#x8FD1;&#x7684;&#x91D1;&#x878D;&#x8D44;&#x4EA7;&#x7EC4;&#x5408;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5C06;&#x4EE3;&#x5E01;&#x5F88;&#x5BB9;&#x6613;&#x53C8;&#x5F88;&#x987A;&#x7545;&#x5730;&#x5151;&#x6362;&#x6210;&#x6CD5;&#x5E01;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x7684;&#x6536;&#x76CA;&#x7387;&#x5FC5;&#x987B;&#x7B49;&#x4E8E;&#x673A;&#x4F1A;&#x6210;&#x672C;&#xFF1A;&#x5373;&#x5728;&#x91D1;&#x878D;&#x5E02;&#x573A;&#x4E2D;&#x98CE;&#x9669;&#x76F8;&#x5339;&#x914D;&#x7684;&#x6295;&#x8D44;&#x7B56;&#x7565;&#x53EF;&#x83B7;&#x5F97;&#x7684;&#x9884;&#x671F;&#x56DE;&#x62A5;&#x7387;&#x3002;</p>
</div>
<div class="sect2">
<h3 id="_7_1_1_a_simple_model_with_fee_based_rewards">7.1.1   A Simple Model with Fee-Based Rewards&#xFF08;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x8D39;&#x7528;&#x5956;&#x52B1;&#x7684;&#x7B80;&#x5355;&#x6A21;&#x578B;&#xFF09;</h3>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>We next outline a parsimonious model in which rewards for validation activity are paid entirely in transaction fees generated by retail transactions rather than in newly minted tokens [103]. This model abstracts away from many empirically-relevant details to focus on the main mechanism of token valuation.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6982;&#x8FF0;&#x4E00;&#x4E2A;&#x8282;&#x4FED;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x9A8C;&#x8BC1;&#x6D3B;&#x52A8;&#x7684;&#x5956;&#x52B1;&#x5B8C;&#x5168;&#x4EE5;&#x96F6;&#x6563;&#x4EA4;&#x6613;&#x4EA7;&#x751F;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x652F;&#x4ED8;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EE5;&#x65B0;&#x94F8;&#x9020;&#x7684;&#x4EE3;&#x5E01;&#x652F;&#x4ED8;[103]&#x3002;&#x8BE5;&#x6A21;&#x578B;&#x662F;&#x4ECE;&#x8BB8;&#x591A;&#x7ECF;&#x9A8C;&#x76F8;&#x5173;&#x7684;&#x7EC6;&#x8282;&#x4E2D;&#x62BD;&#x8C61;&#x800C;&#x6765;&#xFF0C;&#x91CD;&#x70B9;&#x7814;&#x7A76;&#x4E86;&#x4EE3;&#x5E01;&#x4F30;&#x503C;&#x7684;&#x4E3B;&#x8981;&#x673A;&#x5236;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Consider a payment network. Suppose that in each period, the network processes retail transactions in the amount of \(Y_t\)&#xFF0C;measured in the &#xFB01;at currency, &#x201C;dollars.&#x201D; Assume that the aggregate float of tokens is fixed, and without loss of generality equal to one. Let \(p_t\) denote the equilibrium price of the tokens in terms of the fiat currency. Assume that the network is in a stationary growth regime: the volume of transactions is expected to grow at a constant rate \(g_Y\), so that
 \(\mathbb{E}_t [Y_{t+s}] = Y_t (1+g_Y)^s\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#xFF0C;&#x5047;&#x5982;&#x5728;<strong>&#x6BCF;&#x4E2A;&#x65F6;&#x671F;</strong>&#xFF0C;&#x7F51;&#x7EDC;&#x5904;&#x7406;&#x96F6;&#x552E;&#x4EA4;&#x6613;&#x7684;<strong>&#x4EA4;&#x6613;&#x603B;&#x989D;</strong>&#x4E3A;\(Y_t\)&#xFF0C;&#x8BE5;&#x4EA4;&#x6613;&#x603B;&#x989D;&#x4EE5;&#x6CD5;&#x5E01;&#x201C;&#x7F8E;&#x5143;&#x201D;&#x8BA1;&#x91CF;&#x3002;&#x5047;&#x8BBE;&#x4EE3;&#x5E01;&#x7684;&#x603B;&#x6D41;&#x901A;&#x91CF;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x5047;&#x8BBE;&#xFF08;&#x4E0D;&#x5931;&#x4E00;&#x822C;&#x6027;&#xFF09;&#x5176;&#x7B49;&#x4E8E;1&#x3002;&#x6211;&#x4EEC;&#x7528; \(p_t\) &#x8868;&#x793A;&#x4EE3;&#x5E01;&#x5BF9;&#x7B49;&#x7684;<strong>&#x6CD5;&#x5E01;&#x4EF7;&#x683C;</strong>&#x3002;&#x5047;&#x8BBE;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#x5904;&#x4E8E;&#x5E73;&#x7A33;&#x589E;&#x957F;&#x72B6;&#x6001;&#xFF1A;<strong>&#x4EA4;&#x6613;&#x91CF;&#x9884;&#x671F;&#x589E;&#x957F;&#x7387;</strong>&#x6052;&#x5B9A;&#x4E3A; \(g_Y\)&#xFF0C;&#x5219;&#x6709;&#xFF1A;
\(\mathbb{E}_t [Y_{t+s}] = Y_t (1+g_Y)^s\)</p>
</div>
<div class="paragraph">
<p><em>&#xFF08;\(\mathbb{E}_t[Y_{t+s}]\)&#x2014;&#x2014;s&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#x7684;&#x4EA4;&#x6613;&#x603B;&#x989D;&#x5747;&#x503C;&#xFF1B;\(\mathbb{E}[*]\)&#x4E3A;&#x968F;&#x673A;&#x8FC7;&#x7A0B;&#x7684;&#x5747;&#x503C;&#x51FD;&#x6570;&#xFF09;</em></p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>In this model we do not distinguish between block proposal and block validation functions, and refer to block proposers and block validators simply as &#x201C;validators.&#x201D; We assume that the protocol for transactions is such that, whenever transactions take place, some tokens must be transferred to the validators as rewards for their activities, and, importantly, individual validators collect their pro-rata share of the total rewards, in proportion to their token stake. The latter assumption rules out individual strategies like selfish mining, which may distort the allocation of rewards among validators in relation to their individual token balances. We assume that the aggregate amount of fees generated by the network grows at the same long-run rate as the aggregate transaction volume (the ratio of the two series is a stationary process). To simplify the derivations in our model, we further restrict aggregate fees to be a constant multiple of the transaction volume &#x2013; thus, validators receive fees in the collective amount of \(cY_t\) dollars per period (actual rewards are in tokens, which validators sell to consumers in exchange for dollars). We should note that this assumption applies to the total volume of fees, rather than the fee structure for individual transactions. Our assumption of aggregate fee dynamics is consistent with multiple alternative fee schedules, and does not mean that Unit-e must necessarily adopt transaction fees that are a fixed fraction of transaction value; we are still evaluating different design choices. In particular, we discuss the tradeoffs between user-determined transaction fees and algorithmic transaction fees in Section 7.3 below.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x533A;&#x5206;&#x51FA;&#x5757;&#x8005;&#x548C;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x628A;&#x51FA;&#x5757;&#x8005;&#x548C;&#x9A8C;&#x8BC1;&#x8005;&#x7EDF;&#x79F0;&#x4E3A;&#x201C;&#x9A8C;&#x8BC1;&#x8005;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4EA4;&#x6613;&#x534F;&#x8BAE;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4EA7;&#x751F;&#x4EA4;&#x6613;&#xFF0C;&#x4E00;&#x4E9B;&#x4EE3;&#x5E01;&#x5FC5;&#x987B;&#x8F6C;&#x79FB;&#x7ED9;&#x9A8C;&#x8BC1;&#x8005;&#x4F5C;&#x4E3A;&#x4ED6;&#x4EEC;&#x53C2;&#x4E0E;&#x7F51;&#x7EDC;&#x6D3B;&#x52A8;&#x7684;&#x5956;&#x52B1;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4E2A;&#x4EBA;&#x9A8C;&#x8BC1;&#x8005;&#x662F;&#x6309;&#x7167;&#x4ED6;&#x4EEC;&#x4EE3;&#x5E01;&#x6743;&#x76CA;&#x7684;&#x5360;&#x6BD4;&#x6765;&#x83B7;&#x53D6;&#x4ED6;&#x4EEC;&#x5728;&#x603B;&#x5956;&#x52B1;&#x4E2D;&#x5360;&#x6709;&#x7684;&#x6BD4;&#x4F8B;&#x3002;&#x540E;&#x4E00;&#x79CD;&#x5047;&#x8BBE;&#x6392;&#x9664;&#x4E86;&#x50CF;&#x79C1;&#x81EA;&#x6316;&#x77FF;&#x8FD9;&#x6837;&#x7684;&#x4E2A;&#x4EBA;&#x7B56;&#x7565;&#xFF0C;&#x79C1;&#x81EA;&#x6316;&#x77FF;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x8D77;&#x9A8C;&#x8BC1;&#x8005;&#x4E4B;&#x95F4;&#x4E0E;&#x5176;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x76F8;&#x5173;&#x7684;&#x5956;&#x52B1;&#x5206;&#x914D;&#x7684;&#x5931;&#x771F;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4EA7;&#x751F;&#x7684;&#x603B;&#x8D39;&#x7528;&#x4EE5;&#x4E0E;&#x4EA4;&#x6613;&#x603B;&#x91CF;&#x76F8;&#x540C;&#x7684;&#x957F;&#x671F;&#x589E;&#x957F;&#x7387;&#x589E;&#x957F;&#xFF08;&#x4E24;&#x4E2A;&#x7CFB;&#x5217;&#x7684;&#x6BD4;&#x7387;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF09;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x6211;&#x4EEC;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x63A8;&#x5BFC;&#xFF0C;&#x6211;&#x4EEC;&#x8FDB;&#x4E00;&#x6B65;&#x5C06;&#x603B;&#x8D39;&#x7528;&#x9650;&#x5236;&#x4E3A;&#x4EA4;&#x6613;&#x91CF;&#x7684;&#x6052;&#x5B9A;&#x500D;&#x6570;&#x2014;&#x2014;&#x5982;&#x6B64;&#xFF0C;&#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#x9A8C;&#x8BC1;&#x8005;&#x83B7;&#x53D6;&#x7684;&#x8D39;&#x7528;&#x603B;&#x989D;&#x5C31;&#x662F;&#xFF08;\( cY_t \)&#xFF09;&#x7F8E;&#x5143;&#xFF08;&#x5B9E;&#x9645;&#x5956;&#x52B1;&#x662F;&#x4EE5;&#x4EE3;&#x5E01;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x4EA4;&#x6613;&#x6240;&#x5356;&#x7ED9;&#x6D88;&#x8D39;&#x8005;&#x6362;&#x53D6;&#x7F8E;&#x5143;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E2A;&#x5047;&#x8BBE;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x8D39;&#x7528;&#x7684;&#x603B;&#x989D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E2A;&#x4EBA;&#x4EA4;&#x6613;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x8D39;&#x7528;&#x7ED3;&#x6784;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x603B;&#x8D39;&#x7528;&#x52A8;&#x6001;&#x7684;&#x5047;&#x8BBE;&#x4E0E;&#x591A;&#x91CD;&#x5907;&#x9009;&#x8D39;&#x7528;&#x8868;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740; Unit-e &#x5FC5;&#x987B;&#x8981;&#x91C7;&#x7528;&#x4E00;&#x4E2A;&#x4E0E;&#x4EA4;&#x6613;&#x503C;&#x56FA;&#x5B9A;&#x6BD4;&#x4F8B;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF1B;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x5728;&#x8BC4;&#x4F30;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;&#x3002;&#x5C24;&#x5176;&#x662F;&#xFF0C;&#x5728;&#x4E0B;&#x9762;&#x7684;7.3&#x8282;&#x4E2D;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x5728;&#x786E;&#x5B9A;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x7B97;&#x6CD5;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4E4B;&#x95F4;&#x7684;&#x6743;&#x8861;&#x53D6;&#x820D;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>We assume that validators have unrestricted access to financial markets and behave competitively: they take market prices, and, importantly, the design of the payment network, as exogenous and not a&#xFB00;ected by their individual actions. Also, we assume that the risk premium associated with a &#xFB01;nancial claim paying \(Y_t\) dollars per period is constant and equal to \(&#x3BB;_Y\) (in equilibrium, this determines the opportunity cost of capital associated with validation activity). Finally, we also assume that there are no physical costs associated with block validation activities.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x9A8C;&#x8BC1;&#x8005;&#x4EEC;&#x80FD;&#x591F;&#x4E0D;&#x53D7;&#x9650;&#x5236;&#x5730;&#x8FDB;&#x5165;&#x91D1;&#x878D;&#x5E02;&#x573A;&#xFF0C;&#x5E76;&#x8868;&#x73B0;&#x51FA;&#x7ADE;&#x4E89;&#x6027;&#xFF1A;&#x4ED6;&#x4EEC;&#x5C06;&#x5E02;&#x573A;&#x4EF7;&#x683C;&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#x8BBE;&#x8BA1;&#xFF0C;&#x89C6;&#x4E3A;&#x4E00;&#x79CD;&#x5916;&#x56E0;&#xFF0C;&#x662F;&#x4E0D;&#x4F1A;&#x88AB;&#x4ED6;&#x4EEC;&#x7684;&#x4E2A;&#x4EBA;&#x884C;&#x4E3A;&#x6240;&#x5F71;&#x54CD;&#x7684;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#xFF0C;&#x4E0E;&#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#x652F;&#x4ED8; \(Y_t\) &#x7F8E;&#x5143;&#x7684;&#x91D1;&#x878D;&#x503A;&#x6743;&#x76F8;&#x5173;&#x8054;&#x7684;<strong>&#x98CE;&#x9669;&#x6EA2;&#x4EF7;</strong>&#x662F;&#x6052;&#x5B9A;&#x7684;&#xFF0C;&#x7B49;&#x4E8E; \(&#x3BB;_Y\)&#xFF08;&#x5E73;&#x8861;&#x65F6;&#xFF0C;&#x8FD9;&#x51B3;&#x5B9A;&#x4E86;&#x53C2;&#x4E0E;&#x9A8C;&#x8BC1;&#x6D3B;&#x52A8;&#x7684;&#x8D44;&#x672C;&#x7684;&#x673A;&#x4F1A;&#x6210;&#x672C;&#xFF09;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5047;&#x8BBE;&#x6CA1;&#x6709;&#x4E0E;&#x9A8C;&#x8BC1;&#x6D3B;&#x52A8;&#x76F8;&#x5173;&#x7684;&#x7269;&#x7406;&#x6210;&#x672C;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>We look for a stationary equilibrium, in which \(&#x3D5;&#x2208;[0,1\)] tokens are held by the validators, and \(1 &#x2212; &#x3D5;\) are held by consumers for transaction purposes. We assume that validators have no use for tokens outside of their validation activity, and therefore stake their entire token balance. The equilibrium distribution of token holdings, \(&#x3D5;\), is endogenous and determined as a part of the solution.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x5BFB;&#x6C42;&#x4E00;&#x79CD;&#x9759;&#x6001;&#x5747;&#x8861;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x9762;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x6301;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;\(&#x3D5;\)&#xFF0C;\(&#x3D5;\)&#x5904;&#x4E8E;0&#x5230;1&#x4E4B;&#x95F4;&#xFF0C;&#x5373; \(&#x3D5;&#x2208;[0,1\)]&#xFF1B;&#x800C;&#x88AB;&#x4EA4;&#x6613;&#x8005;&#x6301;&#x6709;&#x7528;&#x4E8E;&#x4EA4;&#x6613;&#x7684;&#x4EE3;&#x5E01;&#x5C31;&#x662F;&#xFF08;\(1 &#x2013; &#x3D5;\)&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x9A8C;&#x8BC1;&#x8005;&#x6301;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x9664;&#x4E86;&#x9A8C;&#x8BC1;&#x6D3B;&#x52A8;&#x4E0D;&#x4F1A;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x7528;&#x9014;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x4E5F;&#x8D28;&#x62BC;&#x4E86;&#x5168;&#x90E8;&#x7684;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x3002;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4EE3;&#x5E01;&#x6301;&#x6709;&#x91CF; \(&#x3D5;\) &#x7684;&#x5747;&#x8861;&#x5206;&#x5E03;&#x662F;&#x5185;&#x751F;&#x7684;&#x3001;&#x786E;&#x5B9A;&#x7684;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>In equilibrium, the total market value of all the tokens held by the validators is \(&#x3D5;p_t\) , which is the value of a &#xFB01;nancial claim on the perpetual stream of cash flows in the amount of \(cY_t\) per period. Assuming no valuation bubbles, the market value of this cash flow stream is given by the valuation formula for a perpetuity with constant growth:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x5747;&#x8861;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x6301;&#x6709;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x5E01;&#x7684;<strong>&#x603B;&#x5E02;&#x503C;</strong>&#x4E3A; \(&#x3D5;p_t\)  &#xFF0C;&#x8FD9;&#x662F;&#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#x4EE5; \(cY_t\) &#x7F8E;&#x5143;&#x8BA1;&#x7B97;&#x7684;<strong>&#x6C38;&#x7EED;&#x73B0;&#x91D1;&#x6D41;&#x91D1;&#x878D;&#x503A;&#x6743;</strong>&#x7684;&#x4EF7;&#x503C;&#x3002;&#x5047;&#x8BBE;&#x6CA1;&#x6709;&#x9A8C;&#x8BC1;&#x6CE1;&#x6CAB;&#xFF0C;&#x8FD9;&#x7B14;&#x73B0;&#x91D1;&#x6D41;&#x6D41;&#x901A;&#x7684;&#x5E02;&#x573A;&#x4EF7;&#x503C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<strong>&#x6301;&#x7EED;&#x589E;&#x957F;&#x578B;&#x6C38;&#x7EED;&#x5E74;&#x91D1;</strong>&#xFF08;&#x6307;&#x5728;&#x65E0;&#x9650;&#x671F;&#x5185;&#xFF0C;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x76F8;&#x540C;&#x3001;&#x4E0D;&#x95F4;&#x65AD;&#x3001;&#x91D1;&#x989D;&#x4E0D;&#x76F8;&#x7B49;&#x4F46;&#x6BCF;&#x671F;&#x589E;&#x957F;&#x7387;&#x76F8;&#x7B49;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x73B0;&#x91D1;&#x6D41;&#xFF09;&#x7684;&#x4F30;&#x503C;&#x516C;&#x5F0F;&#x7ED9;&#x51FA;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ p_t \phi =
\ \lim_{T\to \infty} [\sum_{s=1}^T \frac {cY_t(1 + g_Y)^s} {(1 + &#x3BB;_Y)^s}]
\ = \frac {cY_t} {&#x3BB;_Y - g_Y }
\ \ \ \ \ \ \ \  \ \ \ \ \  \ (7.1)
\]</p>
</div>
<div class="ulist">
<ul>
<li>
<p>\(p_t &#x3D5;\) &#x2014;&#x2014;&#x6301;&#x7EED;&#x589E;&#x957F;&#x578B;&#x6C38;&#x7EED;&#x5E74;&#x91D1;&#xFF1B;</p>
</li>
<li>
<p>\(p_t\) &#x2014;&#x2014; &#x4EE3;&#x5E01;&#x5BF9;&#x5E94;&#x7684;&#x6CD5;&#x5E01;&#x4EF7;&#x683C;&#xFF1B;</p>
</li>
<li>
<p>\(&#x3D5;\) &#x2014;&#x2014; &#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x4EE3;&#x5E01;&#x6301;&#x6709;&#x91CF;&#xFF1B;</p>
</li>
<li>
<p>\(g_Y\) &#x2014;&#x2014; &#x4EA4;&#x6613;&#x91CF;&#x9884;&#x671F;&#x589E;&#x957F;&#x7387;&#xFF1B;</p>
</li>
<li>
<p>\(&#x3BB;_Y\) &#x2014;&#x2014; &#x98CE;&#x9669;&#x6EA2;&#x4EF7;&#xFF0C;&#x5DF2;&#x786E;&#x5B9A;&#x7684;&#x6295;&#x8D44;&#x6536;&#x76CA;&#x7387;&#x4E0E;&#x5192;&#x98CE;&#x9669;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x6536;&#x76CA;&#x7387;&#x4E4B;&#x5DEE;&#xFF1B;</p>
</li>
<li>
<p>\(cY_t\) &#x2014;&#x2014; &#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#x9A8C;&#x8BC1;&#x8005;&#x83B7;&#x53D6;&#x7684;&#x8D39;&#x7528;&#x603B;&#x989D;&#xFF0C;\(Y_t\)&#x4E3A;&#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#x7684;&#x4EA4;&#x6613;&#x603B;&#x989D;&#xFF0C;\(c\)&#x4E3A;&#x7CFB;&#x6570;&#x3002;</p>
</li>
</ul>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>To pin down the value of the tokens, we need to make an assumption about consumer&#x2019;s demand for tokens. In a market with in&#xFB01;nite token velocity, consumers would hold no balances, which would imply that in equilibrium \(&#x3D5;=1\) and \(p_t=(cY_t)/(&#x3BB;_Y-g_Y)\). More generally, if consumers hold balances equal to k times the transaction volume per period, then \(p_t(1-&#x3D5;_t)=kY_t\)  , and therefore the equilibrium token value is</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4E3A;&#x4E86;&#x786E;&#x5B9A;&#x4EE3;&#x5E01;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x4EE3;&#x5E01;&#x9700;&#x6C42;&#x505A;&#x4E00;&#x4E2A;&#x5047;&#x8BBE;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x6709;&#x7740;&#x65E0;&#x9650;&#x7684;&#x4EE3;&#x5E01;&#x5468;&#x8F6C;&#x7387;&#x7684;&#x5E02;&#x573A;&#x4E2D;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x53EF;&#x80FD;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4F59;&#x989D;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5728;&#x5E73;&#x8861;&#x72B6;&#x6001;&#xFF0C;\(&#x3D5;=1\) &#x800C; \(p_t=(cY_t)/(&#x3BB;_Y - g_Y)\)&#x3002;&#x66F4;&#x666E;&#x904D;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6D88;&#x8D39;&#x8005;&#x6301;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x7B49;&#x4E8E;&#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#x4EA4;&#x6613;&#x91CF;&#x7684; k &#x500D;&#xFF0C;&#x90A3;&#x4E48;  \(p_t(1-&#x3D5;_t)=kY_t\)&#xFF0C;&#x56E0;&#x6B64;&#x4EE3;&#x5E01;&#x7684;&#x5747;&#x8861;&#x4EF7;&#x503C;&#x662F;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ p_t = (k + \frac {c} {&#x3BB;_Y - g_Y})Y_t
\ \ \ \ \ \  \ \ \ \ \ \ \ &#xFF08;7.2&#xFF09;
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Note that in the absence of an explicit description of demand for token balances, \((cY_t )/(&#x3BB;_Y - g_Y)\) serves as a lower bound on the token value.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x7F3A;&#x5C11;&#x5BF9;&#x6D88;&#x8D39;&#x8005;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x9700;&#x6C42;&#x7684;&#x660E;&#x786E;&#x63CF;&#x8FF0;&#x4E0B;&#xFF0C;\((cY_t )/(&#x3BB;_Y - g_Y)\) &#x5145;&#x5F53;&#x4E86;&#x4EE3;&#x5E01;&#x4EF7;&#x503C;&#x7684;&#x4E0B;&#x9650;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The equilibrium value of the tokens in (7.2) consists of two terms. The &#xFB01;rst term, \(kY_t\), re&#xFB02;ects consumer demand for holding token balances. The value of this term depends on \(k\), which is inversely related to the equilibrium token velocity. It is important to acknowledge that token velocity is an equilibrium outcome, related to a number of properties of the payment network and the broader market. Wider adoption of the tokens could raise demand for token balances, while e&#xFB03;cient channels for transactions between tokens and &#xFB01;at currency would enable consumers to support the desired volume of transactions with lower token balances and result in higher token velocity.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x516C;&#x5F0F;&#xFF08;7.2&#xFF09;&#x4E2D;&#x7684;&#x4EE3;&#x5E01;&#x5747;&#x8861;&#x4EF7;&#x503C;&#x7531;&#x4E24;&#x9879;&#x7EC4;&#x6210;&#x3002;&#x7B2C;&#x4E00;&#x9879;&#xFF0C;\(kY_t\)&#xFF0C;&#x53CD;&#x5E94;&#x4E86;&#x6D88;&#x8D39;&#x8005;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x7684;&#x9700;&#x6C42;&#x3002;&#x8FD9;&#x4E00;&#x9879;&#x7684;&#x503C;&#x53D6;&#x51B3;&#x4E8E; \(k\)&#xFF0C;&#x4E0E;&#x5747;&#x8861;&#x4EE3;&#x5E01;&#x5468;&#x8F6C;&#x7387;&#x6210;&#x9006;&#x76F8;&#x5173;&#x3002;&#x5FC5;&#x987B;&#x627F;&#x8BA4;&#xFF0C;&#x4EE3;&#x5E01;&#x5468;&#x8F6C;&#x7387;&#x662F;&#x4E00;&#x79CD;&#x5747;&#x8861;&#x7ED3;&#x679C;&#xFF0C;&#x4E0E;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#x548C;&#x66F4;&#x5E7F;&#x6CDB;&#x5E02;&#x573A;&#x7684;&#x8BB8;&#x591A;&#x7279;&#x6027;&#x6709;&#x5173;&#x3002;&#x4EE3;&#x5E01;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x91C7;&#x7528;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x5BF9;&#x4EE3;&#x5E01;&#x6301;&#x6709;&#x4F59;&#x989D;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x800C;&#x4EE3;&#x5E01;&#x548C;&#x6CD5;&#x5E01;&#x4E4B;&#x95F4;&#x6709;&#x6548;&#x7684;&#x5151;&#x6362;&#x6E20;&#x9053;&#x5C06;&#x4F1A;&#x4FC3;&#x4F7F;&#x6D88;&#x8D39;&#x8005;&#x63D0;&#x9AD8;&#x5BF9;&#x4EA4;&#x6613;&#x91CF;&#x7684;&#x6E34;&#x671B;&#xFF0C;&#x800C;&#x4FDD;&#x6301;&#x8F83;&#x4F4E;&#x7684;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x4EE3;&#x5E01;&#x7684;&#x5468;&#x8F6C;&#x7387;&#x4F1A;&#x66F4;&#x9AD8;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The relation between token value and token velocity is commonly invoked when discussing the valuation of cryptocurrencies. While token velocity and equilibrium token value are certainly related in equilibrium, the relation between the two, like its analog in traditional monetary economics, is not a true structural relation and it does not provide a reliable anchor for token valuation.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x8BA8;&#x8BBA;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x4F30;&#x503C;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x63F4;&#x5F15;&#x4EE3;&#x5E01;&#x4EF7;&#x503C;&#x548C;&#x4EE3;&#x5E01;&#x5468;&#x8F6C;&#x7387;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x867D;&#x7136;&#x4EE3;&#x5E01;&#x5468;&#x8F6C;&#x7387;&#x548C;&#x4EE3;&#x5E01;&#x5747;&#x8861;&#x4EF7;&#x503C;&#x5728;&#x5747;&#x8861;&#x72B6;&#x6001;&#x4E0B;&#x5FC5;&#x7136;&#x76F8;&#x5173;&#xFF0C;&#x4F46;&#x662F;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5C31;&#x8DDF;&#x5728;&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x4E2D;&#x7684;&#x7C7B;&#x4F3C;&#x7269;&#x4E00;&#x6837;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x7ED3;&#x6784;&#x5173;&#x7CFB;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x591F;&#x4E3A;&#x4EE3;&#x5E01;&#x4F30;&#x503C;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x951A;&#x5B9A;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The second term in the valuation equation (7.2), \((cY_t )/(&#x3BB;_Y-g_Y )\), re&#xFB02;ects the demand for tokens from validators. This term is proportional to the overall volume of retail transactions, \(Y_t\)  , and to the rate at which fees are charged for transactions. All else equal, broader adoption and utilization of the payment system (higher \(Y_t\)) results in higher value of the tokens. Importantly, the above equation does not suggest that token value is increasing in the level of fees. Our analysis here focuses on a single stationary equilibrium and does not explicitly describe how the systems responds to changes in parameters: <strong>higher fee levels would eventually lead to lower transaction volume</strong>.
<sup class="footnote">[<a id="_footnoteref_1" class="footnote" href="#_footnote_1" title="View footnote.">1</a>]</sup></p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#xFF08;7.2&#xFF09;&#x7684;&#x4F30;&#x503C;&#x65B9;&#x7A0B;&#x4E2D;&#x7684;&#x7B2C;&#x4E8C;&#x9879;&#xFF0C;\((cY_t )/(&#x3BB;_Y - g_Y)\)&#xFF0C;&#x53CD;&#x5E94;&#x4E86;&#x9A8C;&#x8BC1;&#x8005;&#x5BF9;&#x4EE3;&#x5E01;&#x7684;&#x9700;&#x6C42;&#x3002;&#x8FD9;&#x4E00;&#x9879;&#x4E0E;&#x603B;&#x4F53;&#x7684;&#x96F6;&#x552E;&#x4EA4;&#x6613;&#x989D; Y_t  &#x548C;&#x4EA4;&#x6613;&#x6536;&#x8D39;&#x7387;&#x6210;&#x6B63;&#x6BD4;&#x3002;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x4E00;&#x5207;&#x5E73;&#x7A33;&#x65F6;&#xFF0C;<strong><strong>&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x91C7;&#x7528;&#x548C;&#x4F7F;&#x7528;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#xFF08;&#x66F4;&#x9AD8;&#x7684; Y_t&#xFF09;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x9AD8;&#x7684;&#x4EE3;&#x5E01;&#x4EF7;&#x503C;</strong></strong>&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x4E0A;&#x8FF0;&#x7B49;&#x5F0F;&#x5E76;&#x6CA1;&#x6709;&#x8868;&#x660E;&#x4EE3;&#x5E01;&#x4EF7;&#x503C;&#x5728;&#x6536;&#x8D39;&#x6C34;&#x5E73;&#x4E0A;&#x7684;&#x589E;&#x957F;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x7684;&#x5206;&#x6790;&#x4FA7;&#x91CD;&#x4E8E;&#x5355;&#x4E00;&#x7684;&#x7A33;&#x5B9A;&#x5747;&#x8861;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x63CF;&#x8FF0;&#x7CFB;&#x7EDF;&#x5982;&#x4F55;&#x54CD;&#x5E94;&#x6536;&#x8D39;&#x6C34;&#x5E73;&#x53C2;&#x6570;&#x7684;&#x53D8;&#x5316;&#xFF1A;<strong><strong>&#x8F83;&#x9AD8;&#x7684;&#x8D39;&#x7528;&#x6C34;&#x5E73;&#x6700;&#x7EC8;&#x4F1A;&#x5BFC;&#x81F4;&#x8F83;&#x4F4E;&#x7684;&#x4EA4;&#x6613;&#x91CF;</strong></strong>&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Our analysis in this section also relies critically on the assumption of competitive behavior by the network participants. To what extent this assumption o&#xFB00;ers a good approximation of agent behavior in this environment depends on individual opportunities and incentives to engage in strategic behavior. Ultimately, individual incentives and token valuation are closely linked in PoS systems, and must be analyzed jointly. Such analysis is beyond the scope of this chapter.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x5728;&#x672C;&#x8282;&#x4E2D;&#x7684;&#x5206;&#x6790;&#x4E5F;&#x975E;&#x5E38;&#x4F9D;&#x8D56;&#x4E8E;&#x5BF9;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x7ADE;&#x4E89;&#x884C;&#x4E3A;&#x505A;&#x7684;&#x5047;&#x8BBE;&#x3002;&#x8FD9;&#x79CD;&#x5047;&#x8BBE;&#x80FD;&#x591F;&#x5728;&#x591A;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x5F88;&#x597D;&#x5730;&#x8FD1;&#x4F3C;&#x8FD9;&#x79CD;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x4EE3;&#x7406;&#x884C;&#x4E3A;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4ECE;&#x4E8B;&#x8FD9;&#x79CD;&#x6218;&#x7565;&#x884C;&#x4E3A;&#x7684;&#x4E2A;&#x4EBA;&#x673A;&#x4F1A;&#x4E0E;&#x6FC0;&#x52B1;&#x63AA;&#x65BD;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x4E2A;&#x4EBA;&#x6FC0;&#x52B1;&#x548C;&#x4EE3;&#x5E01;&#x4F30;&#x503C;&#x5728;PoS&#x7CFB;&#x7EDF;&#x4E2D;&#x7D27;&#x5BC6;&#x76F8;&#x8FDE;&#xFF0C;&#x5FC5;&#x987B;&#x5171;&#x540C;&#x5206;&#x6790;&#x3002;&#x8FD9;&#x79CD;&#x5206;&#x6790;&#x5DF2;&#x8D85;&#x51FA;&#x4E86;&#x672C;&#x7AE0;&#x7684;&#x8303;&#x56F4;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="_7_1_2_an_extended_model_with_increasing_token_supply">7.1.2 An Extended Model with Increasing Token Supply&#xFF08;&#x589E;&#x52A0;&#x4EE3;&#x5E01;&#x4F9B;&#x5E94;&#x7684;&#x6269;&#x5C55;&#x6A21;&#x578B;&#xFF09;</h3>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Here we extend the valuation model of the previous section to allow for increasing token supply. In this model, validators are rewarded in newly minted tokens in addition to the fees collected from consumer transactions. For tractability, we formulate the extended model in continuous time.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x6269;&#x5C55;&#x4E86;&#x4E0A;&#x4E00;&#x8282;&#x91CC;&#x7684;&#x4F30;&#x503C;&#x6A21;&#x578B;&#xFF0C;&#x5141;&#x8BB8;&#x589E;&#x52A0;&#x4EE3;&#x5E01;&#x4F9B;&#x5E94;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x9664;&#x4E86;&#x4ECE;&#x6D88;&#x8D39;&#x8005;&#x4EA4;&#x6613;&#x4E2D;&#x6536;&#x53D6;&#x7684;&#x8D39;&#x7528;&#x5916;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x8FD8;&#x5C06;&#x83B7;&#x5F97;&#x65B0;&#x94F8;&#x9020;&#x7684;&#x4EE3;&#x5E01;&#x5956;&#x52B1;&#x3002;&#x4E3A;&#x4E86;&#x6613;&#x4E8E;&#x5904;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;&#x8FDE;&#x7EED;&#x65F6;&#x95F4;&#x7684;&#x6269;&#x5C55;&#x6A21;&#x578B;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>We now allow the transaction volume growth parameter to vary in time, and denote it by \(g_Y(t)\). We also introduce randomness into the evolution of the transaction volume \(Y_t\), as shown in the following differential equation:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5141;&#x8BB8;&#x4EA4;&#x6613;&#x91CF;&#x589E;&#x957F;&#x53C2;&#x6570;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#xFF0C;&#x5E76;&#x7528; \(g_Y(t)\) &#x8868;&#x793A;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x5C06;&#x5728;&#x4EA4;&#x6613;&#x91CF; \(Y_t\) &#x7684;&#x6F14;&#x53D8;&#x8FC7;&#x7A0B;&#x5F15;&#x5165;&#x968F;&#x673A;&#x6027;&#xFF0C;&#x5982;&#x4E0B;&#x5FAE;&#x5206;&#x65B9;&#x7A0B;&#x6240;&#x793A;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\frac {dY_t} {Y_t} = g_Y(t)dt+ \sigma (t)dZ_t
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>where \(g_Y(t)\) and \(\sigma(t)\) are bounded continuous functions of time, and \(Z_t\) is a <strong>Brownian motion</strong>.
<sup class="footnote">[<a id="_footnoteref_2" class="footnote" href="#_footnote_2" title="View footnote.">2</a>]</sup>
 Here \(Z_t\) is a simple model for the randomness in the system, and \(&#x3C3;(t)\) represents the instantaneous volatility of growth in transaction volume. Investors require compensation for being exposed to \(dZ_t\) shocks based on the comparable investment opportunities in &#xFB01;nancial markets, which we assume to be &#x3B7; units of expected excess returns per unit of risk. \(&#x3B7;\) is known as the market price of risk, and we take it to be constant here, for simplicity. Then, under the risk-neutral valuation measure  \(Q\) , the transaction volume follows</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x91CC;&#x7684; \(g_Y(t)\) &#x548C; \(\sigma(t)\) &#x662F;&#x5173;&#x4E8E;&#x65F6;&#x95F4;&#x7684;&#x6709;&#x754C;&#x8FDE;&#x7EED;&#x51FD;&#x6570;&#xFF0C;&#x800C; \(Z_t\) &#x662F;&#x4E00;&#x79CD;<strong>&#x5E03;&#x6717;&#x8FD0;&#x52A8;</strong>&#x3002;&#x8FD9;&#x91CC; \(Z_t\) &#x662F;&#x7CFB;&#x7EDF;&#x968F;&#x673A;&#x6027;&#x7684;&#x7B80;&#x5355;&#x6A21;&#x578B;&#xFF0C;&#x800C; \(\sigma(t)\) &#x4EE3;&#x8868;&#x4E86;&#x4EA4;&#x6613;&#x91CF;&#x589E;&#x957F;&#x7684;&#x77AC;&#x65F6;&#x6CE2;&#x52A8;&#x6027;&#x3002;&#x4F9D;&#x636E;&#x91D1;&#x878D;&#x5E02;&#x573A;&#x7684;&#x53EF;&#x6BD4;&#x6295;&#x8D44;&#x673A;&#x4F1A;&#xFF0C;&#x6295;&#x8D44;&#x8005;&#x5BF9;&#x906D;&#x53D7; \(dZ_t\) &#x51B2;&#x51FB;&#x8981;&#x6C42;&#x8865;&#x507F;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x5355;&#x4F4D;&#x98CE;&#x9669;&#x7684;&#x9884;&#x671F;&#x8D85;&#x989D;&#x56DE;&#x62A5;&#x662F; \(\eta\) &#x4E2A;&#x5355;&#x4F4D;&#xFF0C;&#x4E3A;&#x4E86;&#x7B80;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x8BBE;&#x4E3A;&#x5E38;&#x6570;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5728;&#x98CE;&#x9669;&#x4E2D;&#x6027;&#x5B9A;&#x4EF7;&#x6307;&#x6807; \(Q\) &#x4E0B;&#xFF0C;&#x4EA4;&#x6613;&#x91CF;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x65B9;&#x7A0B;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\frac {dY_t} {Y_t} = g_Y^Q (t) dt + \sigma (t) dZ_t^Q
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Where</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5176;&#x4E2D;</p>
</div>
<div class="paragraph">
<p>\[
\ g_Y^Q (t) = g_Y (t) - \eta &#x3C3;(t)
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>and \(Z_t^Q\) is a Brownian motion under measure \(Q\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x800C; \(Z_t^Q\) &#x662F;&#x6307;&#x6807; \(Q\) &#x4E0B;&#x7684;&#x5E03;&#x6717;&#x8FD0;&#x52A8;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>As above, \(p_t\) denotes the total value of tokens at time \(t\) and validators hold fraction \(&#x3D5;_t\) of all tokens. The market clearing condition requires that validators and consumers collectively hold all tokens, and thus</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;\(p_t\) &#x4EE3;&#x8868;&#x4E86;&#x65F6;&#x95F4; \(t\) &#x65F6;&#x7684;&#x4EE3;&#x5E01;&#x603B;&#x4EF7;&#x503C;&#xFF0C;&#x9A8C;&#x8BC1;&#x4EBA;&#x6301;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x4EFD;&#x989D; \(&#x3D5;_t\)  &#x3002;&#x5E02;&#x573A;&#x6E05;&#x7B97;&#x6761;&#x4EF6;&#x8981;&#x6C42;&#x9A8C;&#x8BC1;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x5171;&#x540C;&#x6301;&#x6709;&#x4E86;&#x6240;&#x6709;&#x4EE3;&#x5E01;&#xFF0C;&#x56E0;&#x6B64;&#x6709;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ &#x3D5;_t p_t = p_t - kY_t
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>where \(k\) is a consumer demand parameter, which we again assume to be constant. Thus,</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5176;&#x4E2D; \(k\) &#x662F;&#x6D88;&#x8D39;&#x8005;&#x9700;&#x6C42;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x5047;&#x8BBE;&#x5176;&#x4E3A;&#x5E38;&#x6570;&#x3002;&#x56E0;&#x6B64;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ &#x3D5;_t = 1 - k \frac {Y_t} {p_t}
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>We assume that token supply grows deterministically over time. Specifically, we assume that new tokens are issued at (bounded) rate \(r(t)\). In expectation, under the risk-neutral valuation measure, validators earn the risk-free rate of return, which we assume to be constant and denote it by \(&#x3BB;_f\). Thus, we obtain the valuation equation:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4EE3;&#x5E01;&#x4F9B;&#x5E94;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x6709;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x589E;&#x957F;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x65B0;&#x7684;&#x4EE3;&#x5E01;&#x4EE5;&#xFF08;&#x6709;&#x9650;&#x7684;&#xFF09;&#x901F;&#x7387; \(r(t)\) &#x53D1;&#x884C;&#x3002;&#x671F;&#x671B;&#x7740;&#xFF0C;&#x5728;&#x98CE;&#x9669;&#x4E2D;&#x6027;&#x5B9A;&#x4EF7;&#x6307;&#x6807;&#x4E0B;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x8D5A;&#x53D6;&#x65E0;&#x98CE;&#x9669;&#x56DE;&#x62A5;&#x7387;&#xFF0C;&#x5047;&#x8BBE;&#x4E3A;&#x5E38;&#x6570;&#xFF0C;&#x7528; \(&#x3BB;_f\) &#x8868;&#x793A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F97;&#x51FA;&#x4F30;&#x503C;&#x65B9;&#x7A0B;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ &#x3D5;<em>t p_t =
\ cY_t dt + e^{-&#x3BB;_f dt} E_t^Q [{(&#x3D5;_t + (1 - &#x3D5;_t) r(t) dt)} p</em>{t+dt}]
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>On the left-hand side, \(&#x3D5;_t p_t\) is the total market value of the tokens staked by the validators at time t. On the right-hand side, we have two terms. The first term, \(cY_t dt\), is the flow of transaction fees that accrue to the validators over the infinitesimal period \([t,t+dt)\).The second term,  \(e^{-&#x3BB;_f dt} E_t^Q [(&#x3D5;_t+(1-&#x3D5;_t) r(t) dt) p_{t + dt}\)], is the discounted expected value ( under measure \(Q\) ) of the validators&#x2019; token holdings at the end of the period.
<sup class="footnote">[<a id="_footnoteref_3" class="footnote" href="#_footnote_3" title="View footnote.">3</a>]</sup>
Then,</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x5DE6;&#x8FB9;&#xFF0C;\(&#x3D5;_t p_t\) &#x662F;&#x9A8C;&#x8BC1;&#x8005;&#x5728;&#x65F6;&#x95F4;t&#x8D28;&#x62BC;&#x7684;&#x4EE3;&#x5E01;&#x7684;&#x603B;&#x5E02;&#x503C;&#x3002;&#x5728;&#x53F3;&#x8FB9;&#xFF0C;&#x6709;&#x4E24;&#x9879;&#x3002;&#x7B2C;&#x4E00;&#x9879;&#xFF0C;\(cY_t dt\)&#xFF0C;&#x662F;&#x5728;&#x65E0;&#x9650;&#x5C0F;&#x7684;&#x65F6;&#x95F4;&#x533A;&#x95F4; \([t,t + dt)\) &#x5185;&#x79EF;&#x7D2F;&#x5230;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x6D41;&#x3002;&#x7B2C;&#x4E8C;&#x9879;&#xFF0C;\(e^{-&#x3BB;_f dt} E_t^Q [ ( &#x3D5;_t+(1-&#x3D5;_t) r(t) dt ) p_{t+dt} \)]&#xFF0C;&#x662F;&#x9A8C;&#x8BC1;&#x8005;&#x6301;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x671F;&#x7ED3;&#x675F;&#x65F6;&#x7684;&#x8D34;&#x73B0;&#x671F;&#x671B;&#x503C;&#xFF08;&#x5728;&#x6307;&#x6807; \(Q\) &#x4E0B;&#xFF09;&#x3002; &#x90A3;&#x4E48;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ E_t^Q [dp_t] =
\ &#x3BB;_f p_t dt - \frac {p_t} {p_t - kY_t} (cY_t + kY_t r(t))dt
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>We look for an equilibrium token price process p_t of the form p_t=p(t,Y_t), where p(t,Y_t) is a sufficiently smooth function of its arguments. Applying Ito&#x2019;s lemma, we obtain a PDE on the token price function:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x4EE5; \(p_t = p(t,Y_t)\) &#x7684;&#x5F62;&#x5F0F;&#x5904;&#x7406; \(p_t\) &#x6765;&#x5BFB;&#x6C42;&#x4E00;&#x4E2A;&#x5747;&#x8861;&#x4EE3;&#x5E01;&#x4EF7;&#x683C;&#xFF0C;&#x5176;&#x4E2D; \(p(t,Y_t)\) &#x662F;&#x5176;&#x53C2;&#x6570;&#x7684;&#x8DB3;&#x591F;&#x5145;&#x5206;&#x7684;&#x5149;&#x6ED1;&#x51FD;&#x6570;&#xFF08;&#x5B9A;&#x4E49;&#x57DF;&#x5185;&#x8FDE;&#x7EED;&#x53EF;&#x5BFC;&#xFF09;&#x3002;&#x5E94;&#x7528;<a href="https://en.wikipedia.org/wiki/It&#xF4;%27s_lemma" target="_blank">&#x4F0A;&#x85E4;&#x5F15;&#x7406;</a>&#xFF0C;&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x4EE3;&#x5E01;&#x4EF7;&#x683C;&#x65B9;&#x7A0B;&#x7684;&#x504F;&#x5FAE;&#x5206;&#x65B9;&#x7A0B;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\frac{\partial p}{\partial t} + \frac {\partial p} {\partial Y} g_{Y}^{Q}(t) Y + \frac {1}{2} \frac {\partial^{2} p} {\partial Y^{2}} \sigma(t)^{2} Y^{2} - \lambda_{f}  p + \frac {p} {p-k Y} (c+k r(t)) Y = 0
\quad \quad \quad \quad \quad (7.3)
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Equation (7.3) is the valuation PDE. This equation has multiple solutions, and we look for a non-negative solution without valuation bubbles. Speci&#xFB01;cally, we look for a solution with suitably bounded growth in \(Y\), and subject to a boundary condition</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x65B9;&#x7A0B;&#xFF08;7.3&#xFF09;&#x662F;&#x4F30;&#x503C;&#x504F;&#x5FAE;&#x5206;&#x65B9;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x6709;&#x591A;&#x4E2A;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x4F30;&#x503C;&#x6CE1;&#x6CAB;&#x7684;&#x975E;&#x8D1F;&#x89E3;&#x3002;&#x5177;&#x4F53;&#x5730;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x5728; \(Y\) &#x4E0A;&#x6709;&#x9002;&#x5F53;&#x8FB9;&#x754C;&#x589E;&#x957F;&#x7684;&#x89E3;&#xFF0C;&#x5E76;&#x4E14;&#x7B26;&#x5408;&#x4EE5;&#x4E0B;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ p(t,0) = 0
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>which requires that token value vanishes at zero transaction volume (recall that zero is an absorbing boundary for the transaction volume process). The above equation has a linear solution,</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x8981;&#x6C42;&#x4EE3;&#x5E01;&#x4EF7;&#x503C;&#x96F6;&#x4EA4;&#x6613;&#x91CF;&#xFF08;&#x8BB0;&#x4F4F;&#x96F6;&#x662F;&#x4EA4;&#x6613;&#x91CF;&#x8FC7;&#x7A0B;&#x7684;&#x5438;&#x6536;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#xFF09;&#x65F6;&#x6D88;&#x5931;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x7A0B;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x89E3;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ p(t,Y ) = A(t)Y
\ \ \ \ \ \ \ \ \ \ \ \ \ (7.4)
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>where the unknown function \(A(t)\) is a bounded, positive solution of the ODE:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5176;&#x4E2D;&#x672A;&#x77E5;&#x51FD;&#x6570; \(A(t)\) &#x662F;&#x4EE5;&#x4E0B;&#x5E38;&#x5FAE;&#x5206;&#x65B9;&#x7A0B;&#x7684;&#x6709;&#x754C;&#x6B63;&#x6570;&#x89E3;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ \frac {dA(t)} {dt} + g_Y^Q (t)A(t) - &#x3BB;_f A(t)
\ + \frac {A(t)} {A(t)-k} (c + k r(t)) = 0
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>In the stationary case of \(r(t) = r\), \(&#x3C3;(t) = &#x3C3;\), and  \(g_Y (t) = g_Y\), the total value of tokens \(p_t\) is a constant multiple of the transaction volume \(Y_t\):</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728; \(r(t) = r\), \(&#x3C3;(t) = &#x3C3;\), &#x548C; \(g_Y (t) = g_Y\) &#x7684;&#x9759;&#x6B62;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EE3;&#x5E01;&#x7684;&#x603B;&#x4EF7;&#x503C; \(p_t\) &#x662F;&#x4EA4;&#x6613;&#x91CF; \(Y_t\) &#x7684;&#x5E38;&#x6570;&#x500D;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ \frac {p_t} {Y_t} = A(t) = k + \frac {c+kr} {&#x3BB;_f + &#x3B7;&#x3C3; - g_Y}
\ \ \ \ \ \ \ \ \ \ \ (7.5)
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This solution describes the total value of tokens under constant growth rate in the number of outstanding tokens. Note that, \(&#x3BB;_f  + &#x3B7;&#x3C3; = &#x3BB;_Y\) , which is the expected return on the &#xFB01;nancial claim paying a cash &#xFB02;ow stream equal to the aggregate &#xFB02;ow of transaction fees, \(cY_t\). We thus recover the valuation formula (7.2) by setting the token rewards to zero, \(r = 0\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6B64;&#x65B9;&#x6848;&#x63CF;&#x8FF0;&#x4E86;&#x672A;&#x5B8C;&#x6210;&#x4EE3;&#x5E01;&#x7684;&#x5728;&#x6052;&#x5B9A;&#x589E;&#x957F;&#x7387;&#x4E0B;&#x7684;&#x4EE3;&#x5E01;&#x603B;&#x4EF7;&#x503C;&#x3002;&#x6CE8;&#x610F;&#x5230;&#xFF0C; \(&#x3BB;_f  + &#x3B7;&#x3C3; = &#x3BB;_Y\)&#xFF0C;&#x8FD9;&#x662F;&#x5728;&#x91D1;&#x878D;&#x503A;&#x6743;&#x4E0A;&#x652F;&#x4ED8;&#x7B49;&#x540C;&#x4E8E; \(cY_t\) &#x7684;&#x73B0;&#x91D1;&#x6D41;&#x83B7;&#x53D6;&#x7684;&#x9884;&#x671F;&#x6536;&#x76CA;&#xFF0C;\(cY_t\) &#x662F;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x603B;&#x989D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x4EE3;&#x5E01;&#x5956;&#x52B1;&#x8BBE;&#x7F6E;&#x6210;&#x96F6;&#xFF0C;&#x5373; \(r = 0\)&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6062;&#x590D;&#x5230;&#x4F30;&#x503C;&#x65B9;&#x7A0B;&#xFF08;7.2&#xFF09;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The above solution highlights the valuation effect of rewarding validators in newly minted tokens. In addition to collecting transaction fees, validators also collect proceeds from seignorage. Comparing with (7.2), we see that this effectively raises the &#xFB02;ow of proceeds to validators from \(c\) to \(c + kr\). The second term, \(kr\) is intuitive: transfers to validators due to seignorage are proportional to the level of token balances held by consumers. If consumers hold no token balances between transactions, any benefit validators derive from collecting rewards in newly minted tokens is completely offset by the decline in the market value of tokens in their stake.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4E0A;&#x8FF0;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7A81;&#x51FA;&#x4E86;&#x7528;&#x65B0;&#x94F8;&#x9020;&#x7684;&#x4EE3;&#x5E01;&#x5956;&#x52B1;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x4F30;&#x503C;&#x5F71;&#x54CD;&#x3002;&#x9664;&#x4E86;&#x6536;&#x53D6;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4E4B;&#x5916;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x8FD8;&#x4ECE;&#x65B0;&#x5E01;&#x94F8;&#x9020;&#x4E2D;&#x83B7;&#x53D6;&#x6536;&#x76CA;&#x3002;&#x4E0E;&#x516C;&#x5F0F;&#xFF08;7.2&#xFF09;&#x76F8;&#x6BD4;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x8FD9;&#x6709;&#x6548;&#x5730;&#x5C06;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x6536;&#x76CA;&#x6D41;&#x4ECE; \(c\) &#x589E;&#x52A0;&#x5230;&#x4E86; \((c + kr)\)&#x3002;&#x7B2C;&#x4E8C;&#x9879;&#xFF0C;\(kr\) &#x662F;&#x5F88;&#x76F4;&#x89C2;&#x7684;&#xFF1A;&#x7531;&#x4E8E;&#x65B0;&#x5E01;&#x94F8;&#x9020;&#x8F6C;&#x79FB;&#x7ED9;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x4EE3;&#x5E01;&#x4E0E;&#x6D88;&#x8D39;&#x8005;&#x6301;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x6C34;&#x5E73;&#x6210;&#x6B63;&#x6BD4;&#x3002;&#x5982;&#x679C;&#x6D88;&#x8D39;&#x8005;&#x5728;&#x4EA4;&#x6613;&#x8FC7;&#x7A0B;&#x4E2D;&#x6CA1;&#x6709;&#x4EE3;&#x5E01;&#x6301;&#x6709;&#x4F59;&#x989D;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x5728;&#x65B0;&#x5E01;&#x94F8;&#x9020;&#x4E2D;&#x6536;&#x53D6;&#x62A5;&#x916C;&#x83B7;&#x53D6;&#x7684;&#x6536;&#x76CA;&#x5C31;&#x5B8C;&#x5168;&#x88AB;&#x5176;&#x6743;&#x76CA;&#x4EE3;&#x5E01;&#x7684;&#x5E02;&#x503C;&#x4E0B;&#x964D;&#x6240;&#x62B5;&#x6D88;&#x4E86;&#x3002;</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<hr>
<div class="footnote" id="_footnote_1">
<a href="#_footnoteref_1">1</a>. The effect of transaction fees on token value is analogous to the concept of the Laffer Curve in the theory of taxation. (&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x5BF9;&#x4EE3;&#x5E01;&#x4EF7;&#x683C;&#x7684;&#x5F71;&#x54CD;&#x7C7B;&#x4F3C;&#x4E8E;&#x7A0E;&#x6536;&#x7406;&#x8BBA;&#x4E2D;&#x7684;&#x62C9;&#x83F2;&#x5C14;&#x66F2;&#x7EBF;&#x6982;&#x5FF5;&#xFF1A;&#x5BF9;&#x8FB9;&#x9645;&#x6536;&#x5165;&#x548C;&#x8D44;&#x672C;&#x51CF;&#x7A0E;&#xFF0C;&#x53EF;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x7A0E;&#x6536;&#x3002;&#x7406;&#x7531;&#x662F;&#xFF0C;&#x51CF;&#x7A0E;&#x5C06;&#x4EA7;&#x751F;&#x66F4;&#x591A;&#x8D44;&#x672C;&#xFF0C;&#x63D0;&#x9AD8;&#x4F01;&#x4E1A;&#x548C;&#x5458;&#x5DE5;&#x7684;&#x751F;&#x4EA7;&#x7387;&#xFF0C;&#x6574;&#x4F53;&#x7ECF;&#x6D4E;&#x5C06;&#x589E;&#x957F;&#x3002;)
</div>
<div class="footnote" id="_footnote_2">
<a href="#_footnoteref_2">2</a>. We implicitly assume that all elements of the model, e.g., the growth rate of  \(Y_t\)  , are properly restricted so that tokens have a &#xFB01;nite value in equilibrium.&#xFF08;&#x6211;&#x4EEC;&#x6697;&#x542B;&#x5047;&#x8BBE;&#x6A21;&#x578B;&#x7684;&#x6240;&#x6709;&#x8981;&#x7D20;&#xFF0C;&#x4F8B;&#x5982; \(Y_t\) &#x7684;&#x589E;&#x957F;&#x7387;&#xFF0C;&#x90FD;&#x88AB;&#x9002;&#x5F53;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x56E0;&#x6B64;&#x4EE3;&#x5E01;&#x5728;&#x5E73;&#x8861;&#x65F6;&#x5177;&#x6709;&#x6709;&#x9650;&#x7684;&#x4EF7;&#x503C;&#x3002;&#xFF09;
</div>
<div class="footnote" id="_footnote_3">
<a href="#_footnoteref_3">3</a>. To see how this term is determined, note footnotethat all new tokens accrue to the validators. Therefore, if validators start the period \([t, t + dt)\) with a fraction \(&#x3D5;_t\) of the tokens, they end the period with tokens&#xFF1A; + &#xFF08;&#x8981;&#x4E86;&#x89E3;&#x8FD9;&#x4E00;&#x9879;&#x662F;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x65B0;&#x5E01;&#x90FD;&#x79EF;&#x7D2F;&#x5230;&#x9A8C;&#x8BC1;&#x8005;&#x90A3;&#x91CC;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x9A8C;&#x8BC1;&#x8005;&#x5728;&#x65F6;&#x95F4;&#x533A;&#x95F4; \([t, t + dt)\) &#x5F00;&#x59CB;&#x65F6;&#x62E5;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x4EFD;&#x989D;&#x662F; \(&#x3D5;_t\) &#xFF0C;&#x5728;&#x65F6;&#x95F4;&#x533A;&#x95F4;&#x7ED3;&#x675F;&#x65F6;&#x62E5;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x4EFD;&#x989D;&#x662F;&#xFF1A;&#xFF09; \begin{equation} \frac{\phi_{t} + r(t) dt} {1+r(t) dt} = \left(\phi_{t} + r(t) dt \right) (1 - r(t) dt) + o(dt) = \phi_{t} + \left(1 - \phi_{t} \right) r(t) dt + o(dt) \end{equation}
</div>
</div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="CH00_Preface.html" class="navigation navigation-prev " aria-label="Previous page: Preface">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="CH02_Block_Rewards.html" class="navigation navigation-next " aria-label="Next page: Block Rewards">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Valuation","level":"1.1.2","depth":2,"next":{"title":"Block Rewards","level":"1.1.3","depth":2,"path":"Chapter_7_Economics/CH02_Block_Rewards.asciidoc","ref":"./Chapter_7_Economics/CH02_Block_Rewards.asciidoc","articles":[]},"previous":{"title":"Preface","level":"1.1.1","depth":2,"path":"Chapter_7_Economics/CH00_Preface.asciidoc","ref":"./Chapter_7_Economics/CH00_Preface.asciidoc","articles":[]},"dir":"ltr"},"config":{"plugins":["mathjax","sectionx","back-to-top-button"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sectionx":{},"highlight":{},"back-to-top-button":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Cryptoeconomics","gitbook":"*"},"file":{"path":"Chapter_7_Economics/CH01_Valuation.asciidoc","mtime":"2019-04-20T17:50:02.171Z","type":"asciidoc"},"gitbook":{"version":"3.2.3","time":"2019-04-20T18:18:08.586Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    </body>
</html>

