
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Block Rewards · Cryptoeconomics</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="CH03_Transaction_Fees.html" />
    
    
    <link rel="prev" href="CH01_Valuation.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Cryptoeconomics
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="CH00_Preface.html">
            
                <a href="CH00_Preface.html">
            
                    
                    Preface
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="CH01_Valuation.html">
            
                <a href="CH01_Valuation.html">
            
                    
                    Valuation
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.1.3" data-path="CH02_Block_Rewards.html">
            
                <a href="CH02_Block_Rewards.html">
            
                    
                    Block Rewards
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="CH03_Transaction_Fees.html">
            
                <a href="CH03_Transaction_Fees.html">
            
                    
                    Transaction Fees
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.5" data-path="CH04_Acknowledgement.html">
            
                <a href="CH04_Acknowledgement.html">
            
                    
                    Acknowledgement
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../Incentive_design/Incentive_design.html">
            
                <a href="../Incentive_design/Incentive_design.html">
            
                    
                    Incentive_design
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../Incentive_design/CH01.html">
            
                <a href="../Incentive_design/CH01.html">
            
                    
                    加密经济学和Token经济的起源和定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../Incentive_design/CH02.html">
            
                <a href="../Incentive_design/CH02.html">
            
                    
                    机制设计和博弈论基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../Incentive_design/CH03.html">
            
                <a href="../Incentive_design/CH03.html">
            
                    
                    共识机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../Incentive_design/CH04.html">
            
                <a href="../Incentive_design/CH04.html">
            
                    
                    Token分类和Token经济的设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../Incentive_design/CH05.html">
            
                <a href="../Incentive_design/CH05.html">
            
                    
                    Token的供给和需求
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Block Rewards</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>
<ul class="sectlevel1">
<li><a href="#_7_2_block_rewards">7.2 Block Rewards(&#x533A;&#x5757;&#x5956;&#x52B1;)</a>
<ul class="sectlevel2">
<li><a href="#_7_2_1_the_economic_implications_of_block_rewards">7.2.1 The economic implications of block rewards&#xFF08;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7684;&#x7ECF;&#x6D4E;&#x610F;&#x4E49;&#xFF09;</a></li>
<li><a href="#_7_2_2_block_reward_schedule_design_considerations">7.2.2  Block Reward Schedule: Design Considerations&#xFF08;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8BA1;&#x5212;&#xFF1A;&#x8BBE;&#x8BA1;&#x8003;&#x8651;&#xFF09;</a></li>
<li><a href="#_7_2_3_equitability_in_pos_block_reward_schemes_pos">7.2.3  Equitability in PoS block reward schemes&#xFF08;PoS&#x7CFB;&#x7EDF;&#x533A;&#x5757;&#x5956;&#x52B1;&#x65B9;&#x6848;&#x7684;&#x5747;&#x8861;&#x6027;&#xFF09;</a>
<ul class="sectlevel3">
<li><a href="#_7_2_3_1_equitability">7.2.3.1  Equitability&#xFF08;&#x5747;&#x8861;&#x6027;&#xFF09;</a></li>
<li><a href="#_7_2_3_2_equitable_choices_of_the_total_reward_r_r">7.2.3.2  Equitable choices of the total reward R&#xFF08;&#x603B;&#x5956;&#x52B1;R&#x7684;&#x5408;&#x7406;&#x9009;&#x62E9;&#xFF09;</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div class="sect1">
<h2 id="_7_2_block_rewards">7.2 Block Rewards(&#x533A;&#x5757;&#x5956;&#x52B1;)</h2>
<div class="sectionbody">
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Choosing a block reward schedule is an important question that is often addressed heuristically. For instance, in (7.5), we considered a stationary setting where the rate of growth of the token pool \(r(t)\) was constant. In general, we do not expect the system to be stationary; in fact, choosing a block reward function \(r(t)\) is of central interest. In this section, we discuss some of the key economic implications of block rewards for incentives of network participants, as well as distributional implications of alternative reward schedules.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8BA1;&#x5212;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x91CD;&#x8981;&#x662F;&#x4E8B;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x6478;&#x7740;&#x77F3;&#x5934;&#x8FC7;&#x6CB3;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x516C;&#x5F0F;&#xFF08;7.5&#xFF09;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x6052;&#x5B9A;&#x8BBE;&#x7F6E;&#xFF0C;&#x8BA4;&#x4E3A;&#x4EE3;&#x5E01;&#x6C60;&#x7684;&#x589E;&#x957F;&#x7387; \(r(t)\) &#x662F;&#x5E38;&#x6570;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x671F;&#x671B;&#x7CFB;&#x7EDF;&#x662F;&#x9759;&#x6B62;&#x4E0D;&#x53D8;&#x7684;&#xFF1B;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570; \(r(t)\) &#x662F;&#x6838;&#x5FC3;&#x5229;&#x76CA;&#x6240;&#x5728;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x4E00;&#x4E9B;&#x7528;&#x6765;&#x6FC0;&#x52B1;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7684;&#x5173;&#x952E;&#x7ECF;&#x6D4E;&#x610F;&#x4E49;&#xFF0C;&#x4EE5;&#x53CA;&#x66FF;&#x4EE3;&#x5956;&#x52B1;&#x8BA1;&#x5212;&#x7684;&#x5206;&#x914D;&#x5F71;&#x54CD;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>A key property of block rewards is that they add to the total token supply. Some cryptocurrencies (e.g., Bitcoin [61] and derivatives) o&#xFB00;er a block reward that decreases over time according to a fixed schedule, with a pre-determined end date. The total supply of Bitcoin tokens is thus limited. Others (e.g., Monero) maintain the block reward rate in excess of a positive lower bound at all time [177]; hence the token supply is unbounded. A natural question is how to evaluate these two operating points. In this section, we discuss some of the design tradeoffs.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x533A;&#x5757;&#x5956;&#x52B1;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5C5E;&#x6027;&#x5C31;&#x662F;&#x5B83;&#x5BF9;&#x4EE3;&#x5E01;&#x603B;&#x4F9B;&#x5E94;&#x91CF;&#x7684;&#x589E;&#x52A0;&#x3002;&#x4E00;&#x4E9B;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#xFF08;&#x5982;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;[61]&#x53CA;&#x5176;&#x884D;&#x751F;&#x54C1;&#xFF09;&#x4F1A;&#x6839;&#x636E;&#x56FA;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x8868;&#x51CF;&#x5C11;&#x533A;&#x5757;&#x5956;&#x52B1;&#xFF0C;&#x5E76;&#x6709;&#x9884;&#x5148;&#x786E;&#x5B9A;&#x7684;&#x65E5;&#x671F;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x603B;&#x4F9B;&#x5E94;&#x91CF;&#x56E0;&#x6B64;&#x53D7;&#x5230;&#x9650;&#x5236;&#x3002;&#x5176;&#x4ED6;&#x7684;&#xFF08;&#x5982;&#xFF0C;&#x95E8;&#x7F57;&#x5E01;&#xFF09;&#x59CB;&#x7EC8;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x8D85;&#x8FC7;&#x6B63;&#x4E0B;&#x9650;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387;[177]&#xFF1B;&#x56E0;&#x6B64;&#x4EE3;&#x5E01;&#x4F9B;&#x5E94;&#x662F;&#x65E0;&#x9650;&#x7684;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x8BC4;&#x4F30;&#x8FD9;&#x4E24;&#x79CD;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#x5C31;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5728;&#x672C;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x4E0A;&#x7684;&#x6743;&#x8861;&#x53D6;&#x820D;&#x3002;</p>
</div>
<div class="sect2">
<h3 id="_7_2_1_the_economic_implications_of_block_rewards">7.2.1 The economic implications of block rewards&#xFF08;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7684;&#x7ECF;&#x6D4E;&#x610F;&#x4E49;&#xFF09;</h3>
<div class="ulist">
<ul>
<li>
<p><strong>Who pays for running the network? &#xFF08;&#x8C01;&#x4E3A;&#x7F51;&#x7EDC;&#x7684;&#x8FD0;&#x884C;&#x4E70;&#x5355;&#xFF1F;&#xFF09;</strong></p>
</li>
</ul>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Growth in total token supply imposes a cost on all token balances, since purchasing power of tokens is eroded over time. This effect is analogous to the well-known concept of &#x201C;inflation tax&#x201D; in conventional economic systems. Validators (recall that we group validators together with block proposers) are the beneficiaries of this &#x201C;tax,&#x201D; since they collect the newly minted tokens in the form of block rewards. As far as valuation goes, block rewards effectively raise the fees collected by the validators. This can be seen from the steady-state valuation equation (7.5): holding all else equal, raising \(kr\), where \(r\) is the rate of flow of block rewards, is equivalent to raising the transaction fee parameter \(c\). The precise breakdown between transaction fees and token-based rewards matters, however, because it determines who exactly pays for network operations.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x7531;&#x4E8E;&#x4EE3;&#x5E01;&#x7684;&#x8D2D;&#x4E70;&#x529B;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x53D7;&#x5230;&#x4FB5;&#x8680;&#xFF0C;&#x4EE3;&#x5E01;&#x4F9B;&#x5E94;&#x603B;&#x91CF;&#x7684;&#x589E;&#x957F;&#x4F1A;&#x8FEB;&#x4F7F;&#x6240;&#x6709;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x4EA7;&#x751F;&#x6210;&#x672C;&#x3002;&#x8FD9;&#x79CD;&#x5F71;&#x54CD;&#x7C7B;&#x4F3C;&#x4E8E;&#x4F20;&#x7EDF;&#x7ECF;&#x6D4E;&#x4F53;&#x7CFB;&#x4E2D;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x201C;<strong>&#x901A;&#x8D27;&#x81A8;&#x80C0;&#x7A0E;</strong>&#x201D;&#x6982;&#x5FF5;&#x3002;&#x9A8C;&#x8BC1;&#x8005;&#x4EEC;&#xFF08;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x9A8C;&#x8BC1;&#x8005;&#x548C;&#x51FA;&#x5757;&#x8005;&#x7EC4;&#x5408;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#xFF09;&#x662F;&#x8FD9;&#x4E9B;&#x201C;&#x7A0E;&#x201D;&#x7684;&#x53D7;&#x76CA;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4EE5;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7684;&#x5F62;&#x5F0F;&#x6536;&#x5230;&#x4E86;&#x65B0;&#x94F8;&#x9020;&#x7684;&#x4EE3;&#x5E01;&#x3002;&#x5C31;&#x4F30;&#x503C;&#x800C;&#x8A00;&#xFF0C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x6709;&#x6548;&#x5730;&#x63D0;&#x9AD8;&#x4E86;&#x9A8C;&#x8BC1;&#x8005;&#x6536;&#x53D6;&#x7684;&#x8D39;&#x7528;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4ECE;&#x7A33;&#x6001;&#x4F30;&#x503C;&#x65B9;&#x7A0B;&#xFF08;7.5&#xFF09;&#x4E2D;&#x770B;&#x51FA;&#xFF1A;&#x4FDD;&#x6301;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x503C;&#x5E73;&#x7A33;&#xFF0C;&#x63D0;&#x9AD8; \(kr\)&#xFF0C;&#x5176;&#x4E2D; \(r\) &#x662F;<strong>&#x533A;&#x5757;&#x5956;&#x52B1;&#x7684;&#x901F;&#x7387;</strong>&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x63D0;&#x9AD8;<strong>&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x53C2;&#x6570;</strong> \(c\)&#x3002;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x57FA;&#x4E8E;&#x4EE3;&#x5E01;&#x7684;&#x5956;&#x52B1;&#x7684;&#x7CBE;&#x786E;&#x5206;&#x89E3;&#x662F;&#x6709;&#x91CD;&#x8981;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x786E;&#x5207;&#x5730;&#x51B3;&#x5B9A;&#x4E86;&#x662F;&#x8C01;&#x5728;&#x4E3A;&#x7F51;&#x7EDC;&#x8FD0;&#x8425;&#x4E70;&#x5355;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Both types of rewards, transaction fees and block rewards, ensure that all those enjoying the benefits of the network contribute resources to running it. This arrangement closely resembles the funding of commonly used infrastructure in conventional economic systems: for instance, a highway network may be supported through toll fees, paid directly by the drivers, and through public funds, contributed by the broad base of tax payers enjoying the indirect benefits of the highway system. In the context of the electronic payment system, transaction fees are paid by the consumers whenever they use tokens for retail transactions, and accrue to the validators who support operations of the payment network that enables such transactions. In turn, block rewards expressed in newly minted tokens are effectively paid for by all network participants who hold token balances, whether or not they use their tokens for transactions. Importantly, all those who hold tokens as a store of value or for speculative purposes end up bearing some of the cost of such block rewards.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8FD9;&#x4E8C;&#x8005;&#x90FD;&#x786E;&#x4FDD;&#x4E86;&#x6240;&#x6709;&#x4EAB;&#x53D7;&#x7F51;&#x7EDC;&#x7EA2;&#x5229;&#x7684;&#x4EBA;&#x90FD;&#x80FD;&#x4E3A;&#x7F51;&#x7EDC;&#x7684;&#x8FD0;&#x8F6C;&#x8D21;&#x732E;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x79CD;&#x8BBE;&#x7F6E;&#x548C;&#x4F20;&#x7EDF;&#x91D1;&#x878D;&#x7CFB;&#x7EDF;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8D44;&#x91D1;&#x5F88;&#x76F8;&#x4F3C;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x6761;&#x9AD8;&#x901F;&#x516C;&#x8DEF;&#x7F51;&#x7EDC;&#x5C06;&#x4ECE;&#x901A;&#x884C;&#x8D39;&#x548C;&#x516C;&#x5171;&#x8D44;&#x91D1;&#x4E2D;&#x5F97;&#x5230;&#x652F;&#x6301;&#xFF0C;&#x5176;&#x4E2D;&#x901A;&#x884C;&#x8D39;&#x7531;&#x53F8;&#x673A;&#x76F4;&#x63A5;&#x652F;&#x4ED8;&#xFF0C;&#x800C;&#x516C;&#x5171;&#x8D44;&#x91D1;&#x662F;&#x7531;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x4EAB;&#x53D7;&#x7740;&#x9AD8;&#x901F;&#x516C;&#x8DEF;&#x7CFB;&#x7EDF;&#x95F4;&#x63A5;&#x5229;&#x76CA;&#x7684;&#x7EB3;&#x7A0E;&#x4EBA;&#x6240;&#x8D21;&#x732E;&#x3002;&#x5728;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x662F;&#x7531;&#x6D88;&#x8D39;&#x8005;&#x5728;&#x4F7F;&#x7528;&#x7535;&#x5B50;&#x4EE3;&#x5E01;&#x8FDB;&#x884C;&#x96F6;&#x552E;&#x4EA4;&#x6613;&#x65F6;&#x6240;&#x652F;&#x4ED8;&#x7684;&#xFF0C;&#x5E76;&#x7D2F;&#x79EF;&#x7ED9;&#x652F;&#x6301;&#x6B64;&#x7C7B;&#x4EA4;&#x6613;&#x64CD;&#x4F5C;&#x7684;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#x7684;&#x9A8C;&#x8BC1;&#x8005;&#x3002;&#x76F8;&#x5E94;&#x5730;&#xFF0C;&#x6240;&#x6709;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x7684;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;&#x65E0;&#x8BBA;&#x4ED6;&#x4EEC;&#x662F;&#x5426;&#x5C06;&#x5176;&#x4EE3;&#x5E01;&#x7528;&#x4E8E;&#x4EA4;&#x6613;&#xFF0C;&#x65B0;&#x94F8;&#x9020;&#x5730;&#x4EE3;&#x5E01;&#x90FD;&#x4F1A;&#x901A;&#x8FC7;&#x4ED6;&#x4EEC;&#x88AB;&#x6709;&#x6548;&#x5730;&#x652F;&#x4ED8;&#x4F5C;&#x4E3A;&#x533A;&#x5757;&#x5956;&#x52B1;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x4F5C;&#x4E3A;&#x4EF7;&#x503C;&#x50A8;&#x85CF;&#x6216;&#x6295;&#x673A;&#x76EE;&#x7684;&#x7684;&#x4EBA;&#x6700;&#x7EC8;&#x90FD;&#x8981;&#x627F;&#x53D7;&#x8FD9;&#x79CD;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7684;&#x90E8;&#x5206;&#x6210;&#x672C;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Spreading the burden of funding network operations across a broad range of users, from frequent transactors to long-term holders of tokens, is more than an issue of fairness. All else equal, making speculators pay for some of the block rewards reduces the required level of transaction fees, which generally enhances token adoption and growth of the network. It is reasonable to expect that, in a new system, the volume of retail transactions starts at a relatively low level, grows over time. In contrast, speculative trading may be very active from the start, when future prospects of the network are highly uncertain, declining eventually as the network settles into its steady-state dynamics. Under such expectations of the network&#x2019;s growth, distributional considerations dictate that one should initiate the network with a relatively high initial block reward rate, so resources needed to support network function at this early stage are contributed primarily by speculators, and gradually reduce block rewards as the volume of retail transactions rises. In the long run, funding of network functions would then increasingly rely on the transaction fees, rather than block rewards.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x5E7F;&#x6CDB;&#x7684;&#x7528;&#x6237;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5C06;&#x7F51;&#x7EDC;&#x7684;&#x8FD0;&#x8425;&#x8D44;&#x91D1;&#x8D1F;&#x62C5;&#x5206;&#x6563;&#x5230;&#x9891;&#x7E41;&#x4EA4;&#x6613;&#x8005;&#x4E43;&#x81F3;&#x4EE3;&#x5E01;&#x7684;&#x957F;&#x671F;&#x6301;&#x6709;&#x8005;&#x8EAB;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x5E73;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x662F;&#x5E73;&#x7B49;&#x7684;&#xFF0C;&#x8BA9;&#x6295;&#x673A;&#x8005;&#x4E3A;&#x533A;&#x5757;&#x5956;&#x52B1;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x4ED8;&#x51FA;&#x4F1A;&#x51CF;&#x5C11;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x6C34;&#x5E73;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x63D0;&#x9AD8;&#x4EE3;&#x5E01;&#x7684;&#x91C7;&#x7528;&#x4EE5;&#x53CA;&#x7F51;&#x7EDC;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x671F;&#x671B;&#x96F6;&#x552E;&#x4EA4;&#x6613;&#x91CF;&#x4EE5;&#x4E00;&#x4E2A;&#x8F83;&#x4F4E;&#x7684;&#x6C34;&#x5E73;&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x589E;&#x957F;&#xFF0C;&#x8FD9;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6295;&#x673A;&#x4EA4;&#x6613;&#x5728;&#x521A;&#x5F00;&#x59CB;&#x53EF;&#x80FD;&#x4F1A;&#x5F88;&#x6D3B;&#x8DC3;&#xFF0C;&#x5F53;&#x7F51;&#x7EDC;&#x7684;&#x672A;&#x6765;&#x524D;&#x666F;&#x9AD8;&#x5EA6;&#x4E0D;&#x786E;&#x5B9A;&#x65F6;&#xFF0C;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x9010;&#x6E10;&#x8FDB;&#x5165;&#x7A33;&#x5B9A;&#x72B6;&#x6001;&#xFF0C;&#x6295;&#x673A;&#x4EA4;&#x6613;&#x6700;&#x7EC8;&#x4F1A;&#x964D;&#x4F4E;&#x3002;&#x5728;&#x5BF9;&#x7F51;&#x7EDC;&#x53D1;&#x5C55;&#x7684;&#x8FD9;&#x79CD;&#x671F;&#x671B;&#x4E0B;&#xFF0C;&#x5904;&#x4E8E;&#x5BF9;&#x5206;&#x914D;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x51B3;&#x5B9A;&#x4E86;&#x4EBA;&#x4EEC;&#x5E94;&#x8BE5;&#x4EE5;&#x76F8;&#x5BF9;&#x8F83;&#x9AD8;&#x7684;&#x521D;&#x59CB;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387;&#x6765;&#x542F;&#x52A8;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x65E9;&#x671F;&#x652F;&#x6301;&#x7F51;&#x7EDC;&#x529F;&#x80FD;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x4E3B;&#x8981;&#x7531;&#x6295;&#x673A;&#x8005;&#x8D21;&#x732E;&#xFF0C;&#x5E76;&#x4E14;&#x968F;&#x7740;&#x96F6;&#x552E;&#x4EA4;&#x6613;&#x91CF;&#x7684;&#x589E;&#x52A0;&#x8981;&#x9010;&#x6B65;&#x51CF;&#x5C11;&#x533A;&#x5757;&#x5956;&#x52B1;&#x3002;&#x4ECE;&#x6B64;&#x957F;&#x8FDC;&#x6765;&#x770B;&#xFF0C;&#x7F51;&#x7EDC;&#x529F;&#x80FD;&#x6240;&#x9700;&#x7684;&#x8FD0;&#x8F6C;&#x8D44;&#x91D1;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4F9D;&#x8D56;&#x4E8E;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x533A;&#x5757;&#x5956;&#x52B1;&#x3002;</p>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>Incentives for Validators&#xFF08;&#x9A8C;&#x8BC1;&#x6FC0;&#x52B1;&#xFF09;</strong></p>
</li>
</ul>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Consider the steady-state solution for token valuation, (7.4, 7.5). Validators earn an expected rate of return equal to \(&#x3BB;_f + &#x3B7;&#x3C3;\), which is their opportunity cost of taking on the risk of the flow of transaction fees and block rewards. Note that the equilibrium expected return of the validators is neither affected by the level of transaction fees nor the block reward rate. Rather, validators&#x2019; expected rate of return is determined by the opportunity cost of holding tokens. In equilibrium, each validator decides how many tokens to stake. As validators stake more tokens, they collectively drive down the equilibrium rate of return each of them earns; conversely, their rate of return rises as validators stake fewer tokens. As a result, the level of transaction fees \(c\) and block reward rate \(r\) affect the combined value of the validators&#x2019; stakes, but not the equilibrium expected rate of return they earn. Specifically, the combined value of the validators&#x2019; stakes is</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x6765;&#x601D;&#x8003;&#x4EE3;&#x5E01;&#x4F30;&#x503C;&#x7684;&#x7A33;&#x6001;&#x89E3;&#xFF0C;&#xFF08;&#x5373;7.4&#x3001;7.5&#x6240;&#x793A;&#xFF09;&#x3002;&#x9A8C;&#x8BC1;&#x8005;&#x83B7;&#x5F97;&#x7684;&#x9884;&#x671F;&#x56DE;&#x62A5;&#x7387;&#x7B49;&#x4E8E; \(&#x3BB;_f + &#x3B7;&#x3C3;\)&#xFF0C;&#x8FD9;&#x662F;&#x4ED6;&#x4EEC;&#x627F;&#x62C5;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8D44;&#x91D1;&#x6D41;&#x98CE;&#x9669;&#x7684;&#x673A;&#x4F1A;&#x6210;&#x672C;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x5747;&#x8861;&#x9884;&#x671F;&#x56DE;&#x62A5;&#xFF0C;&#x65E2;&#x4E0D;&#x53D7;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x6C34;&#x5E73;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4E5F;&#x4E0D;&#x53D7;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x9884;&#x671F;&#x56DE;&#x62A5;&#x7387;&#x662F;&#x7531;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x7684;&#x673A;&#x4F1A;&#x6210;&#x672C;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x5728;&#x5E73;&#x8861;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x9A8C;&#x8BC1;&#x8005;&#x81EA;&#x6211;&#x51B3;&#x5B9A;&#x8981;&#x8D28;&#x62BC;&#x591A;&#x5C11;&#x4EE3;&#x5E01;&#x3002;&#x5F53;&#x9A8C;&#x8BC1;&#x8005;&#x8D28;&#x62BC;&#x66F4;&#x591A;&#x7684;&#x4EE3;&#x5E01;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5171;&#x540C;&#x538B;&#x4F4E;&#x4E86;&#x4ED6;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x83B7;&#x5F97;&#x7684;&#x5747;&#x8861;&#x56DE;&#x62A5;&#x7387;&#xFF1B;&#x76F8;&#x53CD;&#xFF0C;&#x5F53;&#x9A8C;&#x8BC1;&#x8005;&#x8D28;&#x62BC;&#x8F83;&#x5C11;&#x7684;&#x4EE3;&#x5E01;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x56DE;&#x62A5;&#x7387;&#x4F1A;&#x4E0A;&#x5347;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x6C34;&#x5E73; \(c\) &#x548C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387; \(r\) &#x5F71;&#x54CD;&#x7684;&#x662F;&#x9A8C;&#x8BC1;&#x8005;&#x6743;&#x76CA;&#x4EE3;&#x5E01;&#x7684;&#x7EFC;&#x5408;&#x4EF7;&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ED6;&#x4EEC;&#x8D5A;&#x53D6;&#x7684;&#x9884;&#x671F;&#x56DE;&#x62A5;&#x7387;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x6743;&#x76CA;&#x4EE3;&#x5E01;&#x7684;&#x7EFC;&#x5408;&#x4EF7;&#x503C;&#x662F;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ \phi_t p_t = (A - k) Y_t =
\ \frac {c+kr} {&#x3BB;_f + &#x3B7;&#x3C3; - g_Y} Y_t
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>All else equal, the value of validators&#x2019; token holdings increases in the level of transaction fees \(c\) and the block reward rate \(r\). The fraction of the overall token pool held by the validators is also increasing in these two parameters.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5176;&#x4ED6;&#x4E00;&#x5207;&#x5E73;&#x7A33;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x6301;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x4EF7;&#x503C;&#x589E;&#x52A0;&#x4E8E;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x6C34;&#x5E73; \(c\) &#x548C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387; \(r\)&#x3002;&#x9A8C;&#x8BC1;&#x8005;&#x6301;&#x6709;&#x7684;&#x4EE3;&#x5E01;&#x5728;&#x6574;&#x4F53;&#x4EE3;&#x5E01;&#x6C60;&#x4E2D;&#x7684;&#x5360;&#x6BD4;&#x4E5F;&#x589E;&#x52A0;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Rewarding validators with new tokens thus offers them a claim on the proceeds from seigniorage in the PoS system. Those network participants who hold balances and do not act as validators have no such claim &#x2013;&#x2013; they maintain token balances because of their convenience value or for speculative reasons. This creates a wedge, \(&#x3BB;_f + &#x3B7;&#x3C3; - g_Y + r\), between expected returns earned by the validators and returns earned by other holders of tokens. Thus, while not affecting the equilibrium expected rate of return of validators, the rate of growth of token supply \(r\) lowers the expected return earned by other network participants. A higher rate of block rewards thus discourages network participants from passively holding tokens and not acting as validators. This mechanism becomes particularly meaningful when we account for various additional costs faced by validators, including physical costs of running validator nodes and losses due to stake slashing (triggered by accidental violations, e.g., validator nodes being off-line).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x7528;&#x65B0;&#x5E01;&#x5956;&#x52B1;&#x9A8C;&#x8BC1;&#x8005;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x7ED9;&#x4ED6;&#x4EEC;&#x4E86;&#x4E00;&#x4EFD;&#x5728;PoS&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x94F8;&#x5E01;&#x6536;&#x76CA;&#x503A;&#x6743;&#x3002;&#x90A3;&#x4E9B;&#x6301;&#x6709;&#x4F59;&#x989D;&#x4F46;&#x4E0D;&#x5145;&#x5F53;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x4E0D;&#x62E5;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x503A;&#x6743;&#x2014;&#x2014;&#x4ED6;&#x4EEC;&#x4FDD;&#x6301;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x4FBF;&#x5229;&#x4EF7;&#x503C;&#x6216;&#x8005;&#x662F;&#x51FA;&#x4E8E;&#x6295;&#x673A;&#x7684;&#x539F;&#x56E0;&#x3002;&#x8FD9;&#x5728;&#x9A8C;&#x8BC1;&#x8005;&#x8D5A;&#x53D6;&#x7684;&#x9884;&#x671F;&#x56DE;&#x62A5;&#x4E0E;&#x5176;&#x4ED6;&#x7684;&#x4EE3;&#x5E01;&#x6301;&#x6709;&#x8005;&#x8D5A;&#x53D6;&#x7684;&#x56DE;&#x62A5;&#x4E4B;&#x95F4;&#x521B;&#x9020;&#x4E86;&#x4E00;&#x4E2A;&#x6954;&#x5B50;&#xFF0C;&#x5373; \(&#x3BB;_f + &#x3B7;&#x3C3; - g_Y + r\)&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x5F71;&#x54CD;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x5747;&#x8861;&#x9884;&#x671F;&#x56DE;&#x62A5;&#x7387;&#xFF0C;&#x4F46;&#x4EE3;&#x5E01;&#x7684;&#x4F9B;&#x5E94;&#x589E;&#x957F;&#x7387; \(r\) &#x964D;&#x4F4E;&#x4E86;&#x5176;&#x4ED6;&#x7684;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x8D5A;&#x53D6;&#x7684;&#x9884;&#x671F;&#x56DE;&#x62A5;&#x3002;&#x66F4;&#x9AD8;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387;&#x56E0;&#x6B64;&#x4E5F;&#x963B;&#x788D;&#x4E86;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x88AB;&#x52A8;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#xFF0C;&#x800C;&#x4E0D;&#x5145;&#x5F53;&#x9A8C;&#x8BC1;&#x8005;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5BF9;&#x9A8C;&#x8BC1;&#x8005;&#x6240;&#x9762;&#x4E34;&#x7684;&#x5404;&#x79CD;&#x989D;&#x5916;&#x6210;&#x672C;&#x505A;&#x51FA;&#x89E3;&#x91CA;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x5C31;&#x53D8;&#x7684;&#x7279;&#x522B;&#x6709;&#x610F;&#x4E49;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x6210;&#x672C;&#x5305;&#x62EC;&#x4E86;&#x8FD0;&#x884C;&#x9A8C;&#x8BC1;&#x8282;&#x70B9;&#x7684;&#x7269;&#x7406;&#x6210;&#x672C;&#xFF0C;&#x4EE5;&#x53CA;&#x56E0;&#x524A;&#x51CF;&#x6743;&#x76CA;&#x4EE3;&#x5E01;&#x9020;&#x6210;&#x4ECE;&#x635F;&#x5931;&#xFF08;&#x8FD9;&#x79CD;&#x524A;&#x51CF;&#x7531;&#x610F;&#x5916;&#x8FDD;&#x89C4;&#x89E6;&#x53D1;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x9A8C;&#x8BC1;&#x8282;&#x70B9;&#x5904;&#x4E8E;&#x79BB;&#x7EBF;&#x72B6;&#x6001;&#xFF09;&#x3002;</p>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>User Adoption&#xFF08;&#x7528;&#x6237;&#x7684;&#x91C7;&#x7528;&#xFF09;</strong></p>
</li>
</ul>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>In the stylized model of this chapter, the volume of consumer-merchant transactions using tokens is exogenous, and consumer holdings of tokens are inelastically related to this transaction volume. In a more realistic description of network dynamics, consumer demand for token balances should be elastic with respect to the expected rate of return earned on such balances, in addition to the liquidity benefits of holding tokens. By penalizing token balances, higher block reward rates reduce consumer demand for token balances, ultimately translating into lower adoption of tokens by consumers and merchants. In other words, by reducing expected returns on passive holdings of tokens, higher block reward rates may eventually hurt user adoption of the cryptocurrency. Such considerations inform our thinking about the qualitative aspects of the desirable block reward schedule. More formal analysis of user adoption requires further research, and is beyond the scope of this chapter.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x672C;&#x7AE0;&#x7A0B;&#x5F0F;&#x5316;&#x7684;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x4EE3;&#x5E01;&#x8FDB;&#x884C;&#x5546;&#x4E1A;&#x6D88;&#x8D39;&#x7684;&#x4EA4;&#x6613;&#x91CF;&#x662F;&#x5916;&#x751F;&#x7684;&#xFF0C;&#x800C;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x6301;&#x5E01;&#x4E0E;&#x8FD9;&#x79CD;&#x4EA4;&#x6613;&#x91CF;&#x662F;&#x975E;&#x5F39;&#x6027;&#x76F8;&#x5173;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x7F51;&#x7EDC;&#x52A8;&#x6001;&#x505A;&#x4E00;&#x4E2A;&#x66F4;&#x73B0;&#x5B9E;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x9664;&#x4E86;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x7684;&#x6D41;&#x52A8;&#x6027;&#x6536;&#x76CA;&#x5916;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x7684;&#x9700;&#x6C42;&#x4E0E;&#x4ED6;&#x4EEC;&#x5728;&#x8FD9;&#x4E9B;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x4E0A;&#x8D5A;&#x53D6;&#x7684;&#x9884;&#x671F;&#x56DE;&#x62A5;&#x7387;&#x5E94;&#x8BE5;&#x662F;&#x5F39;&#x6027;&#x76F8;&#x5173;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x5904;&#x4E8E;&#x4E0D;&#x5229;&#x5730;&#x4F4D;&#xFF0C;&#x8F83;&#x9AD8;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387;&#x524A;&#x5F31;&#x4E86;&#x6D88;&#x8D39;&#x8005;&#x5BF9;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6700;&#x7EC8;&#x8F6C;&#x5316;&#x4E3A;&#x6D88;&#x8D39;&#x8005;&#x548C;&#x5546;&#x4EBA;&#x5BF9;&#x4EE3;&#x5E01;&#x66F4;&#x4F4E;&#x7684;&#x91C7;&#x7528;&#x6C34;&#x5E73;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x901A;&#x8FC7;&#x51CF;&#x5C11;&#x88AB;&#x52A8;&#x6301;&#x6709;&#x4EE3;&#x5E01;&#x7684;&#x9884;&#x671F;&#x56DE;&#x62A5;&#xFF0C;&#x66F4;&#x9AD8;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387;&#x6700;&#x7EC8;&#x53EF;&#x80FD;&#x4F1A;&#x635F;&#x5BB3;&#x7528;&#x6237;&#x5BF9;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x91C7;&#x7528;&#x3002;&#x8FD9;&#x4E9B;&#x8003;&#x8651;&#x53CD;&#x6620;&#x4E86;&#x6211;&#x4EEC;&#x5BF9;&#x7406;&#x60F3;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8BA1;&#x5212;&#x5728;&#x5B9A;&#x6027;&#x65B9;&#x9762;&#x7684;&#x601D;&#x8003;&#x3002;&#x5173;&#x4E8E;&#x7528;&#x6237;&#x91C7;&#x7528;&#x7684;&#x66F4;&#x6B63;&#x5F0F;&#x7684;&#x5206;&#x6790;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x7814;&#x7A76;&#xFF0C;&#x4E5F;&#x8D85;&#x51FA;&#x4E86;&#x672C;&#x7AE0;&#x8282;&#x7684;&#x8303;&#x56F4;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="_7_2_2_block_reward_schedule_design_considerations">7.2.2  Block Reward Schedule: Design Considerations&#xFF08;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8BA1;&#x5212;&#xFF1A;&#x8BBE;&#x8BA1;&#x8003;&#x8651;&#xFF09;</h3>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Our analysis of economic implications of block rewards provides some guidance for how to design block reward schedules with desirable properties. A well-chosen block reward schedule should ensure long-term economic viability of the payment network, including sufficient incentives for user adoption and for participation in performing network functions (block proposals and validation), while also enforcing fairness among validators and proposers. We currently envision a design with a reward rate that starts at a relatively high level at the launch of the network, and decays over time as the network matures.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x5BF9;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7684;&#x7ECF;&#x6D4E;&#x610F;&#x4E49;&#x6240;&#x505A;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x5BF9;&#x4E8E;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x7406;&#x60F3;&#x5C5E;&#x6027;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8BA1;&#x5212;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x6307;&#x5BFC;&#x3002;&#x4E00;&#x4E2A;&#x7CBE;&#x5FC3;&#x9009;&#x62E9;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8BA1;&#x5212;&#x5E94;&#x786E;&#x4FDD;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#x7684;&#x957F;&#x671F;&#x7ECF;&#x6D4E;&#x53EF;&#x884C;&#x6027;&#xFF0C;&#x5305;&#x62EC;&#x4E86;&#x5BF9;&#x7528;&#x6237;&#x91C7;&#x7528;&#x548C;&#x53C2;&#x4E0E;&#x6267;&#x884C;&#x7F51;&#x7EDC;&#x529F;&#x80FD;&#xFF08;&#x51FA;&#x5757;&#x548C;&#x9A8C;&#x8BC1;&#xFF09;&#x7684;&#x5145;&#x5206;&#x6FC0;&#x52B1;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5728;&#x9A8C;&#x8BC1;&#x8005;&#x548C;&#x51FA;&#x5757;&#x8005;&#x4E4B;&#x95F4;&#x5F3A;&#x52A0;&#x4E86;&#x516C;&#x5E73;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x8BBE;&#x60F3;&#x7684;&#x4E00;&#x79CD;&#x5956;&#x52B1;&#x7387;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5176;&#x5956;&#x52B1;&#x7387;&#x5728;&#x7F51;&#x7EDC;&#x542F;&#x52A8;&#x4E4B;&#x521D;&#x4EE5;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x9AD8;&#x7684;&#x6C34;&#x5E73;&#x5F00;&#x59CB;&#xFF0C;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x7684;&#x6210;&#x719F;&#x800C;&#x9010;&#x6E10;&#x8870;&#x51CF;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>A high initial rate of block rewards is in line with the design of many existing cryptocurrencies. This encourages participation of token holders in the validation pool during the early period of network development, when the volume of consumer transactions, and thus the volume of transaction fees is low. During this early period, it is imperative to reward proposer and validator nodes for their efforts; without such nodes, the system cannot operate.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x9AD8;&#x521D;&#x59CB;&#x5757;&#x5956;&#x52B1;&#x7387;&#x7B26;&#x5408;&#x8BB8;&#x591A;&#x73B0;&#x6709;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x8FD9;&#x4F1A;&#x9F13;&#x52B1;&#x4EE3;&#x5E01;&#x6301;&#x6709;&#x8005;&#x5728;&#x7F51;&#x7EDC;&#x5F00;&#x53D1;&#x521D;&#x671F;&#x53C2;&#x4E0E;&#x5230;&#x9A8C;&#x8BC1;&#x6C60;&#x4E2D;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x6D88;&#x8D39;&#x8005;&#x4EA4;&#x6613;&#x91CF;&#x8F83;&#x4F4E;&#xFF0C;&#x56E0;&#x6B64;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x91CF;&#x4E5F;&#x5F88;&#x4F4E;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x65E9;&#x671F;&#x9636;&#x6BB5;&#xFF0C;&#x5BF9;&#x51FA;&#x5757;&#x8282;&#x70B9;&#x548C;&#x9A8C;&#x8BC1;&#x8282;&#x70B9;&#x6240;&#x505A;&#x7684;&#x52AA;&#x529B;&#x7ED9;&#x4E88;&#x5956;&#x52B1;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF1B;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x65E0;&#x6CD5;&#x8FD0;&#x884C;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>As adoption increases, initial growth in token supply will gradually decline. In the long run, the desirable rate of block rewards is subject to the tradeoffs discussed in Section 7.2.1 above. Higher reward rate distributes the financial burden of running the network over a broader base of token holders. At the same time, higher reward rate effectively taxes passive token balances, hurting user adoption. Depending on which of these forces dominates, the long-run block reward rate may remain positive or possibly converge to zero. We are still in the process of selecting a block reward schedule.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x968F;&#x7740;&#x91C7;&#x7528;&#x7387;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x4EE3;&#x5E01;&#x4F9B;&#x5E94;&#x7684;&#x521D;&#x59CB;&#x589E;&#x957F;&#x7387;&#x5C06;&#x9010;&#x6E10;&#x4E0B;&#x964D;&#x3002;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#xFF0C;&#x7406;&#x60F3;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387;&#x7B26;&#x5408;&#x5728;&#x4E0A;&#x6587;&#x7B2C;\(7.2.1\)&#x5C0F;&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x5230;&#x7684;&#x6743;&#x8861;&#x3002;&#x8F83;&#x9AD8;&#x7684;&#x56DE;&#x62A5;&#x7387;&#x5728;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x4EE3;&#x5E01;&#x6301;&#x6709;&#x4EBA;&#x57FA;&#x7840;&#x4E0A;&#x5206;&#x6563;&#x4E86;&#x8FD0;&#x884C;&#x7F51;&#x7EDC;&#x7684;&#x8D22;&#x52A1;&#x8D1F;&#x62C5;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x66F4;&#x9AD8;&#x7684;&#x56DE;&#x62A5;&#x7387;&#x6709;&#x6548;&#x5730;&#x5BF9;&#x88AB;&#x52A8;&#x4EE3;&#x5E01;&#x4F59;&#x989D;&#x5F81;&#x4E86;&#x7A0E;&#xFF0C;&#x4E5F;&#x635F;&#x5BB3;&#x4E86;&#x7528;&#x6237;&#x7684;&#x91C7;&#x7528;&#x3002;&#x4F9D;&#x636E;&#x8FD9;&#x4E9B;&#x529B;&#x91CF;&#x4E2D;&#x8C01;&#x5360;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#xFF0C;&#x957F;&#x671F;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7387;&#x53EF;&#x80FD;&#x4FDD;&#x6301;&#x4E3A;&#x6B63;&#x53C8;&#x6216;&#x8005;&#x53EF;&#x80FD;&#x6536;&#x655B;&#x5230;&#x96F6;&#x3002;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x662F;&#x5904;&#x4E8E;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8BA1;&#x5212;&#x7684;&#x9009;&#x62E9;&#x8FC7;&#x7A0B;&#x4E2D;&#x3002;</p>
</div>
<div class="paragraph">
<p><span class="image"><img src="icons/Block_Reward.png" alt="Figure 7.1"></span></p>
</div>
<div class="paragraph">
<p><span class="small">Figure 7.1: Comparison between common block reward functions. Halving is used in Bitcoin and many of its derivatives, whereas smooth decay is used in Monero.
&#xFF08;&#x56FE;7.1&#xFF1A;&#x5E38;&#x89C1;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x6BD4;&#x8F83;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x53CA;&#x5176;&#x8BB8;&#x591A;&#x884D;&#x751F;&#x54C1;&#x4F7F;&#x7528;&#x51CF;&#x534A;&#x6CD5;&#xFF0C;&#x800C;&#x95E8;&#x7F57;&#x5E01;&#x5219;&#x4F7F;&#x7528;&#x5E73;&#x6ED1;&#x8870;&#x51CF;&#x6CD5;&#x3002;&#xFF09;</span></p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>For reference, Figure 7.1 shows caricatures of reward rate schedules that have been adopted in existing cryptocurrencies. &#x2018;Halving&#x2019; refers to reward schedules that maintain a constant reward over a long period (e.g. years), and periodically reduce the block reward by half. This approach is used in Bitcoin and several cryptocurrencies derived from it. &#x2018;Smooth decay&#x2019; is used in Monero, and gives a smooth approximation of the reward function in Bitcoin. Notice that the smooth decay curve is lower bounded by a fixed minimum block reward; this is a detail specified by Monero&#x2019;s monetary policy. In our case, that minimum rate of growth in token supply need not exist.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#xFF0C;&#x56FE;7.1&#x6A21;&#x62DF;&#x4E86;&#x91C7;&#x7528;&#x5728;&#x73B0;&#x6709;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4E0A;&#x7684;&#x5757;&#x5956;&#x52B1;&#x7387;&#x65B9;&#x6848;&#x3002;&#x201C;&#x51CF;&#x534A;&#x6CD5;&#x201D;&#x662F;&#x6307;&#x5728;&#x8F83;&#x957F;&#x65F6;&#x95F4;&#x5185;&#xFF08;&#x5982;&#x51E0;&#x5E74;&#xFF09;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x7684;&#x5956;&#x52B1;&#x8BA1;&#x5212;&#xFF0C;&#x5E76;&#x5B9A;&#x671F;&#x5C06;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51CF;&#x5C11;&#x4E00;&#x534A;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x88AB;&#x7528;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x53CA;&#x5176;&#x884D;&#x751F;&#x7684;&#x51E0;&#x79CD;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x3002;&#x201C;&#x5E73;&#x6ED1;&#x8870;&#x51CF;&#x6CD5;&#x201D;&#x7528;&#x4E8E;&#x95E8;&#x7F57;&#x5E01;&#xFF0C;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x7684;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x7684;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x5E73;&#x6ED1;&#x8FD1;&#x4F3C;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5E73;&#x6ED1;&#x8870;&#x51CF;&#x66F2;&#x7EBF;&#x7684;&#x4E0B;&#x9650;&#x662F;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x6700;&#x5C0F;&#x533A;&#x5757;&#x5956;&#x52B1;&#xFF1B;&#x8FD9;&#x662F;&#x7531;&#x95E8;&#x7F57;&#x5E01;&#x7684;&#x8D27;&#x5E01;&#x653F;&#x7B56;&#x6307;&#x5B9A;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4EE3;&#x5E01;&#x4F9B;&#x5E94;&#x7684;&#x6700;&#x4F4E;&#x589E;&#x957F;&#x7387;&#x4E0D;&#x9700;&#x8981;&#x5B58;&#x5728;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>We show in the next section (7.2.3) that choosing large initial block rewards (compared to the initial stake pool) can lead to substantial and irreversible wealth imbalance in PoS systems. For example, Bitcoin started with a stake pool of 50 BTC and initial block rewards of 50 BTC per block; in a PoS system, such parameter choices could very easily lead to substantial wealth concentration. Starting with a large initial stake pool compared to the block reward size is an easy way to counter these effects. At &#xFB01;rst glance, this directive seems to counter the earlier conclusion that we need high initial inflation to encourage adoption. Indeed, there is a tradeoff between choosing inflation high enough to encourage adoption and keeping it low enough to prevent severe wealth imbalance. To this point, notice that to prevent stake imbalance, the inflation rate does not need to be excessively small. In practice, our simulations suggest that if the block reward is less than, say, a thousandth of the initial stake pool, then stake imbalance remains mild [68]. For example, if Unit-e begins with an initial stake pool of 1.5 billion tokens, then this rule of thumb suggests a block reward of at most 1.5 million tokens per block. Aggregated over all the blocks in a year at a (conservative) block rate of 30 seconds per block, this imposes an upper bound on annual inflation of around 100,000%. Such an inflation rate is orders of magnitude higher than any we would set in practice, even in the early days of Unit-e. Hence, the apparent tension between encouraging equitability and adoption is weak; for a large enough stake pool, we can choose inflation to be very high without affecting equitability.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#xFF08;7.2.3&#xFF09;&#x4E2D;&#x4F1A;&#x6307;&#x51FA;&#xFF0C;&#x9009;&#x62E9;&#x5927;&#x989D;&#x521D;&#x59CB;&#x533A;&#x5757;&#x5956;&#x52B1;&#xFF08;&#x4E0E;&#x521D;&#x59CB;&#x4EE3;&#x5E01;&#x6743;&#x76CA;&#x6C60;&#x76F8;&#x6BD4;&#xFF09;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;PoS&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5177;&#x6709;&#x5B9E;&#x8D28;&#x6027;&#x7684;&#x4E14;&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x7684;&#x8D22;&#x5BCC;&#x5931;&#x8861;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x4ECE; 50 &#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6743;&#x76CA;&#x6C60;&#x548C;&#x6BCF;&#x4E2A;&#x533A;&#x5757; 50 &#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x521D;&#x59CB;&#x5956;&#x52B1;&#x5F00;&#x59CB;&#xFF1B;&#x5728;&#x4E00;&#x4E2A; POS &#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x53C2;&#x6570;&#x9009;&#x62E9;&#x5F88;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x8D22;&#x5BCC;&#x96C6;&#x4E2D;&#x3002;&#x4E0E;&#x533A;&#x5757;&#x5956;&#x52B1;&#x89C4;&#x6A21;&#x76F8;&#x6BD4;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6C60;&#x5F00;&#x59CB;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5BB9;&#x6613;&#x5E94;&#x5BF9;&#x8FD9;&#x4E9B;&#x5F71;&#x54CD;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E4D;&#x4E00;&#x770B;&#xFF0C;&#x8FD9;&#x4E00;&#x6307;&#x4EE4;&#x4F3C;&#x4E4E;&#x4E0E;&#x65E9;&#x5148;&#x7684;&#x7ED3;&#x8BBA;&#x76F8;&#x53CD;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9AD8;&#x521D;&#x59CB;&#x901A;&#x80C0;&#x7387;&#x6765;&#x9F13;&#x52B1;&#x91C7;&#x7528;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5728;&#x9009;&#x62E9;&#x8DB3;&#x591F;&#x9AD8;&#x7684;&#x901A;&#x80C0;&#x7387;&#x6765;&#x9F13;&#x52B1;&#x91C7;&#x7528;&#x548C;&#x4FDD;&#x6301;&#x8DB3;&#x591F;&#x4F4E;&#x7684;&#x901A;&#x80C0;&#x7387;&#x4EE5;&#x9632;&#x6B62;&#x4E25;&#x91CD;&#x7684;&#x8D22;&#x5BCC;&#x5931;&#x8861;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x4E00;&#x79CD;&#x6743;&#x8861;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x80A1;&#x6743;&#x5931;&#x8861;&#xFF0C;&#x901A;&#x80C0;&#x7387;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x8FC7;&#x4E8E;&#x5C0F;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6A21;&#x62DF;&#x8868;&#x660E;&#xFF0C;&#x5982;&#x679C;&#x533A;&#x5757;&#x56DE;&#x62A5;&#x4F4E;&#x4E8E;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6C60;&#x7684;&#x5343;&#x5206;&#x4E4B;&#x4E00;&#xFF0C;&#x90A3;&#x4E48;&#x6743;&#x76CA;&#x5931;&#x8861;&#x4ECD;&#x7136;&#x5F88;&#x6E29;&#x548C; [68]&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C; Unit-e &#x4ECE; 15 &#x4EBF;&#x4EE3;&#x5E01;&#x7684;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6C60;&#x5F00;&#x59CB;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#x5EFA;&#x8BAE;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x6700;&#x591A;&#x53EF;&#x83B7;&#x5F97; 150 &#x4E07;&#x4EE3;&#x5E01;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x3002;&#x5728;&#x4E00;&#x5E74;&#x5185;&#x4EE5; 30 &#x79D2;/&#x533A;&#x5757;&#x7684;&#xFF08;&#x4FDD;&#x5B88;&#x7684;&#xFF09;&#x5757;&#x901F;&#x5EA6;&#x5BF9;&#x6240;&#x6709;&#x5757;&#x8FDB;&#x884C;&#x5408;&#x8BA1;&#xFF0C;&#x8FD9;&#x8FEB;&#x4F7F;&#x5E74;&#x901A;&#x80C0;&#x7387;&#x4E0A;&#x9650;&#x5927;&#x7EA6;&#x4E3A; 100,000%&#x3002;&#x8FD9;&#x6837;&#x7684;&#x901A;&#x80C0;&#x7387;&#x6BD4;&#x6211;&#x4EEC;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x8BBE;&#x5B9A;&#x7684;&#x4EFB;&#x4F55;&#x901A;&#x80C0;&#x7387;&#x90FD;&#x8981;&#x9AD8;&#x51FA;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x5728; Unit-e &#x7684;&#x65E9;&#x671F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x9F13;&#x52B1;&#x5747;&#x8861;&#x6027;&#x548C;&#x91C7;&#x7528;&#x4E4B;&#x95F4;&#x660E;&#x663E;&#x7684;&#x7D27;&#x5F20;&#x5173;&#x7CFB;&#x662F;&#x5FAE;&#x5F31;&#x7684;&#xFF1B;&#x5BF9;&#x4E8E;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x4EE3;&#x5E01;&#x6743;&#x76CA;&#x6C60;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x901A;&#x80C0;&#x7387;&#x800C;&#x4E0D;&#x5F71;&#x54CD;&#x5747;&#x8861;&#x6027;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="_7_2_3_equitability_in_pos_block_reward_schemes_pos">7.2.3  Equitability in PoS block reward schemes&#xFF08;PoS&#x7CFB;&#x7EDF;&#x533A;&#x5757;&#x5956;&#x52B1;&#x65B9;&#x6848;&#x7684;&#x5747;&#x8861;&#x6027;&#xFF09;</h3>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>In this section, we study one of the tradeoffs involved in choosing a block reward function: equitability. At a high level, equitability means that a party that begins with a certain fraction of stake cannot unduly amplify its fraction of stake simply by participating in block proposal or validation. Perhaps surprisingly, standard PoS implementations can exhibit extreme inequitability if system parameters are chosen naively. For example, consider a PoS blockchain that awards the full block reward to the user that proposes each block. This is a standard assumption that is used in almost every PoS cryptocurrency today. Suppose further that block rewards are immediately incorporated into each party&#x2019;s portion of the proposal stake pool. Now let us initialize such a system with parameters comparable to Bitcoin&#x2019;s initial state: 50 initial tokens and a block reward of 50 tokens. If party A owns \(\frac 1 3\) of the initial stake, a simple Polya&#x2019;s urn argument shows that as the block length tends to in&#xFB01;nity, the limiting stake of party A converges almost surely to a random variable with distribution Beta\((\frac 1 3, \frac 2 3)\), visualized in Figure 7.2 by the blue solid curve labelled &#x2018;Constant Rewards, PoS&#x2019;.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E86;&#x5728;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x65F6;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x6743;&#x8861;&#x4E4B;&#x4E00;&#xFF1A;&#x5747;&#x8861;&#x6027;&#x3002;&#x5728;&#x9AD8;&#x5C42;&#x6B21;&#x4E0A;&#xFF0C;&#x516C;&#x5E73;&#x6027;&#x610F;&#x5473;&#x7740;&#x4EE5;&#x67D0;&#x4E00;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x5F00;&#x59CB;&#x7684;&#x4E00;&#x65B9;&#x4E0D;&#x80FD;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x53C2;&#x4E0E;&#x51FA;&#x5757;&#x6216;&#x9A8C;&#x8BC1;&#x800C;&#x8FC7;&#x5EA6;&#x6269;&#x5927;&#x5176;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x3002;&#x4E5F;&#x8BB8;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x53C2;&#x6570;&#x7684;&#x9009;&#x62E9;&#x592A;&#x5E7C;&#x7A1A;&#xFF0C;&#x6807;&#x51C6;&#x7684; PoS &#x5B9E;&#x73B0;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x8868;&#x73B0;&#x51FA;&#x6781;&#x7AEF;&#x7684;&#x4E0D;&#x5747;&#x8861;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x601D;&#x8003;&#x8FD9;&#x6837;&#x4E00;&#x4E2A; PoS &#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5B83;&#x5C06;&#x5168;&#x90E8;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x5956;&#x52B1;&#x7ED9;&#x4E86;&#x6BCF;&#x4E2A;&#x5757;&#x7684;&#x51FA;&#x5757;&#x8005;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x51E0;&#x4E4E;&#x88AB;&#x7528;&#x4E8E;&#x76EE;&#x524D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A; PoS &#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4E2D;&#x3002;&#x518D;&#x8FDB;&#x4E00;&#x6B65;&#x5047;&#x8BBE;&#xFF0C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x88AB;&#x7ACB;&#x5373;&#x5E76;&#x5165;&#x5230;&#x5404;&#x65B9;&#x7684;&#x51FA;&#x5757;&#x6743;&#x76CA;&#x6C60;&#x4EFD;&#x989D;&#x4E2D;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x521D;&#x59CB;&#x5316;&#x5230;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x76F8;&#x5F53;&#x7684;&#x53C2;&#x6570;&#xFF1A;50 &#x4E2A;&#x521D;&#x59CB;&#x4EE3;&#x5E01;&#x548C; 50 &#x4E2A;&#x4EE3;&#x5E01;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x3002;&#x5982;&#x679C;&#x7532;&#x65B9;&#x62E5;&#x6709;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x7684;\(\frac 1 3\)&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6CE2;&#x5229;&#x4E9A;&#x575B;&#x5B50;&#x6A21;&#x578B;&#x8BBA;&#x636E;&#x8868;&#x660E;&#xFF0C;&#x5F53;&#x533A;&#x5757;&#x957F;&#x5EA6;&#x8D8B;&#x4E8E;&#x65E0;&#x7A77;&#x5927;&#x65F6;&#xFF0C;&#x7532;&#x65B9;&#x7684;&#x6781;&#x9650;&#x6743;&#x76CA;&#x51E0;&#x4E4E;&#x80AF;&#x5B9A;&#x4F1A;&#x6536;&#x655B;&#x4E8E;&#x4E00;&#x4E2A;&#x9075;&#x5FAA; \(&#x3B2;(\frac 1 3,\frac 2 3)\) &#x5206;&#x5E03;&#x7684;&#x968F;&#x673A;&#x53D8;&#x91CF;&#xFF0C;&#x76F4;&#x89C2;&#x663E;&#x793A;&#x5728;&#x56FE;7.2&#x4E2D;&#xFF0C;&#x7528;&#x2018;Constant Rewards, PoS&#x2019;&#x6807;&#x8BB0;&#x7684;&#x84DD;&#x8272;&#x5B9E;&#x66F2;&#x7EBF;&#x3002;</p>
</div>
<div class="paragraph">
<p><span class="image"><img src="icons/Stake_distribution.png" alt="Figure 7.2"></span></p>
</div>
<div class="paragraph">
<p><span class="small">Figure 7.2: Limiting stake distribution of a party with 1/3 stake, under a PoS and PoW system initialized with Bitcoin&#x2019;s block reward parameters.&#xFF08;&#x56FE;7.2&#xFF1A;&#x5728;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x53C2;&#x6570;&#x521D;&#x59CB;&#x5316;&#x7684;POS&#x548C;POW&#x7CFB;&#x7EDF;&#x4E0B;&#xFF0C;&#x6301;&#x6709;1/3&#x80A1;&#x6743;&#x65B9;&#x7684;&#x6781;&#x9650;&#x6743;&#x76CA;&#x5206;&#x5E03;&#x3002;&#xFF09;</span></p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>An important and troublesome property of this Beta distribution is the high probability mass near 0 and 1. Effectively, this means that party A can end up with extremely high or low stake percentages, simply through the natural randomness of the PoS leader election protocol. Moreover, this convergence occurs quickly in practice. In contrast, the black dashed curve illustrates the stake distribution for PoW after T = 1,000 blocks, using the same constant block reward function as Bitcoin. Notice that the PoW curve is substantially more concentrated around party A&#x2019;s initial stake deposit. A natural question is whether any block reward function can produce a limiting stake distribution comparable to the black curve in a PoS setting. Our objective in this section is to explore this phenomenon more formally; we theoretically demonstrate how compounding affects fairness in PoS systems, both as an effect of the block reward function and the initial conditions of the system. To this end, we introduce a new metric called equitability, which intuitively measures how much a party can augment or decrease their fractional stake over time. We show that no block reward function can achieve the same degree of equitability as PoW, while also introducing a new geometric reward function that is maximally equitable over all reward functions. Figure 7.2 illustrates the empirical stake distribution of geometric rewards over T = 1,000 slots as a green histogram; notice that it is closer, but not the same, as the PoW baseline. This is a fundamental price we pay for the efficiency of PoS. Despite the fact that PoS cannot achieve the same equitability as PoW, we &#xFB01;nd that through proper system initialization, these e&#xFB00;ects can be dramatically mitigated. In particular, our &#xFB01;ndings give concrete guidelines for choosing the size of the initial stake pool, and the amount of rewards that should be disseminated over time, in order to ensure an acceptable level of equitability.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8D1D;&#x5854;&#x5206;&#x5E03;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x4E14;&#x9EBB;&#x70E6;&#x7684;&#x7279;&#x6027;&#x5C31;&#x662F;&#x4F1A;&#x5927;&#x6982;&#x7387;&#x5730;&#x96C6;&#x4E2D;&#x5728;0&#x5230;1&#x9644;&#x8FD1;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x53EA;&#x8981;&#x901A;&#x8FC7;PoS&#x9886;&#x8896;&#x9009;&#x4E3E;&#x534F;&#x8BAE;&#x7684;&#x81EA;&#x7136;&#x968F;&#x673A;&#x6027;&#xFF0C;&#x7532;&#x65B9;&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x6781;&#x9AD8;&#x6216;&#x6781;&#x4F4E;&#x7684;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x79CD;&#x6536;&#x655B;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x4E5F;&#x5F88;&#x5FEB;&#x53D1;&#x751F;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x9ED1;&#x8272;&#x865A;&#x7EBF;&#x8BF4;&#x660E;&#x4E86; T=1000 &#x4E2A;&#x533A;&#x5757;&#x540E;&#x7684; POW &#x7684;&#x6743;&#x76CA;&#x5206;&#x5E03;&#xFF0C;&#x4F7F;&#x7528;&#x5730;&#x662F;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x76F8;&#x540C;&#x7684;&#x5E38;&#x91CF;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x3002;&#x6CE8;&#x610F;&#xFF0C;PoW &#x66F2;&#x7EBF;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x66F4;&#x591A;&#x7684;&#x96C6;&#x4E2D;&#x5728;&#x7532;&#x65B9;&#x7684;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x5B58;&#x6B3E;&#x4E0A;&#x3002;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x5728; PoS &#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x4E2D;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x4EFB;&#x4F55;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x548C;&#x9ED1;&#x8272;&#x66F2;&#x7EBF;&#x76F8;&#x5F53;&#x7684;&#x6781;&#x9650;&#x6743;&#x76CA;&#x5206;&#x5E03;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x8282;&#x4E2D;&#x7684;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x66F4;&#x6B63;&#x5F0F;&#x5730;&#x7814;&#x7A76;&#x8FD9;&#x4E00;&#x73B0;&#x8C61;&#xFF1B;&#x6211;&#x4EEC;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x8BC1;&#x660E;&#x4E86;&#x4E0D;&#x540C;&#x914D;&#x5236;&#x7EC4;&#x5408;&#x5728; PoS &#x7CFB;&#x7EDF;&#x4E2D;&#x5BF9;&#x516C;&#x5E73;&#x6027;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x65E2;&#x662F;&#x4F5C;&#x4E3A;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4E5F;&#x662F;&#x7CFB;&#x7EDF;&#x521D;&#x59CB;&#x6761;&#x4EF6;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x8FDB;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#xFF0C;&#x79F0;&#x4F5C;&#x201C;&#x5747;&#x8861;&#x6027;&#x201D;&#xFF0C;&#x5B83;&#x76F4;&#x89C2;&#x5730;&#x5EA6;&#x91CF;&#x4E86;&#x67D0;&#x4E00;&#x65B9;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x80FD;&#x591F;&#x589E;&#x52A0;&#x6216;&#x51CF;&#x5C11;&#x5176;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#x3002;&#x6211;&#x4EEC;&#x8868;&#x660E;&#x4E86;&#x6CA1;&#x6709;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x548C; PoW &#x540C;&#x6837;&#x6C34;&#x5E73;&#x7684;&#x5747;&#x8861;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x51FD;&#x6570;&#xFF0C;&#x904D;&#x53CA;&#x6240;&#x6709;&#x7684;&#x5956;&#x52B1;&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x6700;&#x5927;&#x516C;&#x5E73;&#x7684;&#x51FD;&#x6570;&#x3002;&#x56FE;7.2&#x4EE5;&#x7EFF;&#x8272;&#x67F1;&#x72B6;&#x56FE;&#x7684;&#x5F62;&#x5F0F;&#x8BF4;&#x660E;&#x4E86; T=1000 &#x4E2A;&#x69FD;&#x7684;&#x7ECF;&#x9A8C;&#x6027;&#x7684;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x6743;&#x76CA;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#xFF1B;&#x6CE8;&#x610F;&#xFF0C;&#x5B83;&#x4E0E; PoW &#x57FA;&#x7EBF;&#x66F4;&#x63A5;&#x8FD1;&#xFF0C;&#x4F46;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x4E3A; PoS &#x7684;&#x6548;&#x7387;&#x4ED8;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x4EE3;&#x4EF7;&#x3002;&#x5C3D;&#x7BA1; PoS &#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x4E0E; PoW &#x76F8;&#x540C;&#x7684;&#x5747;&#x8861;&#x6027;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x901A;&#x8FC7;&#x9002;&#x5F53;&#x7684;&#x7CFB;&#x7EDF;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x8FD9;&#x4E9B;&#x5F71;&#x54CD;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x51CF;&#x8F7B;&#x3002;&#x5C24;&#x5176;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7814;&#x7A76;&#x7ED3;&#x679C;&#x5BF9;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6C60;&#x89C4;&#x6A21;&#x7684;&#x9009;&#x62E9;&#x7ED9;&#x51FA;&#x4E86;&#x5177;&#x4F53;&#x7684;&#x53C2;&#x8003;&#xFF0C;&#x800C;&#x5956;&#x52B1;&#x7684;&#x91CF;&#x4E5F;&#x5E94;&#x8BE5;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x800C;&#x6563;&#x5E03;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x5747;&#x8861;&#x5EA6;&#x6C34;&#x5E73;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Model  We begin with some notation modeling a simple chain-based proof-of-stake system. We consider  \(m\)  parties: \(\mathcal{A}\)\(= {A_1,...,A_m }\). We assume that all parties keep all of their stake in the proposal stake pool, which is a pool of tokens that is used to choose the next proposer. As before, we consider a discrete-time system, \(n = 1,2,...,T\), where each time slot corresponds to the addition of one block to the blockchain. In reality, new blocks may not arrive at perfectly-synchronized time intervals, but we index the system by block arrivals. For any integer \(x\), we use the notation \([x]:= {1, 2, ..., x}\). We call the time interval \([T]\) an <em>epoch</em>: a period of time (blocks) during which a pre-specified number of inflation tokens should be dispensed. In Bitcoin, for example, an epoch lasts about four years, or 210,000 blocks; this is the time period over which the block reward function remains constant prior to the halving events.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x5EFA; &#x6A21;</strong> &#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E9B;&#x7B26;&#x53F7;&#x5F00;&#x59CB;&#x5EFA;&#x6A21;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x57FA;&#x4E8E;&#x94FE;&#x7684;PoS&#x7CFB;&#x7EDF;&#x3002;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x6709; \(m\) &#x4E2A;&#x76F8;&#x5173;&#x65B9;&#xFF1A;\(\mathcal{A}\)\(= {A_1,...,A_m }\) &#x4EE3;&#x8868;&#x6240;&#x6709;&#x76F8;&#x5173;&#x65B9;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x5404;&#x65B9;&#x90FD;&#x5C06;&#x5176;&#x6743;&#x76CA;&#x4EE3;&#x5E01;&#x4FDD;&#x7559;&#x5728;&#x51FA;&#x5757;&#x6743;&#x76CA;&#x6C60;&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x9009;&#x62E9;&#x4E0B;&#x4E00;&#x4E2A;&#x51FA;&#x5757;&#x4EBA;&#x7684;&#x4EE3;&#x5E01;&#x6C60;&#x3002;&#x548C;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x6309;&#x7167;&#x4E00;&#x4E2A;&#x79BB;&#x6563;&#x65F6;&#x95F4;&#x7CFB;&#x7EDF;&#x6765;&#x8003;&#x8651;&#xFF0C;\(n = 1,2,...,T\)&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x95F4;&#x9699;&#x5BF9;&#x5E94;&#x4E8E;&#x5411;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x65B0;&#x7684;&#x533A;&#x5757;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x4EE5;&#x5B8C;&#x5168;&#x540C;&#x6B65;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5230;&#x8FBE;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x533A;&#x5757;&#x7684;&#x5230;&#x8FBE;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x7D22;&#x5F15;&#x3002;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x6574;&#x6570; \(x\)&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49; \([x]:= {1, 2, ..., x}\)&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x65F6;&#x95F4;&#x95F4;&#x9694; \([T]\) &#x4E3A;&#x4E00;&#x4E2A;&#x7EAA;&#x5143;&#xFF1A;&#x8FD9;&#x662F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF08;&#x6216;&#x8005;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x533A;&#x5757;&#xFF09;&#xFF0C;&#x5728;&#x6B64;&#x671F;&#x95F4;&#xFF0C;&#x5E94;&#x5B8C;&#x6210;&#x9884;&#x5148;&#x6307;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x6D41;&#x901A;&#x4EE3;&#x5E01;&#x7684;&#x5206;&#x914D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x7EAA;&#x5143;&#x6301;&#x7EED;&#x56DB;&#x5E74;&#xFF0C;&#x6216;&#x8005;&#x8BF4;210000&#x4E2A;&#x533A;&#x5757;&#xFF1B;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#xFF0C;&#x5728;&#x51CF;&#x534A;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x4E4B;&#x524D;&#xFF0C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>For all \(i \in [m]\), let \(S_(A_i) (n)\) denote the total stake held by party \(A_i\) in the proposal stake pool at time \(n\). We let \(S(n) = \sum_{i=1}^m [S_(A_i) (n)]\) denote the total stake in the proposer stake pool at time n, and \(\upsilon_{A_i} (n)\) denotes the fractional stake of node \(A_i\) at time  \(n\): \(\upsilon_{A_i} (n) = \frac {S_(A_i) (n)} {S(n)}\). For simplicity, we normalize the initial stake pool size to \(S(0)=1\); each party starts with \(S_{A_i} (0) = \upsilon_(A_i) (0)\) fraction of the original stake.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684; \(i \in [m]\)&#xFF0C;&#x7528; \(S_(A_i) (n)\) &#x8868;&#x793A;&#x5728;&#x65F6;&#x95F4; \(n\) &#x67D0;&#x4E00;&#x65B9; \(A_i\) &#x5728;&#x51FA;&#x5757;&#x6743;&#x76CA;&#x6C60;&#x4E2D;&#x6240;&#x5360;&#x7684;&#x6743;&#x76CA;&#x603B;&#x989D;&#x3002;&#x7528; \(S(n) = \sum_{i=1}^m [S_{A_i} (n)]\) &#x8868;&#x793A;&#x5728;&#x65F6;&#x95F4; \(n\) &#x65F6;&#x51FA;&#x5757;&#x6743;&#x76CA;&#x6C60;&#x4E2D;&#x7684;&#x5168;&#x90E8;&#x6743;&#x76CA;&#x603B;&#x989D;&#xFF0C;&#x800C;\(\upsilon_{A_i} (n)\) &#x8868;&#x793A;&#x8282;&#x70B9; \(A_i\) &#x5728;&#x65F6;&#x95F4; \(n\) &#x65F6;&#x7684;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#xFF0C;&#x5373;&#xFF1A;\(\upsilon_{A_i} (n) = \frac {S_(A_i) (n)} {S(n)}\)&#x3002;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6C60;&#x5927;&#x5C0F;&#x6807;&#x51C6;&#x5316;&#x4E3A; S(0)=1&#xFF1B;&#x5219;&#x5404;&#x65B9;&#x5F00;&#x59CB;&#x65F6;&#x7684;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x4E3A;&#xFF1A;\(S_{A_i} (0) = \upsilon_(A_i) (0)\)&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>At each time slot \(n \in [T]\) &#xFF0C;the system chooses a proposer node \(W(n) \in \mathcal{A}\) such that</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x6BB5;n&#xFF0C; \(n \in [T]\)&#xFF0C;&#x7CFB;&#x7EDF;&#x9009;&#x51FA;&#x4E00;&#x4E2A;&#x51FA;&#x5757;&#x8282;&#x70B9; \(W(n)\)&#xFF0C; \(W(n) \in \mathcal{A}\)&#xFF0C;&#x5373;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ W(n)=\left \{ \begin {array} {c} {A_{1}} &amp; {w.p.} &amp; {\upsilon_{A_{1}}(n)} \\ {\dots} \\ {A_{m}} &amp; {w.p.} &amp; {\upsilon_{A_{m}}(n)} \end {array} \right.
\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \  (7.6)
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Upon being selected as a proposer, \(W(n)\) appends a block to the blockchain. As compensation for this service, \(W(n)\) receives a block reward of \(r(n)\) stake, which is immediately added to its allocation in the proposer pool. That is,</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5F53;&#x88AB;&#x9009;&#x4E3A;&#x51FA;&#x5757;&#x4EBA;&#x65F6;&#xFF0C;\(W(n)\) &#x5C31;&#x4F1A;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5230;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x3002;&#x4E3A;&#x4E86;&#x8865;&#x507F;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;\(W(n)\) &#x4F1A;&#x83B7;&#x5F97;&#x4E00;&#x4EFD;&#x8BA1;&#x4E3A; \(r(n)\) &#x6743;&#x76CA;&#x503C;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#xFF0C;&#x8FD9;&#x4EFD;&#x5956;&#x52B1;&#x4F1A;&#x7ACB;&#x5373;&#x5728;&#x51FA;&#x5757;&#x6C60;&#x4E2D;&#x88AB;&#x5206;&#x914D;&#x3002;&#x5373;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ S_{W(n)}(n+1)=S_{W(n)}(n)+r(n)
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The reward \(r(n)\) is freshly-minted at each time step, so it causes the total number of tokens to grow. We assume the total reward dispensed in time period \(T\) is &#xFB01;xed, so \(\sum_{n=1}^{T} r(n) = R\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x4EFD; \(r(n)\) &#x7684;&#x5956;&#x52B1;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x65B0;&#x94F8;&#x9020;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4F7F;&#x5F97;&#x4EE3;&#x5E01;&#x7684;&#x603B;&#x6570;&#x91CF;&#x5728;&#x589E;&#x957F;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x5728;&#x65F6;&#x95F4;&#x5468;&#x671F;T&#x88AB;&#x5206;&#x914D;&#x7684;&#x5956;&#x52B1;&#x603B;&#x91CF;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x5373; \(\sum_{n=1}^{T} r(n) = R\)&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Consider a closed PoS system where no stake is taken out of or put into the proposal stake pool over a fixed period of time T. The only changes to the stake of each party during this interval are due to the compounding effects of the rewards earned in proposing new blocks. At each (discrete) time step, a block reward is dispensed according to the randomized proposer election in Eq. (7.6). This is immediately added to the stake of the elected proposer. We focus on the scenario where every party follows protocol as a starting point.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8003;&#x8651;&#x5230;&#x4E00;&#x4E2A;&#x5C01;&#x95ED;&#x7684;PoS&#x7CFB;&#x7EDF;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5468;&#x671F;T&#x5185;&#xFF0C;&#x51FA;&#x5757;&#x6743;&#x76CA;&#x6C60;&#x4E2D;&#x4E0D;&#x4F1A;&#x6709;&#x6743;&#x76CA;&#x4EE3;&#x5E01;&#x88AB;&#x53D6;&#x51FA;&#x6216;&#x8005;&#x65B0;&#x589E;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5185;&#xFF0C;&#x6BCF;&#x4E00;&#x65B9;&#x6743;&#x76CA;&#x7684;&#x552F;&#x4E00;&#x53D8;&#x5316;&#x662F;&#x7531;&#x4E8E;&#x65B0;&#x51FA;&#x5757;&#x5956;&#x52B1;&#x6DF7;&#x5408;&#x8FDB;&#x6765;&#x9020;&#x6210;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#xFF08;&#x79BB;&#x6563;&#x7684;&#xFF09;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#xFF0C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x5C06;&#x88AB;&#x5206;&#x914D;&#x7ED9;&#x968F;&#x673A;&#x9009;&#x62E9;&#x51FA;&#x6765;&#x7684;&#x51FA;&#x5757;&#x4EBA;&#xFF0C;&#x6B63;&#x5982;&#x65B9;&#x7A0B;&#xFF08;7.6&#xFF09;&#x6240;&#x793A;&#x3002;&#x8FD9;&#x5C06;&#x7ACB;&#x5373;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x6240;&#x9009;&#x7684;&#x51FA;&#x5757;&#x4EBA;&#x7684;&#x6743;&#x76CA;&#x4E2D;&#x53BB;&#x3002;&#x6211;&#x4EEC;&#x81F4;&#x529B;&#x4E8E;&#x8BA9;&#x6BCF;&#x4E00;&#x65B9;&#x90FD;&#x4EE5;&#x9075;&#x5FAA;&#x534F;&#x8BAE;&#x4E3A;&#x8D77;&#x70B9;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Common reward functions</strong>    Between checkpoints, we can choose any block reward schedule \(r(n)\) that respects the total reward constraint of R. A natural choice, famously adopted in Bitcoin, is the <strong>constant block reward function</strong>, defined as:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x5E38;&#x89C1;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;</strong>   &#x5728;&#x5141;&#x8BB8;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4EFB;&#x4F55;&#x53D7;&#x603B;&#x5956;&#x52B1; \(R\) &#x7EA6;&#x675F;&#x7684;&#x533A;&#x5757;&#x5956;&#x52B1;&#x8BA1;&#x5212; \(r(n)\)&#x3002;&#x5728;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E2A;<strong>&#x5E38;&#x91CF;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;</strong>&#xFF0C;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ r_{c}(n) : = \frac {R} {T}
\ \ \ \ \ \  \ \ \ \ \ \ (7.7)
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Perhaps surprisingly, we &#xFB01;nd that \(r_c\) introduce inequitability to the block reward scheme if initialized improperly. Critically, this can happen without any strategic behavior from any of the participants. Rather, it is the combined effect of compounding stake and randomized leader election that causes this effect. A main result of this work is that a <strong>geometric reward function</strong>, defined as</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4E5F;&#x8BB8;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5982;&#x679C;&#x521D;&#x59CB;&#x5316;&#x4E0D;&#x5F53;&#xFF0C;\(r_c\) &#x4F1A;&#x7ED9;&#x5757;&#x5956;&#x52B1;&#x65B9;&#x6848;&#x5F15;&#x5165;&#x4E0D;&#x5747;&#x8861;&#x6027;&#x3002;&#x66F4;&#x4E25;&#x91CD;&#x5730;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x5728;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53C2;&#x4E0E;&#x8005;&#x505A;&#x51FA;&#x8FC7;&#x4EFB;&#x4F55;&#x6218;&#x7565;&#x6027;&#x884C;&#x4E3A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8FD9;&#x662F;&#x590D;&#x5408;&#x6743;&#x76CA;&#x548C;&#x9886;&#x5BFC;&#x4EBA;&#x7684;&#x968F;&#x673A;&#x9009;&#x62E9;&#x9020;&#x6210;&#x7684;&#x7EFC;&#x5408;&#x5F71;&#x54CD;&#x3002;&#x4EA7;&#x751F;&#x7684;&#x4E3B;&#x8981;&#x7684;&#x6548;&#x679C;&#x53EF;&#x4EE5;&#x5F52;&#x7ED3;&#x6210;&#x4E00;&#x4E2A;<strong>&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x51FD;&#x6570;</strong>&#xFF0C;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\ r_{g}(n) := (1+R)^{\frac {n} {T} } - (1+R)^{\frac{n-1}{T}}
\ \ \ \ \ \  \ \ \ \ \ \ \ \ \ \ (7.8)
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>provably minimizes inequitability and exhibits a number of other desirable properties. Although geometric rewards may not be appropriate for deployment in a real cryptocurrency for various practical reasons, this work helps us to methodically choose system parameters, such as initial stake pool size.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x4F1A;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x4E0D;&#x5747;&#x8861;&#x6027;&#xFF0C;&#x5E76;&#x8868;&#x73B0;&#x51FA;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x7406;&#x60F3;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5C3D;&#x7BA1;&#xFF0C;&#x56E0;&#x4E3A;&#x5404;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x5728;&#x771F;&#x5B9E;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x4E2D;&#x90E8;&#x7F72;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x5408;&#x9002;&#xFF0C;&#x4F46;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x6709;&#x6761;&#x7406;&#x5730;&#x9009;&#x62E9;&#x7CFB;&#x7EDF;&#x53C2;&#x6570;&#xFF0C;&#x4F8B;&#x5982;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6C60;&#x89C4;&#x6A21;&#x3002;</p>
</div>
<div class="sect3">
<h4 id="_7_2_3_1_equitability">7.2.3.1  Equitability&#xFF08;&#x5747;&#x8861;&#x6027;&#xFF09;</h4>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>We study the stochastic dynamics of the fractional stake of one of the participating parties \(A\), who started with \(\upsilon_A(0)\) fraction of the initial total stake of \(S(0) = 1\). This is without loss of generality, as the random process is homogeneous in scaling both \(R\) and \(S(0)\) by a constant. We denote this fractional stake at time n by \(\upsilon_{A,r} (n)\), to make the dependency on the reward function explicit.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E86;&#x5176;&#x4E2D;&#x67D0;&#x4E00;&#x4E2A;&#x53C2;&#x4E0E;&#x65B9; \(A\) &#x7684;&#x6743;&#x76CA;&#x4EFD;&#x989D;&#x7684;&#x968F;&#x673A;&#x52A8;&#x6001;&#xFF0C;&#x8BE5;&#x53C2;&#x4E0E;&#x65B9; \(A\) &#x7684;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x662F; \(\upsilon_A(0)\)&#xFF0C;\(\upsilon_A(0)\)&#x4EE3;&#x8868;&#x5728;&#x521D;&#x59CB;&#x603B;&#x6743;&#x76CA; (\(S(0) = 1\)) &#x4E2D;&#x7684;&#x5360;&#x6BD4;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x5931;&#x4E00;&#x822C;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x968F;&#x673A;&#x8FC7;&#x7A0B;&#x53EA;&#x662F;&#x540C;&#x8D28;&#x6027;&#x5730;&#x5C06; \(R\) &#x548C; \(S(0)\) &#x7F29;&#x653E;&#x4E86;&#x5E38;&#x6570;&#x500D;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x5728;&#x65F6;&#x95F4; \(n\) &#x65F6;&#x5730;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x8868;&#x793A;&#x4E3A; \(\upsilon_{A,r} (n)\)&#xFF0C;&#x4EE5;&#x660E;&#x786E;&#x5BF9;&#x5757;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>One desired property of a closed and fair PoS system is that the fractional stake should remain constant over time in expectation. If  \(A\) contributes 10% of the proposal stake pool at the beginning of the time, then \(A\) should, on average, reap 10% of the total disseminated rewards. As randomness in the proposer election is essential to current PoS systems, this cannot be ensured deterministically. Instead, the popular choice of electing a proposer (in Eq (7.6)) with probability proportional to the fractional stake ensures that this holds in expectation. Formally, for all \(n \in [T]\),</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4E00;&#x4E2A;&#x5C01;&#x95ED;&#x4E14;&#x516C;&#x5E73;&#x7684; PoS &#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x5C5E;&#x6027;&#x5C31;&#x662F;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x5728;&#x671F;&#x671B;&#x503C;&#x4E0A;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x5982;&#x679C;&#x5728;&#x6700;&#x5F00;&#x59CB;&#xFF0C;\(A\) &#x5C31;&#x4E3A;&#x51FA;&#x5757;&#x6743;&#x76CA;&#x6C60;&#x8D21;&#x732E;&#x4E86; 10% &#x7684;&#x6743;&#x76CA;&#x4EE3;&#x5E01;&#xFF0C;&#x90A3;&#x4E48; \(A\) &#x4E5F;&#x5E94;&#x8BE5;&#xFF0C;&#x5E73;&#x5747;&#x4E0B;&#x6765;&#xFF0C;&#x83B7;&#x5F97;&#x603B;&#x5206;&#x914D;&#x5956;&#x52B1;&#x7684; 10%&#x3002;&#x7531;&#x4E8E;&#x51FA;&#x5757;&#x4EBA;&#x9009;&#x62E9;&#x7684;&#x968F;&#x673A;&#x6027;&#x662F;&#x5F53;&#x524D; PoS &#x7CFB;&#x7EDF;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x786E;&#x5207;&#x5730;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5728;&#x516C;&#x5F0F; \((7.6)\)&#x4E2D;&#x7684;&#x8FD9;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x51FA;&#x5757;&#x4EBA;&#x9009;&#x62E9;&#x65B9;&#x6CD5;&#x4E0B;&#xFF0C;&#x80FD;&#x591F;&#x786E;&#x4FDD;&#x8FD9;&#x4E00;&#x70B9;&#x7B26;&#x5408;&#x671F;&#x671B;&#xFF0C;&#x56E0;&#x4E3A;&#x88AB;&#x9009;&#x4E2D;&#x7684;&#x6982;&#x7387;&#x662F;&#x540C;&#x5176;&#x6743;&#x76CA;&#x4EFD;&#x989D;&#x6210;&#x6BD4;&#x4F8B;&#x7684;&#x3002;&#x5F62;&#x5F0F;&#x4E0A;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684; \(n \in [T]\)&#xFF0C;&#x6709;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\mathbb{E} \left[\upsilon_{A,r} (n)\right] = \upsilon_{A} (0)
\ \ \ \ \ \ \ \ \ \ \ \ \ \ \  (7.9)
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The expected fractional reward for any party stays constant in expectation, irrespective of which reward function is used. This follows from the law of total expectation and the fact that</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x65E0;&#x8BBA;&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x5956;&#x52B1;&#x51FD;&#x6570;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x7684;&#x671F;&#x671B;&#x5956;&#x52B1;&#x6BD4;&#x4F8B;&#x5728;&#x671F;&#x671B;&#x503C;&#x4E0A;&#x90FD;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x8FD9;&#x6765;&#x6E90;&#x4E8E;<strong>&#x603B;&#x671F;&#x671B;&#x5B9A;&#x5F8B;</strong>&#x548C;&#x4EE5;&#x4E0B;&#x4E8B;&#x5B9E;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\[
\begin{array} {l} {\mathbb{E} \left[ \upsilon_{A,r} (n) \mid \upsilon_{A, r}(n-1) = \upsilon \right]}
\\ {=\upsilon \frac{\upsilon S(n-1)+r(n-1)} {S(n)} + (1 - \upsilon) \frac {\upsilon S(n-1)} {S(n)}}
\\ {=v}\end{array}
\]</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>where \(S(n)\) is the total stake at time \(n\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5176;&#x4E2D;&#xFF0C;\(S(n)\) &#x662F;&#x65F6;&#x95F4; \(n\) &#x65F6;&#x7684;&#x603B;&#x6743;&#x76CA;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Even with the same expected fractional stake, the choice of the reward function can change the distribution of the final stake dramatically. We propose using the variance of the final fractional stake, Var\((\upsilon_{A,r} (T))\), to measure the level of uncertainty for different choices of the reward function.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5373;&#x4F7F;&#x5728;&#x76F8;&#x540C;&#x7684;&#x9884;&#x671F;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x4E0B;&#xFF0C;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x7684;&#x9009;&#x62E9;&#x4E5F;&#x4F1A;&#x663E;&#x8457;&#x6539;&#x53D8;&#x6700;&#x7EC8;&#x6743;&#x76CA;&#x7684;&#x5206;&#x914D;&#x3002;&#x6211;&#x4EEC;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x6700;&#x7EC8;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x7684;<strong>&#x65B9;&#x5DEE;</strong>&#xFF0C;Var\((\upsilon_{A,r} (T))\)&#xFF0C;&#x6765;&#x8861;&#x91CF;&#x4E0D;&#x540C;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x9009;&#x62E9;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x6C34;&#x5E73;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><em><strong>De&#xFB01;nition 7.2.1.</strong>   For two reward functions \(r_1\): \([T] \rightarrow \mathbb{R}^{+}\) and \(r_2\): \([T] \rightarrow \mathbb{R}^{+}\) with the same total reward, \(\sum_{n=1}^{T} r_{1}(n) = \sum_{n=1}^{T} r_{2}(n)\), we say \(r_1\) is more equitable than \(r_2\) if</em></p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5B9A;&#x4E49;7.2.1.    &#x5BF9;&#x4E8E;&#x4E24;&#x4E2A;&#x5956;&#x52B1;&#x51FD;&#x6570; \(r_1\): \([T] \rightarrow \mathbb{R}^{+}\) &#x548C; \(r_2\): \([T] \rightarrow \mathbb{R}^{+}\) &#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x603B;&#x5956;&#x52B1;&#x503C;&#xFF0C;&#x5373;&#xFF0C;&#x5982;&#x679C;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#xFF08;&#x5373; \(r_1\) &#x5BF9;&#x5E94;&#x7684;&#x6700;&#x7EC8;&#x6743;&#x76CA;&#x6BD4;&#x4F8B;&#x7684;&#x65B9;&#x5DEE;&#x5C0F;&#x4E8E; \(r_2\) &#x7684;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8BF4; \(r_1\) &#x6BD4; \(r_2\) &#x66F4;&#x516C;&#x5E73;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\operatorname{Var}\left(\upsilon_{A,r_{1}} (T)\right) \leq \operatorname{Var}\left(\upsilon_{A, r_{2}}(T)\right)
\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ (7.10)
\end{equation}</p>
</div>
<div class="paragraph">
<p><em>&#xFF08;&#x6620;&#x5C04; \(r: [T] \rightarrow \mathbb{R}^{+}\)&#x5373;&#x4E3A;&#x4ECE;&#x96C6;&#x5408; \([T]\) &#x5230;&#x5B9E;&#x6570;&#x96C6; \(\mathbb{R}^{+}\) &#x7684;&#x51FD;&#x6570; \(r(n)\)&#xFF0C;&#x5B9A;&#x4E49;&#x57DF; \(n \in [T]\)&#xFF0C;&#x51FD;&#x6570;&#x503C;&#x5728;&#x5B9E;&#x6570;&#x8303;&#x56F4;&#x5185;&#x3002;&#xFF09;</em></p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>With this notion of equitability, there is a core optimization problem of interest to a PoS system designer: given a fixed total reward \(R\) to be dispensed, how do we distribute it over the time \(T\) to achieve the highest equitability? Perhaps surprisingly, we show that this optimization has a simple closed form solution.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6709;&#x4E86;&#x8FD9;&#x79CD;&#x5747;&#x8861;&#x6027;&#x7684;&#x6982;&#x5FF5;&#xFF0C;PoS&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x8005;&#x5C31;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x7684;&#x5229;&#x76CA;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x4E0D;&#x53D8;&#x7684;&#x5F85;&#x5206;&#x914D;&#x5956;&#x52B1;&#x603B;&#x989D; \(R\)&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x5728;&#x6574;&#x4E2A;&#x65F6;&#x95F4;&#x5468;&#x671F; \(T\) &#x5185;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5206;&#x914D;&#x624D;&#x80FD;&#x5B9E;&#x73B0;&#x6700;&#x9AD8;&#x7684;&#x5747;&#x8861;&#x6027;&#x5462;&#xFF1F;&#x4E5F;&#x8BB8;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#xFF0C;&#x6211;&#x4EEC;&#x8BC1;&#x660E;&#x4E86;&#x8FD9;&#x79CD;&#x4F18;&#x5316;&#x6709;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x5C01;&#x95ED;&#x5F0F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><em><strong>Theorem 2.</strong>  The geometric reward \(r_g\) defined in (7.8) achieves the highest equitability.</em></p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x5B9A;  &#x7406; 2.</strong>   &#x5728;&#x516C;&#x5F0F;&#xFF08;7.8&#xFF09;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x51FD;&#x6570; \(r_g\) &#x5B9E;&#x73B0;&#x4E86;&#x6700;&#x9AD8;&#x5747;&#x8861;&#x6027;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>If equitability is a primary design goal, this gives the optimal reward function. Intuitively, one might prefer to dispense larger rewards towards the end, when the stake pool is also large. At the same time, one needs to dispense some reward in the beginning to grow the stake pool. The optimal trade-off is met with the geometrically increasing reward.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5982;&#x679C;&#x5747;&#x8861;&#x6027;&#x662F;&#x9996;&#x8981;&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#xFF0C;&#x8FD9;&#x5C31;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x6700;&#x4F73;&#x7684;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x3002;&#x76F4;&#x89C2;&#x5730;&#x8BF4;&#xFF0C;&#x5F53;&#x80A1;&#x4EFD;&#x6C60;&#x4E5F;&#x5F88;&#x5927;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x53EF;&#x80FD;&#x66F4;&#x559C;&#x6B22;&#x4E00;&#x76F4;&#x5230;&#x6700;&#x540E;&#x90FD;&#x5206;&#x914D;&#x5230;&#x66F4;&#x5927;&#x7684;&#x5956;&#x52B1;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x9700;&#x8981;&#x5728;&#x5F00;&#x59CB;&#x5C31;&#x5206;&#x914D;&#x4E00;&#x4E9B;&#x5956;&#x52B1;&#x6765;&#x6269;&#x5927;&#x5176;&#x6743;&#x76CA;&#x6C60;&#x3002;&#x4EE5;&#x51E0;&#x4F55;&#x5F62;&#x5F0F;&#x589E;&#x957F;&#x7684;&#x5956;&#x52B1;&#x5C31;&#x662F;&#x6700;&#x4F73;&#x6743;&#x8861;&#x7ED3;&#x679C;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Proof of Theorem 2.</strong>   We prove that</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x5B9A;&#x7406;2. &#x7684;&#x8BC1;&#x660E;</strong>  &#x6211;&#x4EEC;&#x8BC1;&#x660E;&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x6EE1;&#x8DB3; \(r \in \mathbb{R}^{T}\)&#xFF0C;&#x5373; \(r\) &#x7684;&#x53D6;&#x503C;&#x5728;&#x5B9E;&#x6570;&#x96C6;&#x5185;&#xFF0C;&#x4F8B;&#x5982;&#x6EE1;&#x8DB3; \(\sum_{n=1}^{T} r(n) = R\)&#xFF0C;&#x4E14;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x7684;\(n \in [T]\) &#x6709; \(r(n) \geq 0\)&#xFF0C;&#x5219;&#x6709;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\operatorname{Var}\left(\upsilon_{A,r_g} (T)\right) \leq \operatorname{Var}\left(\upsilon_{A, r}(T)\right)
\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ (7.11)
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>for all \(r \in \mathbb{R}^{T}\) such that \(\sum_{n=1}^{T} r(n) = R\) and \(r(n) \geq 0\) for all \(n \in [T]\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8BC1;&#x660E;&#x4E86;&#x5BF9;&#x4E8E;&#x4EE5;&#x4E0B;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF0C;\(r_g\) &#x662F;&#x552F;&#x4E00;&#x7684;&#x6700;&#x4F18;&#x89E3;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\begin{array} {c} \operatorname{minimize}_{r \in \mathbb{R}^{T}} \quad \operatorname{Var}\left(v_{A, r}(T)\right)
\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \  (7.12)
\\ {\text {s.t.} \quad \sum_{n \in[T]} r(n)=R}
\\ {r(n) \geq 0, \forall n \in[T]}\end{array}
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>From the analysis of a time-dependent P&#xF3;lya&#x2019;s urn model [141], we know the variance from the following formula.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x901A;&#x8FC7;&#x5206;&#x6790;&#x4E00;&#x4E2A;&#x4F9D;&#x8D56;&#x4E8E;&#x65F6;&#x95F4;&#x7684;<strong><a href="https://en.wikipedia.org/wiki/P%C3%B3lya_urn_model" target="_blank">&#x6CE2;&#x5229;&#x4E9A;&#x7F50;&#x5B50;&#x6A21;&#x578B;</a></strong>[141]&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x51C6;&#x5219;&#x77E5;&#x9053;&#x4E86;&#x65B9;&#x5DEE;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Lemma 7.2.2.</strong>   Let \(e^{\theta_{n}} \triangleq S(n) / S(n-1)\), then</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x5F15; &#x7406; 7.2.2.</strong>  &#x5B9A;&#x4E49; \(e^{\theta_{n}} \triangleq S(n) / S(n-1)\)&#xFF0C;&#x90A3;&#x4E48;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\operatorname{Var} \left(\upsilon_{A,r} (T)^{2} \right)
\ = \left(\upsilon_{A} (0) - \upsilon_{A} (0)^{2} \right) \left(1 - \frac {S(0)^{2}} {S(T)^{2}} \prod_{n=1}^{T} \left(2 e^{\theta_{n}} - 1 \right) \right)
\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ (7.13)
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>After some affine transformation and taking the logarithmic function of the objective, we get an equivalent optimization of</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x4EFF;&#x5C04;&#x53D8;&#x6362;&#xFF0C;&#x53D6;&#x76EE;&#x6807;&#x7684;&#x5BF9;&#x6570;&#x51FD;&#x6570;&#xFF0C;&#x5F97;&#x5230;&#x76EE;&#x6807;&#x7684;&#x7B49;&#x4EF7;&#x4F18;&#x5316;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\operatorname{maximize}_{\theta \in \mathbb{R}^{T}} \quad \sum_{n=1}^{T} \log \left(2 e^{\theta_{n}} - 1 \right)
\ \quad \quad \quad \quad (7.14)
\end{equation}</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\text {s.t.} \quad {\sum_{n \in[T]} \theta_{n}=\log (1+R)},
\end{equation}</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\quad \quad \quad \quad \quad \quad \theta_{n} \geq 0, \forall n \in[T],
\ \quad \quad \quad \quad \quad (7.15)
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This is a concave maximization on a (rescaled) simplex. Writing out the <strong>KKT conditions</strong> with KKT multipliers \(&#x3BB;\) and \(\{\lambda n\}_{n=1}^{T}\), we get</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#xFF08;&#x91CD;&#x65B0;&#x6807;&#x5EA6;&#xFF09;&#x5355;&#x7EAF;&#x7684;&#x51F9;&#x6781;&#x5927;&#x503C;&#x3002;&#x5199;&#x51FA;<a href="https://www.jianshu.com/p/cec1e052fe87" target="_blank"><strong>KKT&#x6761;&#x4EF6;</strong></a>&#xFF0C;&#x5176;&#x4E2D;KKT&#x4E58;&#x5B50;&#x4E3A; \(&#x3BB;\) &#x800C; \(\{\lambda n\}_{n=1}^{T}\)&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\begin{aligned} \frac {2 e^{\theta_{n}}} {2 e^{\theta_{n}}-1} - \lambda_{n} - \lambda &amp; = 0 \quad \quad \quad \quad (7.16)
\\ \lambda_{n} &amp; \geq 0 \quad \quad \quad \quad (7.17)
\\ \theta_{n} \lambda_{n} &amp;=0 \quad \quad \quad \quad (7.18)
\end{aligned}
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>A solution &#x3B8; to these conditions must satisfy that \(&#x3B8;_n\) is either zero or \(\left(1 /\|\theta\|_{0} \right) \log (1+R)\). Among these solutions, we show that \(\theta^{*}=((\log (1+R)) / T) \mathbb{1}\) is the unique optimal solution, where \(\mathbb{1}\) is a vector of all ones. Consider a solution of the KKT conditions that is not \(\theta^{*}\). Then, we can strictly improve the objective by the following operation. Let \(i,j \in [T]\) denote two coordinates such that \(&#x3B8;_i=0\) and \(&#x3B8;_j&#x2260;0\). Then, we can create \(\tilde{\theta}\)  by mixing \(&#x3B8;_i\) and \(&#x3B8;_j\), such that \(\tilde{\theta}_n = \theta_n\) for all \(n &#x2260; i,j\) and \(\tilde{\theta}_i = \tilde{\theta}_j = (1&#x2044;2)\theta_j\). We claim that \(\tilde{\theta}\) achieves a smaller objective function as \(\log \left(2 e^{\theta_{j}} - 1\right) &lt; 2 \log \left(2 e^{\theta_{j} / 2} - 1\right)\). This follows from Jensen&#x2019;s inequality and strict concavity of the objective function. Hence, \(\theta^{*}\) is the only fixed point of the KKT conditions that cannot be improved upon.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4EE5;&#x4E0A;&#x6761;&#x4EF6;&#x7684; \(\theta\) &#x7684;&#x89E3;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#xFF1A;\(\theta_n\) &#x8981;&#x4E48;&#x662F;&#x96F6;&#xFF0C;&#x8981;&#x4E48;&#x662F; \(\left(1 /\|\theta\|_{0} \right) \log (1+R)\)&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x89E3;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0; \(\theta^{*}=((\log (1+R)) / T) \mathbb{1}\) &#x662F;&#x552F;&#x4E00;&#x6700;&#x4F18;&#x89E3;&#xFF0C;&#x5176;&#x4E2D; \(\mathbb{1}\) &#x662F;&#x5355;&#x4F4D;&#x5411;&#x91CF;&#x3002;&#x5047;&#x60F3;KKT&#x6761;&#x4EF6;&#x7684;&#x4E00;&#x4E2A;&#x89E3;&#x4E0D;&#x662F; \(\theta^{*}\)&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x8FD0;&#x7B97;&#x6765;&#x6539;&#x5584;&#x76EE;&#x6807;&#x3002;&#x8BA9; \(i,j \in [T]\) &#x4EE3;&#x8868;&#x4E24;&#x4E2A;&#x5750;&#x6807;&#xFF0C;&#x5373; \(&#x3B8;_i = 0\) &#x548C; \(&#x3B8;_j &#x2260; 0\)&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; \(\tilde{\theta}\) &#x6765;&#x6DF7;&#x5408;&#x8868;&#x793A; \(&#x3B8;_i\) &#x548C; \(&#x3B8;_j\)&#xFF0C;&#x5373;&#x5BF9;&#x4E8E;&#x6240;&#x6709; \(n &#x2260; i,j\)&#xFF0C;&#x4E14; \(\tilde{\theta}_i = \tilde{\theta}_j = (1&#x2044;2)\theta_j\)&#xFF0C;&#x6EE1;&#x8DB3; \(\tilde{\theta}_n = \theta_n\)&#x3002;&#x6211;&#x4EEC;&#x63D0;&#x51FA;&#x5229;&#x7528; \(\tilde{\theta}\) &#x83B7;&#x5F97;&#x4E86;&#x4E00;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#xFF1A;\(\log \left(2 e^{\theta_{j}} - 1\right) &lt; 2 \log \left(2 e^{\theta_{j} / 2} - 1\right)\)&#x3002;&#x8FD9;&#x6765;&#x81EA;&#x4E8E; Jensen &#x4E0D;&#x7B49;&#x5F0F;&#xFF08;&#x522B;&#x79F0;&#xFF1A;&#x7434;&#x751F;&#x4E0D;&#x7B49;&#x5F0F;&#x6216;&#x8A79;&#x68EE;&#x4E0D;&#x7B49;&#x5F0F;&#xFF09;&#x548C;&#x4E25;&#x683C;&#x7684;&#x51F9;&#x51FD;&#x6570;&#x3002;&#x56E0;&#x6B64;&#xFF0C;\(\theta^{*}\) &#x662F;KKT&#x6761;&#x4EF6;&#x7684;&#x552F;&#x4E00;&#x4E0D;&#x52A8;&#x70B9;&#xFF0C;&#x8FD9;&#x662F;&#x65E0;&#x6CD5;&#x518D;&#x88AB;&#x6539;&#x8FDB;&#x7684;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>In terms of the reward function, this translates into \(S(n)/S(n-1) = (1+R)^{1/T}\) and \(r(n) = (1+R)^{n/T} - (1-R)^{(n-1)&#x2044;T}\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5C31;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x7FFB;&#x8BD1;&#x6210;&#xFF1A;\(S(n)/S(n-1) = (1+R)^{1/T}\) &#x548C; \(r(n) = (1+R)^{n/T} - (1-R)^{(n-1)&#x2044;T}\)&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="_7_2_3_2_equitable_choices_of_the_total_reward_r_r">7.2.3.2  Equitable choices of the total reward R&#xFF08;&#x603B;&#x5956;&#x52B1;R&#x7684;&#x5408;&#x7406;&#x9009;&#x62E9;&#xFF09;</h4>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The equitability of a system is determined by four factors: the number of block proposals \(T\), choice of reward function \(r\), initial stake of a party \(\upsilon_A(0)\), and the total reward \(R\). Note that because we normalized the initial stake \(S(0)\) to be one, \(R\) represents the ratio between the total rewards dispensed and the initial stake \(S(0)\). Some of these factors should be chosen with respect to external factors (e.g. interest rate and valuation of the crypto currency) and practical considerations (e.g. incentivizing participation of proposers). In this section, we study the scenario where the system designer has the freedom to choose \(R\), either by setting the initial stake size \(S(0)\) and / or by setting the total reward during \(T\). The focus in how equitability trades off with the choice of \(R\), and how this trade-off changes with respect to the choice of the reward function \(r\) during this interval.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5747;&#x8861;&#x6027;&#x7531;&#x56DB;&#x4E2A;&#x56E0;&#x7D20;&#x51B3;&#x5B9A;&#xFF1A;&#x51FA;&#x5757;&#x6570;&#x91CF; \(T\)&#x3001;&#x5956;&#x52B1;&#x51FD;&#x6570; \(r\) &#x7684;&#x9009;&#x62E9;&#x3001;&#x67D0;&#x4E00;&#x4E2A;&#x53C2;&#x4E0E;&#x65B9;&#x7684;&#x521D;&#x59CB;&#x6743;&#x76CA; \(\upsilon_A (0)\) &#x548C;&#x603B;&#x5956;&#x52B1; \(R\)&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x5C06;&#x521D;&#x59CB;&#x6743;&#x76CA; \(S(0)\) &#x6807;&#x51C6;&#x5316;&#x4E3A; \(1\)&#xFF0C;\(R\) &#x4EE3;&#x8868;&#x5206;&#x914D;&#x7684;&#x603B;&#x5956;&#x52B1;&#x548C;&#x521D;&#x59CB;&#x80A1;&#x4EFD; \(S(0)\) &#x4E4B;&#x95F4;&#x7684;&#x6BD4;&#x7387;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x56E0;&#x7D20;&#x5E94;&#x6839;&#x636E;&#x5916;&#x90E8;&#x56E0;&#x7D20;&#xFF08;&#x5982;&#x5229;&#x7387;&#x548C;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x4F30;&#x503C;&#xFF09;&#x548C;&#x5B9E;&#x9645;&#x8003;&#x8651;&#x56E0;&#x7D20;&#xFF08;&#x5982;&#x6FC0;&#x52B1;&#x51FA;&#x5757;&#x4EBA;&#x53C2;&#x4E0E;&#xFF09;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E86;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x8005;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x9009;&#x62E9; \(R\) &#x7684;&#x573A;&#x666F;&#xFF0C;&#x8981;&#x4E48;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x7684;&#x5927;&#x5C0F; \(S(0)\) &#xFF0C;&#x8981;&#x4E48;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E; \(T\) &#x671F;&#x95F4;&#x7684;&#x603B;&#x5956;&#x52B1;&#xFF0C;&#x6216;&#x8005;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x540C;&#x65F6;&#x8BBE;&#x7F6E;&#x3002;&#x91CD;&#x70B9;&#x8BA8;&#x8BBA;&#x4E86;&#x5728;&#x5747;&#x8861;&#x6027;&#x548C; \(R\) &#x7684;&#x9009;&#x62E9;&#x4E4B;&#x95F4;&#x5982;&#x4F55;&#x505A;&#x51FA;&#x6743;&#x8861;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x79CD;&#x6743;&#x8861;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x671F;&#x95F4;&#x5982;&#x4F55;&#x968F;&#x7740;&#x5956;&#x52B1;&#x51FD;&#x6570; \(r\) &#x7684;&#x9009;&#x62E9;&#x800C;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Concretely, we consider a scenario where T is a large enough integer, and \(\upsilon_A (0)\) of each party is also fixed as it is not up to the system designer to choose. To make the system more equitable, we want to minimize the variance of the final stake of all parties simultaneously. We study what choices of \(R\) and \(r\) achieve a desired level of variance, normalized by \((\upsilon_A (0) - \upsilon_A(0)^2 )\) which is the worst-case variance for each party. This happens when the fractional stake \(\upsilon_A (T)\) converges to a binary distribution with support set \({0,1\}\). As \(\mathbb{E} [\upsilon_{A} (T) ] = \upsilon_{A} (0)\), the variance of this Bernoulli distribution is \(\upsilon_A (0) - \upsilon_A(0)^2\) . Among all distributions supported on \([0,1]\) with mean \(\upsilon_A (0)\), this has the largest variance.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#xFF0C;\(T\) &#x662F;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x6574;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E00;&#x65B9;&#x7684; \(\upsilon_A (0)\) &#x4E5F;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E0D;&#x53D6;&#x51B3;&#x4E8E;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x8005;&#x7684;&#x9009;&#x62E9;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x7CFB;&#x7EDF;&#x66F4;&#x52A0;&#x516C;&#x5E73;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x540C;&#x65F6;&#x6700;&#x5C0F;&#x5316;&#x5404;&#x65B9;&#x6700;&#x7EC8;&#x6743;&#x76CA;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E86;&#x5982;&#x4F55;&#x9009;&#x62E9; \(R\) &#x548C; \(r\) &#x4ECE;&#x800C;&#x80FD;&#x8FBE;&#x5230;&#x671F;&#x671B;&#x7684;&#x65B9;&#x5DEE;&#x6C34;&#x5E73;&#xFF0C;&#x6807;&#x51C6;&#x5316;&#x4E3A; \((\upsilon_A (0) - \upsilon_A(0)^2 )\)&#xFF0C;&#x8FD9;&#x662F;&#x6BCF;&#x4E00;&#x65B9;&#x5728;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x65B9;&#x5DEE;&#x3002;&#x5F53;&#x6743;&#x76CA;&#x5206;&#x6570; \(\upsilon_A (T)\) &#x6536;&#x655B;&#x4E8E;&#x4E00;&#x4E2A;&#x652F;&#x6491;&#x96C6;&#x4E3A; \({0,1\}\) &#x7684;&#x4E8C;&#x5143;&#x5206;&#x5E03;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x5F53;&#x671F;&#x671B; \(\mathbb{E} [\upsilon_{A} (T) ] = \upsilon_{A} (0)\) &#x65F6;&#xFF0C;&#x6B64;&#x4F2F;&#x52AA;&#x5229;&#x5206;&#x5E03;&#x7684;&#x65B9;&#x5DEE;&#x4E3A; \(\upsilon_A (0) - \upsilon_A(0)^2\)&#x3002;&#x652F;&#x6491;&#x96C6;&#x5728;&#x533A;&#x95F4; \([0,1]\) &#x4E0A;&#x3001;&#x5E73;&#x5747;&#x6570;&#x4E3A; \(\upsilon_A (0)\)&#x7684;&#x6240;&#x6709;&#x5206;&#x5E03;&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x5927;&#x65B9;&#x5DEE;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Geometric reward function.</strong>   For \(r_g(n)\), we have \(e^(&#x3B8;_n)=(1+R)^(1&#x2044;T)\). It follows from <strong>Lemma 7.2.2</strong> that</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x51FD;&#x6570;</strong>  \(\quad\)  &#x5BF9;&#x4E8E; \(r_g (n)\)&#xFF0C;&#x6709; \(e^(&#x3B8;_n )=(1+R)^(1&#x2044;T)\)&#x3002;&#x4F9D;&#x636E;<strong>&#x5F15;&#x7406;7.2.2</strong>&#xFF0C;&#x5219;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\frac{\operatorname{Var} \left(\upsilon_{A, r_{g}}(T) \right)} {\upsilon_{A}(0) - \upsilon_{A}(0)^{2}} = 1 - \frac {\left(2(1+R)^{1 / T} - 1 \right)^{T}} {(1+R)^{2}}
\ \quad \quad \quad \quad \quad \quad (7.19)
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>When \(R\) is fixed and we increase \(T\), we can distribute small amounts of rewards across \(T\) and achieve vanishing variance. On the other hand, if \(R\) increases much faster than \(T\), then we are giving out increasing amounts of rewards per time slot and the uncertainty grows. This follows from the above variance formula, which we make precise in the following.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5F53; \(R\) &#x56FA;&#x5B9A;&#x65F6;&#xFF0C;&#x63D0;&#x9AD8; \(T\), &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728; \(T\) &#x671F;&#x95F4;&#x5185;&#x5206;&#x914D;&#x5C0F;&#x91CF;&#x5956;&#x52B1;&#x5B9E;&#x73B0;&#x96F6;&#x65B9;&#x5DEE;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C; \(R\) &#x7684;&#x589E;&#x957F;&#x901F;&#x5EA6;&#x6BD4; \(T\) &#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#x7ED9;&#x4E88;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5956;&#x52B1;&#xFF0C;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x5C31;&#x4F1A;&#x589E;&#x52A0;&#x3002;&#x8FD9;&#x662F;&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x5DEE;&#x516C;&#x5F0F;&#x5F97;&#x51FA;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E0B;&#x9762;&#x505A;&#x4E86;&#x6E05;&#x6670;&#x7684;&#x8BF4;&#x660E;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Proposition 7.2.3.</strong> \(\quad\) For a closed PoS system with a total reward \(R(T)\) chosen as a function of T and a <strong>geometric reward function</strong> \(r_g (n)=(1+R(T))^(n&#x2044;T) - (1+R(T))^((n-1)&#x2044;T)\), it is sufficient and necessary to set</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>\begin{equation}
R(T)=\left(\left(\frac{1}{1-\sqrt{\frac{\log (1 /(1-\varepsilon))}{T}}}\right)^{T}-1\right)(1+o(1))
\quad \quad \quad \quad \quad \quad (7.20)
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>in order to achieve \(\lim_{T \rightarrow \infty} \operatorname{Var}\left(\upsilon_{A, r_{g}} (T) \right) = \varepsilon\left(\upsilon_{A}(0) - \upsilon_{A} (0)^{2} \right)\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x547D; &#x9898;7.2.3.</strong> \(\quad\) &#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5C01;&#x95ED;&#x5F0F; PoS &#x7CFB;&#x7EDF;&#xFF0C;&#x8BBE;&#x5176;&#x603B;&#x5956;&#x52B1;&#x9009;&#x62E9;&#x4E3A;&#x5173;&#x4E8E; \(T\) &#x7684;&#x51FD;&#x6570; \(R(T)\)&#xFF0C;&#x4EE5;&#x53CA;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x51FD;&#x6570; \(r_g (n)=(1+R(T))^(n&#x2044;T) - (1+R(T))^((n-1)&#x2044;T)\)&#xFF0C;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x6781;&#x9650;&#x503C; \(\lim_{T \rightarrow \infty} \operatorname{Var}\left(\upsilon_{A, r_{g}} (T) \right) = \varepsilon\left(\upsilon_{A}(0) - \upsilon_{A} (0)^{2} \right)\)&#xFF0C;&#x5C06; \(R(T)\) &#x6309;&#x516C;&#x5F0F;7.20&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#x662F;&#x4E00;&#x4E2A;&#x5145;&#x5206;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This follows from substituting the choice of \(R(T)\) in the variance in Eq. (7.19), which gives</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x6765;&#x6E90;&#x4E8E;&#x7B49;&#x5F0F;&#xFF08;7.19&#xFF09;&#x4E2D;&#x7528;&#x65B9;&#x5DEE;&#x66FF;&#x6362; \(R(T)\) &#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5B83;&#x7ED9;&#x51FA;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\begin{aligned} \lim_{T \rightarrow \infty} \frac {\operatorname{Var} (\upsilon_{A,r_g}(T))} {\upsilon_A (0) - \upsilon_A (0)^{2}} &amp;= \lim _{T \rightarrow \infty} 1 - \left(1 - \frac {\log (1 /(1-\varepsilon))} {T} \right)^{T}(1+o(1))
\\ &amp;=\varepsilon \end{aligned}
\ \quad \quad \quad \quad \quad \quad (7.21)
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This is monotonically non-decreasing in R and non-increasing in \(T\), as expected from our intuition. For example, if R is fixed, one can have the initial stake \(S(0)\) as small as \(\exp (-\sqrt{\mathrm{T}} / (\log T))\) and still achieve a vanishing variance. As the geometric reward function achieves the smallest variance (Theorem 2), the above \(R(T)\) is the largest reward that can be dispensed while achieving a desired normalized variance of \(\varepsilon\) in time \(T\) (with initial stake of one). This scales as \(R(T) \simeq(1 + 1 / \sqrt{\mathrm{T}})^{T} \simeq \mathrm{e}^{\sqrt{T}}\). Equivalently \(R/R(T)\) is the smallest initial stake one can start with, while dispensing \(R\) rewards in time stem[T]. We need more initial stake or less total reward, if we choose to use other reward functions.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x7684;&#x76F4;&#x89C9;&#x6240;&#x9884;&#x671F;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x662F;&#x5728; \(R\) &#x548C; \(T\) &#x4E0A;&#x662F;&#x5355;&#x8C03;&#x975E;&#x9012;&#x51CF;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C; \(R\) &#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x521D;&#x59CB;&#x6743;&#x76CA; \(S(0)\) &#x53EF;&#x4EE5;&#x5C0F;&#x5230; \(\exp (-\sqrt{\mathrm{T}} / (\log T))\)&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x96F6;&#x65B9;&#x5DEE;&#x3002;&#x5F53;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x65B9;&#x5DEE;&#xFF08;&#x5B9A;&#x7406;2&#xFF09;&#xFF0C;&#x4E0A;&#x9762;&#x7684; \(R(T)\) &#x662F;&#x53EF;&#x5206;&#x914D;&#x7684;&#x6700;&#x5927;&#x5956;&#x52B1;&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x5728;&#x65F6;&#x95F4; \(T\) &#x5185;&#x6E34;&#x671B;&#x7684;&#x6807;&#x51C6;&#x65B9;&#x5DEE; \(\varepsilon\)&#xFF08;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x662F;1&#xFF09;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x7528; \(R(T) \simeq(1 + 1 / \sqrt{\mathrm{T}})^{T} \simeq \mathrm{e}^{\sqrt{T}}\) &#x6765;&#x8861;&#x91CF;&#x3002;&#x76F8;&#x7B49;&#x5730;&#xFF0C;&#x5F53;&#x5728;&#x65F6;&#x95F4; \(T\) &#x5185;&#x5206;&#x914D; \(R\) &#x5956;&#x52B1;&#x65F6;&#xFF0C;\(R/R(T)\) &#x662F;&#x67D0;&#x4E00;&#x65B9;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x7684;&#x6700;&#x5C0F;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x7684;&#x5956;&#x52B1;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6216;&#x8005;&#x66F4;&#x5C11;&#x7684;&#x5956;&#x52B1;&#x603B;&#x989D;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Geometric rewards may not be appropriate in practice. If one were to concatenate multiple epochs with geometric reward functions, the drop in block rewards from the end of one epoch to the beginning of the next could be dramatic. This could cause proposers to (temporarily) leave the system, thereby preventing blockchain growth. Hence for purely practical reasons, geometric rewards may be a less desirable solution than constant rewards. We therefore include analogous variance calculations for the constant reward function. Specifically, our focus is on understanding how large the initial stake pool needs to be in order to ensure low variance in proposer stake.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x53EF;&#x80FD;&#x4E0D;&#x5408;&#x9002;&#x3002;&#x5982;&#x679C;&#x8981;&#x5C06;&#x591A;&#x4E2A;&#x7EAA;&#x5143;&#x4E0E;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x7EAA;&#x5143;&#x7684;&#x7ED3;&#x675F;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x7EAA;&#x5143;&#x7684;&#x5F00;&#x59CB;&#xFF0C;&#x5757;&#x5956;&#x52B1;&#x7684;&#x51CF;&#x5C11;&#x53EF;&#x80FD;&#x4F1A;&#x662F;&#x620F;&#x5267;&#x6027;&#x7684;&#xFF08;&#x8BD1;&#x8005;&#x8A00;&#xFF1A;&#x91C7;&#x7528;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#xFF0C;&#x4E24;&#x4E2A;&#x65F6;&#x95F4;&#x7EAA;&#x5143;&#x95F4;&#x7684;&#x8FC7;&#x6E21;&#x662F;&#x65AD;&#x5D16;&#x5F0F;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x6BD4;&#x7279;&#x5E01;&#x4EE5;&#x56DB;&#x5E74;&#x4E3A;&#x4E00;&#x4E2A;&#x7EAA;&#x5143;&#xFF0C;&#x5757;&#x5956;&#x52B1;&#x56DB;&#x5E74;&#x51CF;&#x534A;&#xFF09;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x51FA;&#x5757;&#x8005;&#xFF08;&#x6682;&#x65F6;&#xFF09;&#x79BB;&#x5F00;&#x7CFB;&#x7EDF;&#xFF0C;&#x4ECE;&#x800C;&#x963B;&#x788D;&#x533A;&#x5757;&#x94FE;&#x7684;&#x6210;&#x957F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7EAF;&#x7CB9;&#x51FA;&#x4E8E;&#x5B9E;&#x9645;&#x539F;&#x56E0;&#xFF0C;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x53EF;&#x80FD;&#x662F;&#x6BD4;&#x56FA;&#x5B9A;&#x5956;&#x52B1;&#x66F4;&#x4E0D;&#x7406;&#x60F3;&#x7684;&#x65B9;&#x6848;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x56FA;&#x5B9A;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x8BA1;&#x5165;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5DEE;&#x8BA1;&#x7B97;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x4E86;&#x89E3;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x6C60;&#x9700;&#x8981;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x624D;&#x80FD;&#x786E;&#x4FDD;&#x51FA;&#x5757;&#x4EBA;&#x6743;&#x76CA;&#x7684;&#x4F4E;&#x65B9;&#x5DEE;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Constant reward function.</strong> \(\quad\) Consider the constant reward function of Eq. (7.7). As \(e^{\theta_{n}} = (1 + nR / T) /(1 + (n-1) R / T)\), it follows from Lemma 7.2.2 that</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x56FA;&#x5B9A;&#x5956;&#x52B1;&#x51FD;&#x6570;</strong> \(\quad\) &#x8003;&#x8651;&#x65B9;&#x7A0B;&#xFF08;7.7&#xFF09;&#x7684;&#x56FA;&#x5B9A;&#x5956;&#x52B1;&#x51FD;&#x6570;&#x3002;&#x7531;&#x4E8E; \(e^{\theta_{n}} = (1 + nR / T) /(1 + (n-1) R / T)\)&#xFF0C;&#x4ECE;&#x5F15;&#x7406; 7.2.2 &#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\begin{aligned} \frac{\operatorname{Var} \left(\upsilon_{A,r_c} (T)\right)} {\upsilon_{A}(0) - \upsilon_A (0)^{2}} &amp;= 1- \frac {1 + R + \frac{R}{T}} {1 + R + \frac{R}{T} + \frac {R^{2}} {T}} \\ &amp;= \frac {R^{2}} {(T+R)(1+R)} \end{aligned}
\ \quad \quad \quad \quad \quad \quad (7.22)
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Again, this is monotonically non-decreasing in \(R\) and non-increasing in \(T\), as expected. The following condition immediately follows from Eq. (7.22).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x518D;&#x8005;&#xFF0C;&#x679C;&#x4E0D;&#x5176;&#x7136;&#xFF0C;&#x8FD9;&#x662F;&#x5728; \(R\) &#x4E0A;&#x5355;&#x8C03;&#x975E;&#x9012;&#x51CF;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5728; \(T\) &#x4E0A;&#x4E5F;&#x662F;&#x5355;&#x8C03;&#x975E;&#x9012;&#x51CF;&#x7684;&#x3002;&#x4ECE;&#x7B49;&#x5F0F;&#xFF08;7.22&#xFF09;&#x53EF;&#x4EE5;&#x7ACB;&#x523B;&#x5F97;&#x51FA;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Proposition 7.2.4.</strong> \(\quad\) For a closed PoS system with a total reward \(R(T)\) chosen as a function of \(T\) and a constant reward function  \(r_c (n) = R(T)&#x2044;T\), it is sufficient and necessary to set</p>
</div>
<div class="paragraph">
<p>\begin{equation}
R(T) = \frac {\varepsilon T} {1 - \varepsilon} (1+o(1)),
\ \quad \quad \quad \quad \quad \quad (7.23)
\end{equation}</p>
</div>
<div class="paragraph">
<p>in order to achieve \(\lim_{T \rightarrow \infty} \operatorname{Var} \left(\upsilon_{A,r_c}(T) \right) = \varepsilon \left(\upsilon_{A}(0) - \upsilon_{A}(0)^{2}\right)\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x547D; &#x9898; 7.2.4.</strong> \(\quad\) &#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x603B;&#x5956;&#x52B1;&#x4E3A; \(R(T)\) &#x4E14;&#x9009;&#x62E9;&#x56FA;&#x5B9A;&#x5956;&#x52B1;&#x51FD;&#x6570; \(r_c (n)\) &#x7684;&#x5C01;&#x95ED;&#x5F0F; PoS &#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x4E2D; \(R(T)\) &#x662F;&#x5173;&#x4E8E;T&#x7684;&#x51FD;&#x6570;&#xFF0C;\(r_c (n) = R(T)&#x2044;T\)&#xFF0C;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x6781;&#x9650; \(\lim_{T \rightarrow \infty} \operatorname{Var} \left(\upsilon_{A,r_c}(T) \right) = \varepsilon \left(\upsilon_{A}(0) - \upsilon_{A}(0)^{2}\right)\)&#xFF0C;&#x5C06; \(R(T)\) &#x8BBE;&#x7F6E;&#x4E3A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
R(T) = \frac {\varepsilon T} {1 - \varepsilon} (1+o(1)),
\ \quad \quad \quad \quad \quad \quad (7.23)
\end{equation}</p>
</div>
<div class="paragraph">
<p>&#x662F;&#x5145;&#x5206;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#xFF08;&#x6CE8;&#xFF1A;\(&#x3BF;(1)\)&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5173;&#x4E8E; \(1\) &#x7684;&#x9AD8;&#x9636;&#x65E0;&#x7A77;&#x5C0F;,&#x4E5F;&#x5C31;&#x8BF4;&#x6709;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E0E; \(1\) &#x76F8;&#x6BD4;&#x7684;&#x6781;&#x9650;&#x4E3A; \(0\); &#x4F8B;&#x5982;&#xFF1A;&#x82E5; \(lim(&#x3B2;/&#x3B1;)=0\)&#xFF0C;&#x5219;&#x79F0;&#x201C;\(&#x3B2;\) &#x662F;&#x6BD4; \(&#x3B1;\) &#x8F83;&#x9AD8;&#x9636;&#x7684;&#x65E0;&#x7A77;&#x5C0F;&#x201D;&#x3002;&#x610F;&#x601D;&#x662F;&#x5728;&#x67D0;&#x4E00;&#x8FC7;&#x7A0B;(\(x&#x2192;x_0\)&#x6216; \(x&#x2192;&#x221E;\) &#x8FD9;&#x7C7B;&#x8FC7;&#x7A0B;)&#x4E2D;&#xFF0C;\(&#x3B2;&#x2192;0\) &#x6BD4; \(&#x3B1;&#x2192;0\) &#x5FEB;&#x4E00;&#x4E9B;&#xFF09;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>By choosing a constant reward function, the cost we pay is in the size of the total reward, which can only scale as \(O(T)\). Compared to \(R(T) \simeq e^{\sqrt{T}}\) of the geometric reward, there is a significant gap. Similarly, in terms of how small initial stake can be with fixed total reward \(R\), constant reward requires at least \(S(0) \simeq R/T\). Hence by choosing \(S(0)\) to be at least a constant fraction of the sum block rewards over time, we can ensure low variance even with a constant reward function.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5956;&#x52B1;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x652F;&#x4ED8;&#x6210;&#x672C;&#x662F;&#x603B;&#x5956;&#x52B1;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x7528; \(O(T)\) &#x6765;&#x8861;&#x91CF;&#x3002;&#x4E0E;&#x51E0;&#x4F55;&#x5956;&#x52B1;&#x7684; \(R(T) \simeq e^{\sqrt{T}}\) &#x76F8;&#x6BD4;&#xFF0C;&#x5B58;&#x5728;&#x660E;&#x663E;&#x7684;&#x5DEE;&#x8DDD;&#x3002;&#x76F8;&#x4F3C;&#x5730;&#xFF0C;&#x5C31;&#x56FA;&#x5B9A;&#x603B;&#x5956;&#x4E3A; \(R\) &#x65F6;&#x521D;&#x59CB;&#x6743;&#x76CA;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x5C0F;&#x800C;&#x8A00;&#xFF0C;&#x56FA;&#x5B9A;&#x5956;&#x52B1;&#x8981;&#x6C42;&#x521D;&#x59CB;&#x603B;&#x6743;&#x76CA;&#x81F3;&#x5C11;&#x6EE1;&#x8DB3; \(S(0) \simeq R/T\)&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x9009;&#x62E9; \(S(0)\) &#x662F;&#x603B;&#x533A;&#x5757;&#x5956;&#x52B1;&#x7684;&#x4E00;&#x4E2A;&#x5E38;&#x6570;&#x6BD4;&#x4F8B;&#xFF0C;&#x5373;&#x4F7F;&#x4F7F;&#x7528;&#x56FA;&#x5B9A;&#x5956;&#x52B1;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x8F83;&#x4F4E;&#x7684;&#x65B9;&#x5DEE;&#x3002;</p>
</div>
</div>
</div>
</div>
</div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="CH01_Valuation.html" class="navigation navigation-prev " aria-label="Previous page: Valuation">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="CH03_Transaction_Fees.html" class="navigation navigation-next " aria-label="Next page: Transaction Fees">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Block Rewards","level":"1.1.3","depth":2,"next":{"title":"Transaction Fees","level":"1.1.4","depth":2,"path":"Chapter_7_Economics/CH03_Transaction_Fees.asciidoc","ref":"./Chapter_7_Economics/CH03_Transaction_Fees.asciidoc","articles":[]},"previous":{"title":"Valuation","level":"1.1.2","depth":2,"path":"Chapter_7_Economics/CH01_Valuation.asciidoc","ref":"./Chapter_7_Economics/CH01_Valuation.asciidoc","articles":[]},"dir":"ltr"},"config":{"plugins":["mathjax","sectionx","back-to-top-button"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sectionx":{},"highlight":{},"back-to-top-button":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Cryptoeconomics","gitbook":"*"},"file":{"path":"Chapter_7_Economics/CH02_Block_Rewards.asciidoc","mtime":"2019-04-20T15:59:04.350Z","type":"asciidoc"},"gitbook":{"version":"3.2.3","time":"2019-04-20T18:18:08.586Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

